000010**************
000020* CPYPDCE    *
000030**************
000040 01  EMP-1          PIC X(22).
000050 01  ARQCE-00.
000060     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000070     05 FILLER      PIC X(05) VALUE "EMPCE".
000080     05 COMP-00     PIC 99.
000090 01  ARQ02-BA.
000100     05 FILLER      PIC X(19) VALUE "../../arquivos/aba/".
000110     05 FILLER      PIC X(05) VALUE "ABA01".
000120     05 COMP-01     PIC 99.
000130 01  ARQ03-BA.
000140     05 FILLER      PIC X(19) VALUE "../../arquivos/aba/".
000150     05 FILLER      PIC X(05) VALUE "ABA03".
000160     05 COMP-02     PIC 99.
000170 01  ARQ01-CA.
000180     05 FILLER      PIC X(19) VALUE "../../arquivos/aca/".
000190     05 FILLER      PIC X(05) VALUE "ACA01".
000200     05 COMP-03     PIC 99.
000210 01  ARQ02-CA.
000220     05 FILLER      PIC X(19) VALUE "../../arquivos/aca/".
000230     05 FILLER      PIC X(05) VALUE "ACA02".
000240     05 COMP-04     PIC 99.
000250 01  ARQ03-CA.
000260     05 FILLER      PIC X(19) VALUE "../../arquivos/aca/".
000270     05 FILLER      PIC X(05) VALUE "ACA03".
000280     05 COMP-05     PIC 99.
000250 01  ARQ04-CA.
000260     05 FILLER      PIC X(19) VALUE "../../arquivos/aca/".
000270     05 FILLER      PIC X(05) VALUE "ACA04".
000280     05 COMP-06     PIC 99.
000290 01  ARQ05-CA.
000300     05 FILLER      PIC X(19) VALUE "../../arquivos/aca/".
000310     05 FILLER      PIC X(05) VALUE "ACA05".
000320     05 COMP-07     PIC 99.
000330 01  ARQC-01.
000340     05 FILLER      PIC X(19) VALUE "../../arquivos/acc/".
000350     05 FILLER      PIC X(05) VALUE "ACC01".
000360     05 COMP-08     PIC 99.
000330 01  ARQC-02.
000340     05 FILLER      PIC X(19) VALUE "../../arquivos/acc/".
000350     05 FILLER      PIC X(05) VALUE "ACC02".
000360     05 COMP-09     PIC 99.
000330 01  ARQC-03.
000340     05 FILLER      PIC X(19) VALUE "../../arquivos/acc/".
000350     05 FILLER      PIC X(05) VALUE "ACC03".
000360     05 COMP-10     PIC 99.
000370 01  ARQC-04.
000380     05 FILLER      PIC X(19) VALUE "../../arquivos/acc/".
000390     05 FILLER      PIC X(05) VALUE "ACC04".
000400     05 COMP-11     PIC 99.
000410 01  ARQC-06.
000420     05 FILLER      PIC X(19) VALUE "../../arquivos/acc/".
000430     05 FILLER      PIC X(05) VALUE "ACC06".
000440     05 COMP-12     PIC 99.
000450 01  ARQCE-01.
000460     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000470     05 FILLER      PIC X(05) VALUE "ACE01".
000480     05 COMP-13     PIC 99.
000490 01  ARQCE-02.
000500     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000510     05 FILLER      PIC X(05) VALUE "ACE02".
000520     05 COMP-14     PIC 99.
000530 01  ARQCE-03.
000540     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000550     05 FILLER      PIC X(05) VALUE "ACE03".
000560     05 COMP-15     PIC 99.
000530 01  ARQCE-04.
000540     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000550     05 FILLER      PIC X(05) VALUE "ACE04".
000560     05 COMP-16     PIC 99.
000530 01  ARQCE-05.
000540     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000550     05 FILLER      PIC X(05) VALUE "ACE05".
000560     05 COMP-17     PIC 99.
000570 01  ARQCE-06.
000580     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000590     05 FILLER      PIC X(05) VALUE "ACE06".
000600     05 COMP-18     PIC 99.
000610 01  ARQCE-07.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE07".
000640     05 COMP-19     PIC 99.
000610 01  ARQCE-08.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE08".
000640     05 COMP-20     PIC 99.
000610 01  ARQCE-09.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE09".
000640     05 COMP-21     PIC 99.
000610 01  ARQCE-10.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE10".
000640     05 COMP-22     PIC 99.
000610 01  ARQCE-11.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE11".
000640     05 COMP-23     PIC 99.
000610 01  ARQCE-12.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE12".
000640     05 COMP-24     PIC 99.
000610 01  ARQCE-13.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE13".
000640     05 COMP-25     PIC 99.
000610 01  ARQCE-14.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE14".
000640     05 COMP-26     PIC 99.
000610 01  ARQCE-15.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE15".
000640     05 COMP-27     PIC 99.
000610 01  ARQCE-16.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE16".
000640     05 COMP-28     PIC 99.
000610 01  ARQCE-17.
000620     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000630     05 FILLER      PIC X(05) VALUE "ACE17".
000640     05 COMP-29     PIC 99.
000650 01  ARQCE-18.
000660     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000670     05 FILLER      PIC X(05) VALUE "ACE18".
000680     05 COMP-30     PIC 99.
000690 01  ARQCE-19.
000700     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000710     05 FILLER      PIC X(05) VALUE "ACE19".
000720     05 COMP-31     PIC 99.
000690 01  ARQCE-20.
000700     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000710     05 FILLER      PIC X(05) VALUE "ACE20".
000720     05 COMP-32     PIC 99.
000730 01  ARQCE-21.
000740     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000750     05 FILLER      PIC X(05) VALUE "ACE21".
000760     05 COMP-33     PIC 99.
000770 01  ARQCE-22.
000780     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000790     05 FILLER      PIC X(05) VALUE "ACE22".
000800     05 COMP-34     PIC 99.
000810 01  ARQCE-23.
000820     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000830     05 FILLER      PIC X(05) VALUE "ACE23".
000840     05 COMP-35     PIC 99.
000810 01  ARQCE-24.
000820     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000830     05 FILLER      PIC X(05) VALUE "ACE24".
000840     05 COMP-36     PIC 99.
000810 01  ARQCE-25.
000820     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000830     05 FILLER      PIC X(05) VALUE "ACE25".
000840     05 COMP-37     PIC 99.
000810 01  ARQCE-26.
000820     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000830     05 FILLER      PIC X(05) VALUE "ACE26".
000840     05 COMP-38     PIC 99.
000810 01  ARQCE-27.
000820     05 FILLER      PIC X(19) VALUE "../../arquivos/ace/".
000830     05 FILLER      PIC X(05) VALUE "ACE27".
000840     05 COMP-39     PIC 99.
000850 01  ARQCF-01.
000860     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
000870     05 FILLER      PIC X(05) VALUE "ACF01".
000880     05 COMP-40     PIC 99.
000890 01  ARQCF-02.
000900     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
000910     05 FILLER      PIC X(05) VALUE "ACF02".
000920     05 COMP-41     PIC 99.
000930 01  ARQCF-03.
000940     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
000950     05 FILLER      PIC X(05) VALUE "ACF03".
000960     05 COMP-42     PIC 99.
000970 01  ARQCF-04.
000980     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
000990     05 FILLER      PIC X(05) VALUE "ACF04".
001000     05 COMP-43     PIC 99.
001010 01  ARQCF-05.
001020     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
001030     05 FILLER      PIC X(05) VALUE "ACF05".
001040     05 COMP-44     PIC 99.
001010 01  ARQCF-05.
001020     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
001030     05 FILLER      PIC X(05) VALUE "ACF07".
001040     05 COMP-45     PIC 99.
001010 01  ARQCF-05.
001020     05 FILLER      PIC X(19) VALUE "../../arquivos/acf/".
001030     05 FILLER      PIC X(05) VALUE "ACF08".
001040     05 COMP-46     PIC 99.
000050 01  ARQ00-ID.
000060     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
000070     05 FILLER      PIC X(05) VALUE "EMPCP".
000080     05 COMP-47     PIC 99.
001050 01  ARQ01-ID.
001060     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001070     05 FILLER      PIC X(05) VALUE "ACP01".
001080     05 COMP-48     PIC 99.
001090 01  ARQ02-ID.
001100     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001110     05 FILLER      PIC X(05) VALUE "ACP02".
001120     05 COMP-49     PIC 99.
001130 01  ARQ03-ID.
001140     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001150     05 FILLER      PIC X(05) VALUE "ACP03".
001160     05 COMP-50     PIC 99.
001170 01  ARQ04-ID.
001180     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001190     05 FILLER      PIC X(05) VALUE "ACP04".
001200     05 COMP-51     PIC 99.
001210 01  ARQ05-ID.
001220     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001230     05 FILLER      PIC X(05) VALUE "ACP05".
001240     05 COMP-52     PIC 99.
001250 01  ARQ06-ID.
001260     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001270     05 FILLER      PIC X(05) VALUE "ACP06".
001280     05 COMP-53     PIC 99.
001290 01  ARQ07-ID.
001300     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001310     05 FILLER      PIC X(05) VALUE "ACP07".
001320     05 COMP-54     PIC 99.
001330 01  ARQ08-ID.
001340     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001350     05 FILLER      PIC X(05) VALUE "ACP08".
001360     05 COMP-55     PIC 99.
001370 01  ARQ09-ID.
001380     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001390     05 FILLER      PIC X(05) VALUE "ACP09".
001400     05 COMP-56     PIC 99.
001370 01  ARQ10-ID.
001380     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001390     05 FILLER      PIC X(05) VALUE "ACP10".
001400     05 COMP-57     PIC 99.
001410 01  ARQ11-ID.
001420     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001430     05 FILLER      PIC X(05) VALUE "ACP11".
001440     05 COMP-58     PIC 99.
001450 01  ARQ12-ID.
001460     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001470     05 FILLER      PIC X(05) VALUE "ACP12".
001480     05 COMP-59     PIC 99.
001450 01  ARQ13-ID.
001460     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001470     05 FILLER      PIC X(05) VALUE "ACP13".
001480     05 COMP-60     PIC 99.
001490 01  ARQ14-ID.
001500     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001510     05 FILLER      PIC X(05) VALUE "ACP14".
001520     05 COMP-61     PIC 99.
001930 01  ARQ15-ID.
001940     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001950     05 FILLER      PIC X(04) VALUE "AMCR".
001960     05 COMP-62     PIC 99.
001530 01  ARQ16-ID.
001540     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001550     05 FILLER      PIC X(05) VALUE "ACP16".
001560     05 COMP-63     PIC 99.
001570 01  ARQ17-ID.
001580     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001590     05 FILLER      PIC X(05) VALUE "ACP17".
001600     05 COMP-64     PIC 99.
001530 01  ARQ18-ID.
001540     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001550     05 FILLER      PIC X(05) VALUE "ACP18".
001560     05 COMP-65     PIC 99.
001530 01  ARQ19-ID.
001540     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001550     05 FILLER      PIC X(05) VALUE "ACP19".
001560     05 COMP-66     PIC 99.
001650 01  ARQ20-ID.
001660     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001670     05 FILLER      PIC X(05) VALUE "ACP20".
001680     05 COMP-67     PIC 99.
001690 01  ARQ21-ID.
001700     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001710     05 FILLER      PIC X(05) VALUE "ACP21".
001720     05 COMP-68     PIC 99.
001890 01  ARQ22-ID.
001900     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
001910     05 FILLER      PIC X(04) VALUE "AMBC".
001920     05 COMP-69     PIC 99.
001970 01  ARQ23-ID.
001980     05 FILLER      PIC X(19) VALUE "../../arquivos/act/".
001990     05 FILLER      PIC X(04) VALUE "AMCT".
002000     05 COMP-70     PIC 99.
002090 01  ARQ01-CR.
002100     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
002110     05 FILLER      PIC X(05) VALUE "ACR01".
002120     05 COMP-71     PIC 99.
002090 01  ARQ02-CR.
002100     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
002110     05 FILLER      PIC X(05) VALUE "ACR02".
002120     05 COMP-72     PIC 99.
002090 01  ARQ03-CR.
002100     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
002110     05 FILLER      PIC X(05) VALUE "ACR03".
002120     05 COMP-73     PIC 99.
002130 01  ARQ04-CR.
002140     05 FILLER      PIC X(19) VALUE "../../arquivos/acp/".
002150     05 FILLER      PIC X(05) VALUE "ACR04".
002160     05 COMP-74     PIC 99.
001730 01  ARQCT-51.
001740     05 FILLER      PIC X(19) VALUE "../../arquivos/act/".
001750     05 FILLER      PIC X(05) VALUE "ACT51".
001760     05 COMP-75     PIC 99.
001770 01  ARQCT-52.
001780     05 FILLER      PIC X(19) VALUE "../../arquivos/act/".
001790     05 FILLER      PIC X(05) VALUE "ACT52".
001800     05 COMP-76     PIC 99.
001810 01  ARQCT-54.
001820     05 FILLER      PIC X(19) VALUE "../../arquivos/act/".
001830     05 FILLER      PIC X(05) VALUE "ACT54".
001840     05 COMP-77     PIC 99.
001850 01  ARQCT-55.
001860     05 FILLER      PIC X(19) VALUE "../../arquivos/act/".
001870     05 FILLER      PIC X(05) VALUE "ACT55".
001880     05 COMP-78     PIC 99.
002010 01  ARQLF-01.
002020     05 FILLER      PIC X(19) VALUE "../../arquivos/alf/".
002030     05 FILLER      PIC X(05) VALUE "ALF01".
002040     05 COMP-79     PIC 99.
002010 01  ARQLF-02.
002020     05 FILLER      PIC X(19) VALUE "../../arquivos/alf/".
002030     05 FILLER      PIC X(05) VALUE "ALF02".
002040     05 COMP-80     PIC 99.
002050 01  ARQLF-03.
002060     05 FILLER      PIC X(19) VALUE "../../arquivos/alf/".
002070     05 FILLER      PIC X(05) VALUE "ALF03".
002080     05 COMP-81     PIC 99.
002050 01  ARQLF-04.
002060     05 FILLER      PIC X(19) VALUE "../../arquivos/alf/".
002070     05 FILLER      PIC X(05) VALUE "ALF04".
002080     05 COMP-82     PIC 99.
002050 01  ARQLF-05.
002060     05 FILLER      PIC X(19) VALUE "../../arquivos/alf/".
002070     05 FILLER      PIC X(05) VALUE "ALF05".
002080     05 COMP-83     PIC 99.
002170 01  ARQPA-01.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT01".
002200     05 COMP-84     PIC 99.
002170 01  ARQPA-02.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT02".
002200     05 COMP-85     PIC 99.
002170 01  ARQPA-03.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT03".
002200     05 COMP-86     PIC 99.
002170 01  ARQPA-04.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT04".
002200     05 COMP-87     PIC 99.
002170 01  ARQPA-05.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT05".
002200     05 COMP-88     PIC 99.
002170 01  ARQPA-06.
002180     05 FILLER      PIC X(19) VALUE "../../arquivos/apt/".
002190     05 FILLER      PIC X(05) VALUE "APT06".
002200     05 COMP-89     PIC 99.
002210 01  ARQ01-VD.
002220     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002230     05 FILLER      PIC X(05) VALUE "AVD01".
002240     05 COMP-90     PIC 99.
002250 01  ARQ10-VD.
002260     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002270     05 FILLER      PIC X(05) VALUE "AVD10".
002280     05 COMP-91     PIC 99.
002290 01  ARQ11-VD.
002300     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002310     05 FILLER      PIC X(05) VALUE "AVD11".
002320     05 COMP-92     PIC 99.
002330 01  ARQ12-VD.
002340     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002350     05 FILLER      PIC X(05) VALUE "AVD12".
002360     05 COMP-93     PIC 99.
002370 01  ARQ13-VD.
002380     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002390     05 FILLER      PIC X(05) VALUE "AVD13".
002400     05 COMP-94     PIC 99.
002410 01  ARQ14-VD.
002420     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002430     05 FILLER      PIC X(05) VALUE "AVD14".
002440     05 COMP-95     PIC 99.
002450 01  ARQ15-VD.
002460     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002470     05 FILLER      PIC X(05) VALUE "AVD15".
002480     05 COMP-96     PIC 99.
002450 01  ARQ16-VD.
002460     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002470     05 FILLER      PIC X(05) VALUE "AVD16".
002480     05 COMP-97     PIC 99.
002490 01  ARQ17-VD.
002500     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002510     05 FILLER      PIC X(05) VALUE "AVD17".
002520     05 COMP-98     PIC 99.
002530 01  ARQ18-VD.
002540     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002550     05 FILLER      PIC X(05) VALUE "AVD18".
002560     05 COMP-99     PIC 99.
002570 01  ARQ19-VD.
002580     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002590     05 FILLER      PIC X(05) VALUE "AVD19".
002600     05 COMP-63     PIC 99.
002610 01  ARQ20-VD.
002620     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002630     05 FILLER      PIC X(05) VALUE "AVD20".
002640     05 COMP-64     PIC 99.
002650 01  ARQ22-VD.
002660     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002670     05 FILLER      PIC X(05) VALUE "AVD22".
002680     05 COMP-65     PIC 99.
002690 01  ARQ23-VD.
002700     05 FILLER      PIC X(19) VALUE "../../arquivos/avd/".
002710     05 FILLER      PIC X(05) VALUE "AVD23".
002720     05 COMP-66     PIC 99.
002730 01  ARQ01-CB.
002740     05 FILLER      PIC X(19) VALUE "../../arquivos/acb/".
002750     05 FILLER      PIC X(05) VALUE "ACBLA".
002760     05 COMP-67     PIC 99.
002770 01  ARQ02-CB.
002780     05 FILLER      PIC X(19) VALUE "../../arquivos/acb/".
002790     05 FILLER      PIC X(05) VALUE "ACBPC".
002800     05 COMP-68     PIC 99.
002810 01  ARQ03-CB.
002820     05 FILLER      PIC X(19) VALUE "../../arquivos/acb/".
002830     05 FILLER      PIC X(05) VALUE "ACBHI".
002840     05 COMP-69     PIC 99.
002850 01  ARQFL-2.
002860     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
002870     05 FILLER   PIC X(07) VALUE "AFL0201".
002880 01  ARQFL-06.
002890     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
002900     05 FILLER   PIC X(07) VALUE "AFL0601".
002910 01  ARQFL-07.
002920     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
002930     05 FILLER   PIC X(05) VALUE "AFL07".
002940     05 COMP-70  PIC 99.
002950 01  ARQFL-08.
002960     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
002970     05 FILLER   PIC X(05) VALUE "AFL08".
002980     05 COMP-71  PIC 99.
002990 01  ARQFL-09.
003000     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
003010     05 FILLER   PIC X(05) VALUE "AFL09".
003020     05 COMP-72  PIC 99.
003030 01  ARQFL-10.
003040     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
003050     05 FILLER   PIC X(05) VALUE "AFL10".
003060     05 COMP-73  PIC 99.
003070 01  ARQFL-11.
003080     05 FILLER   PIC X(19) VALUE "../../arquivos/afl/".
003090     05 FILLER   PIC X(05) VALUE "AFL11".
003100     05 COMP-74  PIC 99.
003110 01  ARQCI-01.
003120     05 FILLER   PIC X(19) VALUE "../../arquivos/ace/".
003130     05 FILLER   PIC X(05) VALUE "ACI01".
003140     05 COMP-75  PIC 99.
003150*===========================================
003160*LINKAGE SECTION.
003170 01  PARAM-W.
003180     05 PROG-W        PIC X(8).
003190     05 PW-W          PIC X(4).
003200     05 ARG-W         PIC 9(6).
003210     05 FILLER REDEFINES ARG-W.
003220        07 FILLER     PIC X(4).
003230        07 COMP-W     PIC 99.
003240 COPY "/dados1/book/TELASIS".
003250 PROCEDURE DIVISION CHAINING PARAM-W.
003260 INICIO.
003270     MOVE ARG-W TO COMP-00.
003280     MOVE ARG-W TO COMP-01 COMP-02 COMP-03 COMP-04 COMP-05
003290                   COMP-06 COMP-07 COMP-08 COMP-09 COMP-10.
003300     MOVE ARG-W TO COMP-11 COMP-12 COMP-13 COMP-14 COMP-15
003310                   COMP-16 COMP-17 COMP-18 COMP-19 COMP-20.
003320     MOVE ARG-W TO COMP-21 COMP-22 COMP-23 COMP-24 COMP-25
003330                   COMP-26 COMP-27 COMP-28 COMP-29 COMP-30.
003340     MOVE ARG-W TO COMP-31 COMP-32 COMP-33 COMP-34 COMP-35
003350                   COMP-36 COMP-37 COMP-38 COMP-39 COMP-40.
003360     MOVE ARG-W TO COMP-41 COMP-42 COMP-43 COMP-44 COMP-45
003370                   COMP-46 COMP-47 COMP-48 COMP-49 COMP-50.
003380     MOVE ARG-W TO COMP-51 COMP-52 COMP-53 COMP-54 COMP-55
003390                   COMP-56 COMP-57 COMP-58 COMP-59 COMP-60.
003400     MOVE ARG-W TO COMP-61 COMP-62 COMP-63 COMP-64 COMP-65
003410                   COMP-66 COMP-67 COMP-68 COMP-69 COMP-70
003420                   COMP-71 COMP-72 COMP-73 COMP-74 COMP-75.
003430     GO TO INICIA.
003440*-----------F-I-M---------------------
