000010***************************************************
000020* CPYPDBA - COPY DA ABERTURA DO SISTEMA DE BANCO  *
000030***************************************************
000040 01  ARQ00-BA.
000050     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000060     05 FILLER          PIC X(05) VALUE "EMPBA".
000070     05 COMP-00         PIC 99.
000080 01  ARQ01-BA.
000090     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000100     05 FILLER          PIC X(05) VALUE "ABA01".
000110     05 COMP-01         PIC 99.
000120 01  ARQ02-BA.
000130     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000140     05 FILLER          PIC X(05) VALUE "ABA02".
000150     05 COMP-02         PIC 99.
000160 01  ARQ03-BA.
000170     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000180     05 FILLER          PIC X(05) VALUE "ABA03".
000190     05 COMP-03         PIC 99.
000200 01  ARQ04-BA.
000210     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000220     05 FILLER          PIC X(05) VALUE "ABA04".
000230     05 COMP-04         PIC 99.
000240 01  ARQ05-BA.
000250     05 FILLER          PIC X(19) VALUE "../../arquivos/aba/".
000260     05 FILLER          PIC X(05) VALUE "ABA05".
000270     05 COMP-05         PIC 99.
000280 01  ARQ04-CA.
000290     05 FILLER          PIC X(19) VALUE "../../arquivos/aca/".
000300     05 FILLER          PIC X(05) VALUE "ACA04".
000310     05 COMP-06         PIC 99.
000320 01  EX-BRANCO          PIC X(78) VALUE SPACES.
000330
000340*LINKAGE SECTION.
000350 01  PARAM-W.
000360     05 PROG-W           PIC X(08).
000370     05 PW-W             PIC X(04).
000380     05 ARG-W            PIC 9(06).
000390     05 FILLER-1 REDEFINES ARG-W.
000400        07 FILLER        PIC X(04).
000410        07 COMP-W        PIC 99.
000420     05 CONTROLE-W       PIC 99.
000430 COPY "/dados1/book/TELASIS".
000440 PROCEDURE DIVISION CHAINING PARAM-W.
000450 INICIO.
000460*========================================================
000470     MOVE ARG-W TO COMP-00 COMP-01 COMP-02 COMP-03
000480                   COMP-04 COMP-05 COMP-06.
000490     OPEN INPUT EMPBA.
000500     IF FS NOT EQUAL "00"
000510        MOVE "MBA0000A" TO CODMENFS
000520        PERFORM TESTA-FS THRU SAI-TESTA-FS
000530        CLOSE EMPBA STOP RUN.
000540     MOVE ARG-W TO CODEMP-BA
000550     READ EMPBA INVALID KEY
000560        DISPLAY (01, 01) ERASE
000570        CLOSE EMPBA
000580        STOP RUN.
000590     ACCEPT DATA-W FROM DATE.
000600     ACCEPT HORA-W FROM TIME.
000610     MOVE "RELATORIO DO SISTEMA DE BANCO " TO
000620          SIST-RELA SIST-RELB.
000630     MOVE CODEMP-BA TO COD-EMPA COD-EMPB.
000640     MOVE NOME-BA   TO EMP-CAB1A EMP-CAB1B.
000650     MOVE D-W TO DDREL-W.
000660     MOVE D-W        TO D-CAB1A   D-CAB1B.
000670     MOVE M-W        TO M-CAB1A   M-CAB1B.
000680     MOVE A-W        TO A-CAB1A   A-CAB1B.
000690     MOVE HH-W       TO HH-CAB2A HH-CAB2B.
000700     MOVE MS-W       TO MSREL-W MS-CAB2A MS-CAB2B.
000710     MOVE SS-W       TO SSREL-W SS-CAB2A SS-CAB2B.
000720     MOVE PROG-W     TO CHREL-W.
000730     MOVE "R"        TO RREL-W.
000740     GO TO INICIA.
000750*======================================================
