000010**************************
000020*FD-15- ARQUIVO DE SENHA *
000030**************************
000040 FD  ACE15
000050     VALUE OF FILE-ID IS ARQCE-15.
000060 01  REG-15.
000070     05  CHAVE-15.
000080         07 SENHA-15   PIC 9(04).
000090         07 CODSEN-15  PIC 99.
000100     05  FILLER        PIC X(02).
000110**************************
