000010************************************
000020* FD-27 ARQUIVO DE CORRESPONDENTES *
000030************************************
000040 FD  ACE27
000050     VALUE OF FILE-ID IS ARQCE-27.
000060 01  REG-27.
000070     03 CHAVE-27.
000080        05 COD1-27  PIC 9(06).
000090     03 COD2-27     PIC X(20).
000100     03 FILLER      PIC X(10).
000110     03 DESC-27     PIC X(40).
000120     03 FILLER      PIC X(52).
000130*=================F=I=M======================*
