000010***************************************
000020* CADASTRO DE CLASSE                  *
000030***************************************
000040 FD  ACC02
000050     VALUE OF FILE-ID IS ARQC-02.
000060 01  REGCC-02.
000070     03  CHAVECC-02.
000080         05  CLASSECC-02       PIC 9(02).
000090     03 NOMECC-02              PIC X(30).
000100     03 FILLER                 PIC X(32).
