000010**********************
000020* FDAG02 RESPONSAVEL *
000030**********************
000040 FD  AGE02
000050     VALUE OF FILE-ID IS ARQGE-02.
000060 01  REG-02.
000070     03 CHAVE-02.
000080        05  CODIGO-02       PIC 9(06).
000090     03 NOME-02             PIC X(30).
000100     03 FILLER              PIC X(28).
000110****************************************
