000010**********************
000020* FDAG03 TIPO DE AGENDA *
000030**********************
000040 FD  AGE03
000050     VALUE OF FILE-ID IS ARQGE-03.
000060 01  REG-03.
000070     03 CHAVE-03.
000080        05 CODIGO-03        PIC 9(02).
000090     03 NOME-03             PIC X(30).
000100     03 FILLER              PIC X(32).
000110****************************************
