000010*********************************************
000020*    FDBA05 - CADASTRO DE BANCO
000030 FD  ABA05
000040     VALUE OF FILE-ID IS ARQ05-BA.
000050 01  REG-BA05.
000060     03 CHBA05.
000070     03 CODREGBA05   PIC 9(06).
000080     03 NUMAGEBA05   PIC 9(06).
