000010**********************
000020* FDCA04 RESPONSAVEL *
000030**********************
000040 FD  ACA04
000050     VALUE OF FILE-ID IS ARQ04-CA.
000060 01  REG-ACA04.
000070     03 CHAVE-04.
000080        05  CODIGO-04       PIC 9(06).
000090     03 NOME-04             PIC X(30).
000100     03 FILLER              PIC X(48).
000110****************************************
