000010*********************
000020* FDCA07            *
000030*********************
000040 FD  ACA07
000050     VALUE OF FILE-ID IS ARQ07-CA.
000060 01  REG-ACA07.
000070     03 CHAVE-CA07.
000080        05 CODIGO-07  PIC 9(03).
000090     03 DESCRICAO-07  PIC X(20).
000100     03 FILLER        PIC X(09).
000110*********************
