000010*********************
000020* FDCA02            *
000030*********************
000040 FD  ACA02
000050     VALUE OF FILE-ID IS ARQ02-CA.
000060 01  REG-ACA02.
000070     03 CHAVE-CA02.
000080        05 CODIGO-02  PIC 9(03).
000090     03 RAZAO-02      PIC X(50).
000100     03 VALOR-02      PIC S9(14).
000110     03 VALORR-02 REDEFINES
000120        VALOR-02      PIC S9(12)V99.
000130     03 SINAL-02      PIC X.
000140     03 FILLER        PIC X(10).
000150*********************
