000010***********************
000020* FDCBHI              *
000030***********************
000040 FD  ACBHI
000050     VALUE OF FILE-ID IS ARQ03-CB.
000060 01  REG-ACBHI.
000070     03 CODIGO-HI     PIC 9(03).
000080     03 CODIGORED-HI REDEFINES CODIGO-HI    PIC X(03).
000090     03 COMPL-HI      PIC 9.
000100     03 COMPR-HI      PIC 99.
000110     03 HIST-HI.
000120        05 TBHIST-HI  PIC X OCCURS 70 TIMES.
000130     03 FILLER        PIC X(16).
000140***********************
