000010*****************************
000020* FDCM04 - ARQUIVO DE TECNICO*
000030*****************************
000040 FD  ACM04
000050     VALUE OF FILE-ID IS ARQCM-04.
000060 01  REGCM04.
000070     03 CODCM04       PIC 9(02).
000080*CODIGO DO TECNICO
000090     03 NOMECM04      PIC X(15).
000100*NOME DO TECNICO
000110     03 FILLER        PIC X(47).
000120**************************************************************
