000010*    FDCR01 CADASTRO DE CLIENTES
000020 FD  ACR01
000030     VALUE OF FILE-ID IS ARQ01-ID.
000040 01  REG-CR01.
000050     03 CHCR01.
000060        05 CODIGOCR01   PIC 9(2).
000070        05 NOMECR01   PIC X(20).
