000010*======================================
000020 FD   ACEFB02
000030      VALUE OF FILE-ID IS "/dados2/arquivos/ace/ACEFB02".
000040 01   REGCEFB02.
000050      05 CHAVEFB-02.
000060         07 LNHFB-02       PIC 999.
000070      05 CODFB-02A         PIC 9(06).
000080      05 CODFB-02B         PIC 9(06).
000090      05 CODFB-02C         PIC 9(06).
000100      05 FILLER            PIC X(43).
000110*======================================
000120
