000010*********************************************
000020*    FDVD03 - CADASTRO DE NATUREZA DE ITEM  *
000030*********************************************
000040 FD  AVD03
000050     VALUE OF FILE-ID IS ARQ03-VD.
000060 01  REG-VD03.
000070     03 CHVD03.
000080        05 NATVD03   PIC X.
000090*COD. DE ITEM DE NATUREZA
000100     03 DESCVD03     PIC X(20).
000110*DESCRICAO DE NATUREZA DE ITEM
000120     03 FILLER       PIC X(11).
