000010*********************************************
000020* FDVD05 - CADASTRO DE ARQUIVOS DE PUBLICOS *
000030*********************************************
000040 FD  AVD05
000050     VALUE OF FILE-ID IS ARQ05-VD.
000060 01  REG-VD05.
000070     03 CHVD05.
000080        05 PUBVD05   PIC 9.
000090*COD. DO PUBLICO
000100     03 DESCVD05     PIC X(20).
000110*DESCRICAO DO COD. DE PUBLICO
000120     03 FILLER       PIC X(11).
