000010*********************************************
000020* FDVD04 - CADASTRO DE TIPO DE FABRICANTE
000030*********************************************
000040 FD  AVD04
000050     VALUE OF FILE-ID IS ARQ04-VD.
000060 01  REG-VD04.
000070     03 CHVD04.
000080        05 FABVD04   PIC X.
000090*COD. DO FABRICANTE
000100     03 DESCVD04     PIC X(20).
000110*DESCRICAO DE FABRICANTE
000120     03 FILLER       PIC X(11).
