	   *> olamundo.cob - Exemplo simples "Olá, mundo!" em COBOL
	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. OLAMUNDO.
	   AUTHOR. GersonESantos.
	   DATE-WRITTEN. 26/10/2025.

	   ENVIRONMENT DIVISION.

	   DATA DIVISION.
	   WORKING-STORAGE SECTION.

	   PROCEDURE DIVISION.
		   DISPLAY "Olá, mundo!".
		   STOP RUN.

