000010****** ALTERTADO POR CLAUDIO (10\02\96)
000020********************************************
000030*OCE1201-MANUTENCAO DE PRODUTOS NA EMPRESA  COMPILDO 01\08\2005*
000040********************************************
000020$ set osvs ms(2) nowarning

000050 IDENTIFICATION DIVISION.
000060 PROGRAM-ID. PRODUTOS.
000070 COPY "\dados1\book\SELCE".
000080 COPY "\dados1\book\SELC-01".
000090 COPY "\dados1\book\SELC-02".
000100 COPY "\dados1\book\SELC-05".
000110     SELECT RELATO  ASSIGN TO PRINTER
000120                    FILE STATUS IS FS.
000130 COPY "\dados1\book\FDCE".
000140 COPY "\dados1\book\FD-01".
000150 COPY "\dados1\book\FD-02".
000160 COPY "\dados1\book\FD-05".
000170 COPY "\dados1\book\FDREL80".
000180 COPY "\dados1\book\TAB-W".
000190 01  CONT            PIC X VALUE SPACES.
000200 01  COD-AW          PIC X(06).
000210 01  COD-NW REDEFINES COD-AW.
000220     05 DIGITO-W     PIC 9(05).
000230     05 FILLER REDEFINES DIGITO-W.
000240        07 BILHAR    PIC 9.
000250        07 MILHAR    PIC 9.
000260        07 CENTENA   PIC 9.
000270        07 DEZENA    PIC 9.
000280        07 UNIDADE   PIC 9.
000290     05 DV-DIGITO-W  PIC 9.
000300 01  ED3             PIC ZZZ.ZZZ.ZZ9,99 VALUE ZEROS.
000310 01  PROD-UND        PIC 9(04) VALUE ZEROS.
000320 01  PROD-DEZ        PIC 9(04) VALUE ZEROS.
000330 01  PROD-CEM        PIC 9(04) VALUE ZEROS.
000340 01  PROD-MIL        PIC 9(04) VALUE ZEROS.
000350 01  PROD-BIL        PIC 9(04) VALUE ZEROS.
000360 01  RESTO           PIC 9(04) VALUE ZEROS.
000370 01  RESULTADO       PIC 9(04) VALUE ZEROS.
000380 01  SOMA            PIC 9(04) VALUE ZEROS.
000390 01  COD-W           PIC 9(06) VALUE ZEROS.
000400 01  ART-W           PIC 9(06) VALUE ZEROS.
000410 01  SEG-W           PIC X     VALUE SPACES.
000420 01  EST-W           PIC 9(07) VALUE ZEROS.
000430 01  EST-WR REDEFINES EST-W PIC 9(05)V99.
000440 01  CAMP-W          PIC 99 VALUE ZEROS.
000450 01  COD-F           PIC 9(06) VALUE ZEROS.
000460 01  CAB2.
000470     05 FILLER      PIC X(24) VALUE SPACES.
000480     05 FILLER      PIC X(32) VALUE
000490     "RELATORIO DE PRODUTOS NA EMPRESA".
000500 01  CAB3.
000510     05 FILLER      PIC X(80) VALUE
000520     "LOJA   QT.LOJA   QT.REPOS.   QT.MINIMA   SAIDA\MES DAT.ULT.M
000530-    "OVE     VENDA NO MES".
000540 01  CAB4.
000550     05 FILLER      PIC X(08) VALUE "01-COD.:".
000560     05 COD-4       PIC 9(06) VALUE ZEROS.
000570     05 FILLER      PIC X(14) VALUE SPACES.
000580     05 FILLER      PIC X(09) VALUE "02-DESC.:".
000590     05 DESC-4      PIC X(40) VALUE SPACES.
000600 01  CAB5.
000610     05 FILLER      PIC X(17) VALUE "03-ESTOQ.GERAL.: ".
000620     05 ESTG-5      PIC X(11) VALUE SPACES.
000630     05 FILLER      PIC X(07) VALUE "SAIDAS:".
000640     05 FILLER      PIC X(10) VALUE SPACES.
000650     05 FILLER      PIC X(17) VALUE "04-CUSTO REAL..: ".
000660     05 CUSTREAL-5  PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000670 01  CAB6.
000680     05 FILLER      PIC X(17) VALUE "05-ESTOQ.DEPOS.: ".
000690     05 ESTDEP-6    PIC X(11) VALUE SPACES.
000700     05 FILLER      PIC X(06) VALUE "06-J- ".
000710     05 SAIJAN      PIC X(11) VALUE SPACES.
000720     05 FILLER      PIC X(17) VALUE "07-CUSTO MEDIO.: ".
000730     05 CUSTMED-6   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000740 01  CAB7.
000750     05 FILLER      PIC X(17) VALUE "08-ESTOQ.MINIMO: ".
000760     05 ESTMIN-7    PIC X(09) VALUE SPACES.
000770     05 FILLER      PIC X(02) VALUE SPACES.
000780     05 FILLER      PIC X(06) VALUE "09-F- ".
000790     05 SAIFEV      PIC X(11) VALUE SPACES.
000800     05 FILLER      PIC X(06) VALUE "10-VR.".
000810     05 IND-7       PIC X(09) VALUE SPACES.
000820     05 FILLER      PIC X(02) VALUE ":".
000830     05 VRPU-7      PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000840 01  CAB8.
000850     05 FILLER      PIC X(17) VALUE "11-FORNECEDOR..: ".
000860     05 CODFOR-8    PIC 9(04) VALUE ZEROS.
000870     05 FILLER      PIC X(07) VALUE SPACES.
000880     05 FILLER      PIC X(06) VALUE "12-M- ".
000890     05 SAIMAR      PIC X(11) VALUE SPACES.
000900     05 FILLER      PIC X(17) VALUE "13-CUSTO ATUAL.: ".
000910     05 CUSTATU-8   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000920 01  CAB9.
000930     05 FILLER      PIC X(17) VALUE "14-PRZ.PGTO.MED: ".
000940     05 PRZMED-9    PIC 9(03) VALUE ZEROS.
000950     05 FILLER      PIC X(08) VALUE SPACES.
000960     05 FILLER      PIC X(06) VALUE "15-A- ".
000970     05 SAIABR      PIC X(11) VALUE SPACES.
000980     05 FILLER      PIC X(17) VALUE "16-PRECO VAREJO: ".
000990     05 PRVAR-9     PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
001000 01  CAB10.
001010     05 FILLER      PIC X(17) VALUE "17-CLASSE......: ".
001020     05 CLASSE-10   PIC X     VALUE SPACES.
001030     05 FILLER      PIC X(10) VALUE SPACES.
001040     05 FILLER      PIC X(06) VALUE "18-M- ".
001050     05 SAIMAI      PIC X(11) VALUE SPACES.
001060     05 FILLER      PIC X(17) VALUE "19-PRECO ATAC..: ".
001070     05 PRATAC-10   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
001080 01  CAB11.
001090     05 FILLER      PIC X(17) VALUE "20-DAT.CADASTR.: ".
001100     05 DIACAD-11   PIC 99    VALUE ZEROS.
001110     05 FILLER      PIC X     VALUE "\".
001120     05 MESCAD-11   PIC 99    VALUE ZEROS.
001130     05 FILLER      PIC X     VALUE "\".
001140     05 ANOCAD-11   PIC 99    VALUE ZEROS.
001150     05 FILLER      PIC X(03) VALUE SPACES.
001160     05 FILLER      PIC X(06) VALUE "21-J- ".
001170     05 SAIJUN      PIC X(11) VALUE SPACES.
001180     05 FILLER      PIC X(17) VALUE "22-COD.TABELA..: ".
001190     05 CODTAB-11   PIC X(01) VALUE SPACES.
001200 01  CAB12.
001210     05 FILLER      PIC X(17) VALUE "23-DATA.CUSTO..: ".
001220     05 DIACUS-12   PIC 99    VALUE ZEROS.
001230     05 FILLER      PIC X     VALUE "\".
001240     05 MESCUS-12   PIC 99    VALUE ZEROS.
001250     05 FILLER      PIC X     VALUE "\".
001260     05 ANOCUS-12   PIC 99    VALUE ZEROS.
001270     05 FILLER      PIC X(03) VALUE SPACES.
001280     05 FILLER      PIC X(06) VALUE "24-J- ".
001290     05 SAIJUL      PIC X(11) VALUE SPACES.
001300     05 FILLER      PIC X(17) VALUE "25-EMBALAGEM...:".
001310     05 EMB-16      PIC 999 VALUE ZEROS.
001320 01  CAB13.
001330     05 FILLER      PIC X(17) VALUE "26-DAT.ULT.MOV.: ".
001340     05 MESNOV-13   PIC 99   VALUE ZEROS.
001350     05 FILLER      PIC X     VALUE "\".
001360     05 ANONOV-13   PIC 99   VALUE ZEROS.
001370     05 FILLER      PIC X(06) VALUE SPACES.
001380     05 FILLER      PIC X(06) VALUE "27-A- ".
001390     05 SAIAGO      PIC X(11) VALUE SPACES.
001400     05 FILLER      PIC X(17) VALUE "28-DAT.ULT.INFL: ".
001410     05 DIAINF-13   PIC 99  VALUE ZEROS.
001350     05 FILLER      PIC X     VALUE "\".
001420     05 MESINF-13   PIC 99  VALUE ZEROS.
001430 01  CAB14.
001440     05 FILLER      PIC X(17) VALUE "29-PEDIDO......: ".
001450     05 QTPED-14    PIC X(11) VALUE SPACES.
001460     05 FILLER      PIC X(06) VALUE "30-S- ".
001470     05 SAISET      PIC X(11) VALUE SPACES.
001480     05 FILLER      PIC X(17) VALUE "31-............: ".
001490 01  CAB15.
001500     05 FILLER      PIC X(17) VALUE "32-ENTRADA MES.: ".
001510     05 QTENT-15    PIC X(11) VALUE SPACES.
001520     05 FILLER      PIC X(06) VALUE "33-O- ".
001530     05 SAIOUT      PIC X(11) VALUE SPACES.
001540     05 FILLER      PIC X(17) VALUE "34-............: ".
001550 01  CAB16.
001560     05 FILLER      PIC X(17) VALUE "35-UNIDADE.....: ".
001570     05 UNID-16     PIC X(04) VALUE SPACES.
001580     05 FILLER      PIC X(07) VALUE SPACES.
001590     05 FILLER      PIC X(06) VALUE "36-N- ".
001600     05 SAINOV      PIC X(11) VALUE SPACES.
001610     05 FILLER      PIC X(17) VALUE "37-............: ".
001620     05 FILLER      PIC 9(14) VALUE ZEROS.
001630 01  CAB17.
001640     05 FILLER      PIC X(17) VALUE "38-LIVRO.......: ".
001650     05 LIVRO-17    PIC X     VALUE SPACES.
001660     05 FILLER      PIC X(10) VALUE SPACES.
001670     05 FILLER      PIC X(06) VALUE "39-D- ".
001680     05 SAIDEZ      PIC X(11) VALUE SPACES.
001690     05 FILLER      PIC X(17) VALUE "40-............: ".
001700     05 FILLER      PIC 9(14) VALUE ZEROS.
001710 01  CAB18.
001720     05 FILLER      PIC X     VALUE SPACES.
001730     05 LOJA-18     PIC XX    VALUE SPACES.
001740     05 FILLER      PIC XX    VALUE SPACES.
001750     05 QTL-18      PIC X(12) VALUE SPACES.
001760     05 QTR-18      PIC X(12) VALUE SPACES.
001770     05 QTM-18      PIC X(12) VALUE SPACES.
001780     05 QTSAI-18    PIC X(12) VALUE SPACES.
001790     05 FILLER      PIC X(01) VALUE SPACES.
001800     05 MM-18       PIC 99    VALUE ZEROS.
001810     05 FILLER      PIC X     VALUE "\".
001820     05 AA-18       PIC 99    VALUE ZEROS.
001830     05 FILLER      PIC X(04) VALUE SPACES.
001840     05 VENDA-18    PIC Z.ZZZ.ZZZ.ZZ9,99.
001850 01  EX-MENS1       PIC X(28) VALUE SPACES.
001860 01  EX-MENS2       PIC X(34) VALUE SPACES.
001870 01  W-LOJA.
001880     02 QTLJA-W OCCURS 14 TIMES.
001890        03 QTLJ-W   PIC 9(07).
001900        03 QTLJ-WR REDEFINES QTLJ-W PIC 9(05)V99.

       78  dialog-system               VALUE "DSGRUN".
       01 Display-Error.
          03 Display-Error-No             PIC 9(4) comp-5.
          03 Display-Details-1            PIC 9(4) comp-5.
          03 Display-Details-2            PIC 9(4) comp-5.

       COPY "DS-CNTRL.MF".
       COPY "PRODUTO.CPB".








001910 COPY "\dados1\book\CPYPDCE".
001920 COPY "\dados1\book\CPYPDFS".
001930 R-0000.
001970 COPY "\dados1\book\PDIMP".
001980     OPEN I-O ACE01.
001990     IF FS NOT = "00"
002000        MOVE "MCE1201A" TO CODMENFS
002010         MOVE "ACE01"     TO ARQFS
002020        PERFORM TESTA-FS THRU SAI-TESTA-FS
002030        CLOSE ACE01 STOP RUN.
002040     OPEN I-O ACE02.
002050     IF FS NOT = "00"
002060        MOVE "MCE1201B" TO CODMENFS
002070        MOVE "ACE02"     TO ARQFS
002080        PERFORM TESTA-FS THRU SAI-TESTA-FS
002090        CLOSE ACE02 ACE01 STOP RUN.
002100     OPEN INPUT ACE05.
002110     IF FS NOT = "00"
002120        MOVE "MCE1201D" TO CODMENFS
002130        MOVE "ACE05"     TO ARQFS
002140        PERFORM TESTA-FS THRU SAI-TESTA-FS
002150        CLOSE ACE05 ACE01 ACE02 STOP RUN.
      ****************************************************************


      *---------------------------------------------------------------*

       Main-Process SECTION.
          PERFORM Program-Initialize
          PERFORM Program-Body UNTIL EXIT-FLAG-TRUE
          PERFORM Program-Terminate
          .

      *---------------------------------------------------------------*

       Program-Initialize SECTION.

          INITIALIZE Ds-Control-Block
          INITIALIZE Data-block
          MOVE Data-block-version-no
                                   TO Ds-Data-Block-Version-No
          MOVE Version-no TO Ds-Version-No

          MOVE Ds-New-Set TO Ds-Control
          MOVE "PRODUTO" TO Ds-Set-Name

          .

      *---------------------------------------------------------------*

       Program-Body SECTION.
          IF OPERACAO = "LER-PROD"
              PERFORM LER-PRODUTOS.

          PERFORM Call-Dialog-System
          .

      *---------------------------------------------------------------*

       Program-Terminate SECTION.

          STOP RUN
          .

      *---------------------------------------------------------------*

       Call-Dialog-System SECTION.

          CALL dialog-system USING Ds-Control-Block,
                                   Data-Block
          IF NOT Ds-No-Error
              MOVE Ds-System-Error TO Display-error
              DISPLAY "DS ERROR NO:   "  Display-error-no
              DISPLAY "Error Details(1) :   "  Display-Details-1
              DISPLAY "Error Details(2) :   "  Display-Details-2
              PERFORM Program-Terminate
          END-IF
          .
       LER-PRODUTOS SECTION.
          MOVE COD-01DB   TO COD-01
          READ ACE01 INVALID KEY
            MOVE "NAO ENCONTRADO" TO DESC-01.
          MOVE DESC-01 TO DESC-01DB.


