000010*******************************************************
000020* SCE1908-PROGRAMA DE MANUTENCAO NO CADASTRO DE JUROS COMP 20/08/05*
000030*******************************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE1908.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELCI-01".
000080 COPY "/dados1/book/FDCE".
000090 COPY "/dados1/book/FDCI-01".
000100 COPY "/dados1/book/TAB-W".
000110*COPY "/dados1/book/CPYPDCI".
000120 COPY "/dados1/book/CPYPDCE".
000130 COPY "/dados1/book/CPYPDFS".
000140 R-0000.
000150     OPEN I-O ACI01.
000160     IF FS NOT = "00"
000170        MOVE "MCE1908A" TO CODMENFS
000180        MOVE "ACI01" TO ARQFS
000190        PERFORM TESTA-FS THRU SAI-TESTA-FS
000200        CLOSE ACI01 STOP RUN.
000210     MOVE "TCE1908" TO TS.
000220     MOVE "CADASTRAMENTO DE INDICES" TO INFT.
000230 R-0100.
000240*COPY "/dados1/book/CPYTPCI".
000250*COPY "/dados1/book/CPYTMCE".
000260*R-0200.
000270     MOVE ALL ZEROS TO REG-ACI01.
000280 R-0300.
000290     DISPLAY (22, 14) "INCLUIR (S/<N>) .".
000300     ACCEPT (22, 30) RESP WITH UPDATE.
000310     DISPLAY (22, 14) EX-MENS.
000320     IF RESP NOT = "S" GO TO R-0300.
000330        MOVE "M" TO TIPOCI-01.
000340* I = INDICE                    M = MOEDA
000350        MOVE 1   TO REFCI-01.
000360* 1 = DOLAR      2 = UFIR       3 = TAXA REFERENCIAL DIARIA
000370        MOVE 05 TO ANOCI-01.
000380        MOVE 08 TO MESCI-01.
000390        MOVE 30 TO DIACI-01.
000400        MOVE 1,00 TO VINDCI-01R.
000410     WRITE REG-ACI01 INVALID KEY
000420        MOVE "MCE1908B" TO CODMENFS
000430        MOVE "ACI01" TO ARQFS
000440        PERFORM TESTA-FS THRU SAI-TESTA-FS
000450        GO TO R-0300.
000460     DISPLAY (22, 14) "I N C L U I D O "
000470     ACCEPT (22, 78) CR WITH UPDATE.
000480 R-9999.
000490     CLOSE ACI01.
000500     EXIT PROGRAM.
000510*---------------F-I-M------------------
