000010******************************************
000020* SCE2401-PROGRAMA PARA EXCLUSAO DE LOTE COMP 14/09/2005 *
000030******************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE2401.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-04".
000080     SELECT  ACEAUX   ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE  IS DYNAMIC
                            LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000110                      RECORD KEY   IS CHAVE-AUX
000120                      ALTERNATE RECORD KEY IS ALT-AUX
000130                      WITH DUPLICATES
000140                      FILE STATUS IS FS.
000150 COPY "/dados1/book/FDCE".
000160 COPY "/dados1/book/FD-04".
000170 FD  ACEAUX
000180     VALUE OF FILE-ID IS "ACEAUX".
000190 01  REG-AUX.
000200     03 CHAVE-AUX.
000210        05 LOJA-AUX    PIC 99.
000220        05 COD-AUX     PIC X(06).
000230        05 NF-AUX      PIC 9(06).
000240     03 ALT-AUX.
000250        05 LOTE-AUX    PIC X(05).
000260     03 COND-AUX       PIC X.
000270     03 SERIE-AUX      PIC X.
000280     03 ENTREGA-AUX    PIC X.
000290     03 QTSAIDA-AUX    PIC 9(07).
000300     03 QTSAIDA-AUXR REDEFINES QTSAIDA-AUX PIC 9(05)V99.
000310     03 DATMOV-AUX.
000320        05 AMOV-AUX    PIC 99.
000330        05 MMOV-AUX    PIC 99.
000340        05 DMOV-AUX    PIC 99.
000350     03 VENDEDOR-AUX   PIC 9(05).
000360     03 CC-AUX         PIC 9(04).
000370     03 PRZ-AUX        PIC 9(03).
000380     03 CMEDIO-AUX     PIC 9(11).
000390     03 CMEDIO-AUXR REDEFINES
000400        CMEDIO-AUX     PIC 9(09)V99.
000410     03 CREAL-AUX      PIC 9(11).
000420     03 CREAL-AUXR REDEFINES
000430        CREAL-AUX      PIC 9(09)V99.
000440     03 PRVEND-AUX     PIC 9(12).
000450     03 PRVEND-AUXR REDEFINES
000460        PRVEND-AUX     PIC 9(10)V99.
000470     03 SREAL-AUX      PIC 9(12).
000480     03 SREAL-AUXR REDEFINES
000490        SREAL-AUX      PIC 9(10)V99.
000500     03 CICM-AUX       PIC 9(09).
000510     03 CICM-AUXR REDEFINES
000520        CICM-AUX       PIC 9(07)V99.
000530     03 DIF-AUX        PIC 9(08).
000540     03 DIF-AUXR REDEFINES
000550        DIF-AUX        PIC 9(06)V99.
000560     03 STATUS-AUX     PIC X.
000570     03 NAT-AUX        PIC X(03).
000580     03 CLIENTE-AUX    PIC 9(05).
000590     03 FILLER        PIC X(01).
000600     03 CONSUMO-AUX    PIC X(01).
000610     03 CPU-AUX        PIC 9(04)V99.
000620     03 SAIENT-AUX     PIC X(01).
000630*****************************************
000640 COPY "/dados1/book/TAB-W".
000650 01  PERMI.
000660     05 FILLER        PIC X(37) VALUE
000670        "chmod +wr /dados2/arquivos/ace/ACE04*".
000680 01  LOTE.
000690     02 LOTE-W OCCURS 10 TIMES  PIC 9(05).
000700 COPY "/dados1/book/CPYPDCE".
000710 COPY "/dados1/book/CPYPDFS".
000720 R-0000.
000730     OPEN INPUT ACE04.
000740     IF FS NOT EQUAL "00"
000750        MOVE "MCE2401A" TO CODMENFS
000760        MOVE "ACE04"     TO ARQFS
000770        PERFORM TESTA-FS THRU SAI-TESTA-FS
000780        CLOSE ACE04 STOP RUN.
000790     OPEN  OUTPUT ACEAUX.
000800     IF FS NOT EQUAL "00"
000810        MOVE "MCE2401C" TO CODMENFS
000820        MOVE "ACEAUX"   TO ARQFS
000830        PERFORM TESTA-FS THRU SAI-TESTA-FS
000840        CLOSE ACE04 ACEAUX STOP RUN.
000850 R-0100.
000860     MOVE "TCE2401" TO TS.
000870     MOVE "PROGRAMA PARA EXCLUSAO DE LOTES" TO INFT.
000880 COPY "/dados1/book/CPYTPCE".
000890     DISPLAY (07, 24) "CONFIRMA (S/<N>) :".
000900     ACCEPT (07, 42) RESP WITH UPDATE.
000910     IF RESP NOT = "S"
000920        GO TO R-9999.
000930     MOVE ZEROS TO IND1-W.
000940     DISPLAY (09, 24) "DIGITE O NUMERO DO LOTE => (  ):".
000950     DISPLAY (10, 24) "<0> PROCESSA EXCLUSAO".
000960 R-0200.
000970     ADD 1 TO IND1-W.
000980     IF IND1-W > 10
000990        MOVE ZEROS TO IND1-W
001000        CLOSE ACE04
001010        GO TO R-0300.
001020     DISPLAY (09, 52) IND1-W.
001030     ACCEPT (09, 57) LOTE-W(IND1-W) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001040     IF E = "01"
001050        GO TO R-9999.
001060     IF LOTE-W(IND1-W) = ZEROS
001070        NEXT SENTENCE
001080     ELSE
001090        PERFORM R-0900
001100        GO TO R-0200.
001110     MOVE ZEROS TO IND1-W.
001120     CLOSE ACE04.
001130 R-0300.
001140     DISPLAY (13, 24) "E X C L U I N D O....".
001150     OPEN INPUT ACE04.
001160     IF FS NOT EQUAL "00"
001170        MOVE "MCE2401D" TO CODMENFS
001180        MOVE "ACE04"     TO ARQFS
001190        PERFORM TESTA-FS THRU SAI-TESTA-FS
001200        CLOSE ACE04 STOP RUN.
001210     MOVE LOW-VALUE TO LOTE-04.
001220     START ACE04 KEY NOT < ALT-04
001230           INVALID KEY MOVE 0 TO FS.
001240 R-0400.
001250     READ ACE04 NEXT RECORD AT END
001260        CLOSE ACE04 ACEAUX
001270        GO TO R-0700.
001280 R-0500.
001290     ADD 1 TO IND1-W.
001300     IF IND1-W > 10 OR LOTE-W(IND1-W) = ZEROS
001310        GO TO R-0600.
001320     IF LOTE-04 = LOTE-W(IND1-W)
001330        MOVE ZEROS TO IND1-W
001340        GO TO R-0400.
001350     GO TO R-0500.
001360 R-0600.
001370     MOVE REG-04 TO  REG-AUX.
001380     WRITE REG-AUX INVALID KEY
001390        DISPLAY (22, 14) "ERRO NA GRAVACAO DO ACEAUX "
001400        LOJA-04 " - " COD-04 " - " NF-04
001410        ACCEPT (22, 78) CR WITH UPDATE
001420        DISPLAY (22, 14) EX-MENS
001430        CLOSE ACE04 ACEAUX STOP RUN.
001440     MOVE ZEROS TO IND1-W.
001450     GO TO R-0400.
001460 R-0700.
001470     OPEN INPUT ACEAUX.
001480     IF FS NOT EQUAL "00"
001490        MOVE "MCE2401E" TO CODMENFS
001500        MOVE "ACEAUX"   TO ARQFS
001510        PERFORM TESTA-FS THRU SAI-TESTA-FS
001520        CLOSE ACEAUX STOP RUN.
001530     OPEN OUTPUT ACE04 CLOSE ACE04.
001540     OPEN I-O ACE04.
001550     IF FS NOT EQUAL "00"
001560        MOVE "MCE2401F" TO CODMENFS
001570        MOVE "ACE04"     TO ARQFS
001580        PERFORM TESTA-FS THRU SAI-TESTA-FS
001590        CLOSE ACE04 ACEAUX STOP RUN.
001600     MOVE LOW-VALUE TO CHAVE-AUX.
001610     START ACEAUX KEY IS NOT < CHAVE-AUX INVALID KEY
001620        GO TO R-9999.
001630 R-0800.
001640     READ ACEAUX NEXT RECORD AT END
001650        GO TO R-9999.
001660     MOVE REG-AUX TO  REG-04.
001670     WRITE REG-04 INVALID KEY
001680        MOVE "MCE2401G" TO CODMENFS
001690        MOVE "ACE04"   TO ARQFS
001700        PERFORM TESTA-FS THRU SAI-TESTA-FS
001710        CLOSE ACE04 ACEAUX STOP RUN.
001720     GO TO R-0800.
001730 R-0900.
001740      MOVE LOTE-W (IND1-W) TO LOTE-04.
001750      START ACE04 KEY IS = ALT-04 INVALID KEY
001760          DISPLAY (22, 14) "LOTE NAO ENCONTRADO NO ACE04"
001770          ACCEPT (22, 78) CR WITH UPDATE
001780          DISPLAY (22, 14) EX-MENS
001790          SUBTRACT 1 FROM IND1-W.
001800 R-0910.
001810      EXIT.
001820 R-9999.
001830     CLOSE ACE04 ACEAUX.
001840 COPY "/dados1/book/CPYPERM".
001850     EXIT PROGRAM.
001860*----------------F I M--------------------
