000010***********************************
000020* SCE6204-REORGANIZACAO DO ACE04  *
000030***********************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6204.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-04".
000080      SELECT ACEAUX   ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE IS DYNAMIC
000110                      LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000120                      RECORD KEY IS CHAVE-AUX
000130                      ALTERNATE RECORD KEY IS ALT-AUX
000140                      WITH DUPLICATES
000150                      FILE STATUS IS FS.
000160 COPY "/dados1/book/FDCE".
000170 COPY "/dados1/book/FD-04".
000180 FD  ACEAUX
000190     VALUE OF FILE-ID IS "ACEAUX".
000200 01  REG-AUX.
000210     03 CHAVE-AUX.
000220        05 LOJA-AUX    PIC 99.
000230        05 COD-AUX     PIC X(06).
000240        05 NF-AUX      PIC 9(06).
000250     03 ALT-AUX.
000260        05 LOTE-AUX    PIC X(05).
000270     03 COND-AUX       PIC X.
000280     03 SERIE-AUX      PIC X.
000290     03 ENTREGA-AUX    PIC X.
000300     03 QTSAIDA-AUX    PIC 9(07).
000310     03 QTSAIDA-AUXR REDEFINES QTSAIDA-AUX PIC 9(05)V99.
000320     03 DATMOV-AUX.
000330        05 AMOV-AUX    PIC 99.
000340        05 MMOV-AUX    PIC 99.
000350        05 DMOV-AUX    PIC 99.
000360     03 VENDEDOR-AUX   PIC 9(05).
000370     03 CC-AUX         PIC 9(04).
000380     03 PRZ-AUX        PIC 9(03).
000390     03 CMEDIO-AUX     PIC 9(11).
000400     03 CMEDIO-AUXR REDEFINES
000410        CMEDIO-AUX     PIC 9(09)V99.
000420     03 CREAL-AUX      PIC 9(11).
000430     03 CREAL-AUXR REDEFINES
000440        CREAL-AUX      PIC 9(09)V99.
000450     03 PRVEND-AUX     PIC 9(12).
000460     03 PRVEND-AUXR REDEFINES
000470        PRVEND-AUX     PIC 9(10)V99.
000480     03 SREAL-AUX      PIC 9(12).
000490     03 SREAL-AUXR REDEFINES
000500        SREAL-AUX      PIC 9(10)V99.
000510     03 CICM-AUX       PIC 9(09).
000520     03 CICM-AUXR REDEFINES
000530        CICM-AUX       PIC 9(07)V99.
000540     03 DIF-AUX        PIC 9(08).
000550     03 DIF-AUXR REDEFINES
000560        DIF-AUX        PIC 9(06)V99.
000570     03 STATUS-AUX     PIC X.
000580     03 NAT-AUX        PIC X(03).
000590     03 CLIENTE-AUX    PIC 9(05).
000600     03 FILLER         PIC X(01).
000610     03 CONSUMO-AUX    PIC X(01).
000620     03 CPU-AUX        PIC 9(04)V99.
000630     03 FILLER        PIC X(01).
000640 COPY "/dados1/book/TAB-W".
000650 COPY "/dados1/book/CPYPDCE".
000660 COPY "/dados1/book/CPYPDFS".
000670 R-0000.
000680     MOVE "TCR6204" TO TS.
000690     MOVE "REORGANIZACAO DO ARQUIVO - ACE04" TO INFT.
000700 COPY "/dados1/book/CPYTPCE".
000710     DISPLAY (08, 30) "REORGANIZACAO DO ACE04".
000720     DISPLAY (10, 30) "REORGANIZAR (S/<N>) [ ]".
000730     ACCEPT (10, 51) RESP WITH UPDATE.
000740     IF RESP NOT = "S"
000750        EXIT PROGRAM.
000760 R-0100.
000770     DISPLAY (22, 14) "ESTOU PROCESSANDO ARQUIVO AUXILIAR"
000780     OPEN INPUT  ACE04.
000790     OPEN OUTPUT ACEAUX.
000800     MOVE ZEROS TO CHAVE-04.
000810     START ACE04 KEY IS NOT LESS CHAVE-04 INVALID KEY
000820        DISPLAY (22, 14) EX-MENS
000830        DISPLAY (22, 14) "ARQUIVO ACE04 VAZIO"
000840        ACCEPT CR DISPLAY (22, 14) EX-MENS
000850        CLOSE ACEAUX ACE04 STOP RUN.
000860 R-0110.
000870     READ ACE04 NEXT RECORD AT END
000880        CLOSE ACE04 ACEAUX
000890*       OPEN OUTPUT ACE04
000900        CLOSE ACE04
000910        GO TO R-9999.
000920     IF DATMOV-04 = 300503 
000930       MOVE 060604 TO DATMOV-04.
000940     WRITE REG-AUX FROM REG-04 INVALID KEY
000950        DISPLAY (22, 14) "ERRO NA GRAVACAO ACEAUX " FS
000960        ACCEPT CR DISPLAY (22, 14) EX-MENS.
000970     GO TO R-0110.
000980*===============================
000990 R-0200.
001000     DISPLAY (22, 14) EX-MENS.
001010     OPEN INPUT ACEAUX.
001020     IF FS NOT = "00"
001030        MOVE "MCE6204A" TO CODMENFS
001040        MOVE "ACEAUX" TO ARQFS
001050        PERFORM TESTA-FS THRU SAI-TESTA-FS
001060        CLOSE ACEAUX STOP RUN.
001070     OPEN I-O ACE04.
001080     IF FS NOT = "00"
001090        MOVE "MCE6204B" TO CODMENFS
001100        MOVE "ACE04" TO ARQFS
001110        PERFORM TESTA-FS THRU SAI-TESTA-FS
001120        CLOSE ACEAUX ACE04 STOP RUN.
001130 R-0300.
001140     READ ACEAUX NEXT AT END
001150         GO TO R-9999.
001160 R-0400.
001170     MOVE ZEROS TO REG-04.
001180     MOVE SPACES TO COND-04 SERIE-04 ENTREGA-04.
001190     MOVE CHAVE-AUX   TO CHAVE-04.
001200     MOVE ALT-AUX     TO ALT-04.
001210     MOVE COND-AUX    TO COND-04.
001220     MOVE SERIE-AUX   TO SERIE-04.
001230     IF LOJA-AUX = 88
001240        MOVE "D"      TO ENTREGA-04
001250     ELSE
001260        MOVE "L"      TO ENTREGA-04.
001270     IF QTSAIDA-AUX NOT NUMERIC
001280        MOVE ZEROS TO QTSAIDA-04
001290     ELSE
001300        MOVE QTSAIDA-AUX TO QTSAIDA-04.
001310     IF DATMOV-AUX NOT NUMERIC
001320        MOVE ZEROS TO DATMOV-04
001330     ELSE
001340        MOVE DATMOV-AUX TO DATMOV-04.
001350     IF VENDEDOR-AUX NOT NUMERIC
001360        MOVE ZEROS TO VENDEDOR-04
001370     ELSE
001380        MOVE VENDEDOR-AUX TO VENDEDOR-04.
001390     IF CUSTO-EMPCE = "N"
001400        MOVE ZEROS TO CC-04
001410        GO TO R-0500.
001420     IF CC-AUX NOT NUMERIC
001430        MOVE ZEROS TO CC-04
001440     ELSE
001450        MOVE CC-AUX TO CC-04.
001460 R-0500.
001470     IF PRZ-AUX NOT NUMERIC
001480        MOVE ZEROS TO PRZ-04
001490     ELSE
001500        MOVE PRZ-AUX TO PRZ-04.
001510     IF CMEDIO-AUX NOT NUMERIC
001520        MOVE ZEROS TO CMEDIO-04
001530     ELSE
001540        MOVE CMEDIO-AUX TO CMEDIO-04.
001550     IF CREAL-AUX NOT NUMERIC
001560        MOVE ZEROS TO CREAL-04
001570     ELSE
001580        MOVE CREAL-AUX TO CREAL-04.
001590     IF PRVEND-AUX NOT NUMERIC
001600        MOVE ZEROS TO PRVEND-04
001610     ELSE
001620        MOVE PRVEND-AUX TO PRVEND-04.
001630     IF SREAL-AUX NOT NUMERIC
001640        MOVE ZEROS TO SREAL-04
001650     ELSE
001660        MOVE SREAL-AUX TO SREAL-04.
001670     IF CICM-AUX NOT NUMERIC
001680        MOVE ZEROS TO CICM-04
001690     ELSE
001700        MOVE CICM-AUX TO CICM-04.
001710     IF DIF-AUX NOT NUMERIC
001720        MOVE ZEROS TO DIF-04
001730     ELSE
001740        MOVE DIF-AUX  TO DIF-04.
001750     MOVE STATUS-AUX  TO STATUS-04.
001760     MOVE NAT-AUX     TO NAT-04.
001770     MOVE CLIENTE-AUX TO CLIENTE-04.
001780     MOVE CONSUMO-AUX TO CONSUMO-04.
001790     IF CPU-AUX NOT NUMERIC
001800        MOVE ZEROS     TO CPU-04
001810     ELSE
001820        MOVE CPU-AUX   TO CPU-04.
001830 R-0600.
001840     WRITE REG-04 INVALID KEY
001850        MOVE "MCE6204C" TO CODMENFS
001860        MOVE "ACE04" TO ARQFS
001870        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001880     GO TO R-0300.
001890 R-9999.
001900     CLOSE ACEAUX ACE04.
001910     DISPLAY (22, 14) EX-MENS.
001920     EXIT PROGRAM.
001930*===================F=I=M==============
