000010***********************************
000020* SCE6299-REORGANIZACAO DO ACE01  *
000030***********************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6299.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-01".
000080 COPY "/dados1/book/SELC-02".
000090 COPY "/dados1/book/FDCE".
000100 COPY "/dados1/book/FD-01".
000110 COPY "/dados1/book/FD-02".
000120 COPY "/dados1/book/TAB-W".
000130*======================================
000140 COPY "/dados1/book/CPYPDCE".
000150 COPY "/dados1/book/CPYPDFS".
000160 R-0000.
000170     MOVE "TCE6299" TO TS.
000180     MOVE "REORGANIZACAO DO ARQUIVO " TO INFT.
000190 COPY "/dados1/book/CPYTPCE".
000200     DISPLAY (08, 20) "ZERA EST.DA LOJA 88 E ".
000210     DISPLAY (08, 42) "E GRAVA P/LOJA 01     ".
000220     DISPLAY (10, 30) "CONTINUAR ? (S/<N>) [ ]".
000230     ACCEPT (10, 51) RESP WITH UPDATE.
000240     IF RESP NOT = "S"
000250        EXIT PROGRAM.
000260 R-0100.
000270     DISPLAY (22, 14) "ESTOU PROCESSANDO ARQUIVO AUXILIAR"
000280     OPEN I-O ACE01.
000290     MOVE ZEROS TO CHAVE-01.
000300     START ACE01 KEY IS NOT LESS CHAVE-01 INVALID KEY
000310        DISPLAY (22, 14) "ARQUIVO ACE01 VAZIO"
000320        ACCEPT CR DISPLAY (22, 14) EX-MENS
000330        CLOSE ACE01 STOP RUN.
000340 R-0110.
000350     READ ACE01 NEXT RECORD AT END
000360        GO TO R-9999.
000370     MOVE ZEROS TO EST-01.
000380     MOVE 2     TO CODTRI-01.
000390     REWRITE REG-01 INVALID KEY
000400        DISPLAY (22, 14)
000410        "ERRO NA GRAVACAO ACE01  " FS  "  ==>" COD-01
000420        ACCEPT CR DISPLAY (22, 14) EX-MENS.
000430     GO TO R-0110.
000440 R-9999.
000450     CLOSE ACE01.
000460     DISPLAY (22, 14) EX-MENS.
000470     EXIT PROGRAM.
000480*======================F=I================
