000010***********************************
000020* SCE6204-REORGANIZACAO DO ACE04  *
000030***********************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6204.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-04".
000080      SELECT ACEAUX   ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE IS DYNAMIC
                            LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000110                      RECORD KEY IS CHAVE-AUX
000120                      ALTERNATE RECORD KEY IS ALT-AUX
000130                      WITH DUPLICATES
000140                      FILE STATUS IS FS.
000150 COPY "/dados1/book/FDCE".
000160 COPY "/dados1/book/FD-04".
000170 FD  ACEAUX
000180     VALUE OF FILE-ID IS "ACEAUX".
000190 01  REG-AUX.
000200     03 CHAVE-AUX.
000210        05 LOJA-AUX    PIC 99.
000220        05 COD-AUX     PIC X(06).
000230        05 NF-AUX      PIC 9(06).
000240     03 ALT-AUX.
000250        05 LOTE-AUX    PIC X(05).
000260     03 COND-AUX       PIC X.
000270     03 SERIE-AUX      PIC X.
000280     03 ENTREGA-AUX    PIC X.
000290     03 QTSAIDA-AUX    PIC 9(07).
000300     03 QTSAIDA-AUXR REDEFINES QTSAIDA-AUX PIC 9(05)V99.
000310     03 DATMOV-AUX.
000320        05 AMOV-AUX    PIC 99.
000330        05 MMOV-AUX    PIC 99.
000340        05 DMOV-AUX    PIC 99.
000350     03 VENDEDOR-AUX   PIC 9(05).
000360     03 CC-AUX         PIC 9(04).
000370     03 PRZ-AUX        PIC 9(03).
000380     03 CMEDIO-AUX     PIC 9(11).
000390     03 CMEDIO-AUXR REDEFINES
000400        CMEDIO-AUX     PIC 9(09)V99.
000410     03 CREAL-AUX      PIC 9(11).
000420     03 CREAL-AUXR REDEFINES
000430        CREAL-AUX      PIC 9(09)V99.
000440     03 PRVEND-AUX     PIC 9(12).
000450     03 PRVEND-AUXR REDEFINES
000460        PRVEND-AUX     PIC 9(10)V99.
000470     03 SREAL-AUX      PIC 9(12).
000480     03 SREAL-AUXR REDEFINES
000490        SREAL-AUX      PIC 9(10)V99.
000500     03 CICM-AUX       PIC 9(09).
000510     03 CICM-AUXR REDEFINES
000520        CICM-AUX       PIC 9(07)V99.
000530     03 DIF-AUX        PIC 9(08).
000540     03 DIF-AUXR REDEFINES
000550        DIF-AUX        PIC 9(06)V99.
000560     03 STATUS-AUX     PIC X.
000570     03 NAT-AUX        PIC X(03).
000580     03 CLIENTE-AUX    PIC 9(05).
000590     03 FILLER         PIC X(01).
000600     03 CONSUMO-AUX    PIC X(01).
000610     03 CPU-AUX        PIC 9(04)V99.
000620     03 FILLER        PIC X(01).
000630 COPY "/dados1/book/TAB-W".
000640 COPY "/dados1/book/CPYPDCE".
000650 COPY "/dados1/book/CPYPDFS".
000660 R-0000.
000670     MOVE "TCR6204" TO TS.
000680     MOVE "REORGANIZACAO DO ARQUIVO - ACE04" TO INFT.
000690 COPY "/dados1/book/CPYTPCE".
000700     DISPLAY (08, 30) "REORGANIZACAO DO ACE04".
000710     DISPLAY (10, 30) "REORGANIZAR (S/<N>) [ ]".
000720     ACCEPT (10, 51) RESP WITH UPDATE.
000730     IF RESP NOT = "S"
000740        EXIT PROGRAM.
000750 R-0100.
000760     DISPLAY (22, 14) "ESTOU PROCESSANDO ARQUIVO AUXILIAR"
000770     OPEN INPUT  ACE04.
000780     OPEN OUTPUT ACEAUX.
000790     MOVE ZEROS TO CHAVE-04.
000800     START ACE04 KEY IS NOT LESS CHAVE-04 INVALID KEY
000810        DISPLAY (22, 14) EX-MENS
000820        DISPLAY (22, 14) "ARQUIVO ACE04 VAZIO"
000830        ACCEPT CR DISPLAY (22, 14) EX-MENS
000840        CLOSE ACEAUX ACE04 STOP RUN.
000850 R-0110.
000860     READ ACE04 NEXT RECORD AT END
000870        CLOSE ACE04 ACEAUX
000880        OPEN OUTPUT ACE04
000890        CLOSE ACE04
000900        GO TO R-0200.
000910     WRITE REG-AUX FROM REG-04 INVALID KEY
000920        DISPLAY (22, 14) "ERRO NA GRAVACAO ACEAUX " FS
000930        ACCEPT CR DISPLAY (22, 14) EX-MENS.
000940     GO TO R-0110.
000950*===============================
000960 R-0200.
000970     DISPLAY (22, 14) EX-MENS.
000980     OPEN INPUT ACEAUX.
000990     IF FS NOT = "00"
001000        MOVE "MCE6204A" TO CODMENFS
001010        MOVE "ACEAUX" TO ARQFS
001020        PERFORM TESTA-FS THRU SAI-TESTA-FS
001030        CLOSE ACEAUX STOP RUN.
001040     OPEN I-O ACE04.
001050     IF FS NOT = "00"
001060        MOVE "MCE6204B" TO CODMENFS
001070        MOVE "ACE04" TO ARQFS
001080        PERFORM TESTA-FS THRU SAI-TESTA-FS
001090        CLOSE ACEAUX ACE04 STOP RUN.
001100 R-0300.
001110     READ ACEAUX NEXT AT END
001120         GO TO R-9999.
001130 R-0400.
001140     MOVE ZEROS TO REG-04.
001150     MOVE SPACES TO COND-04 SERIE-04 ENTREGA-04.
001160     MOVE CHAVE-AUX   TO CHAVE-04.
001170     MOVE ALT-AUX     TO ALT-04.
001180     MOVE COND-AUX    TO COND-04.
001190     MOVE SERIE-AUX   TO SERIE-04.
001200     MOVE "L"      TO ENTREGA-04.
001210     MOVE "01"     TO LOJA-04.
001220     IF QTSAIDA-AUX NOT NUMERIC
001230        MOVE ZEROS TO QTSAIDA-04
001240     ELSE
001250        MOVE QTSAIDA-AUX TO QTSAIDA-04.
001260     IF DATMOV-AUX NOT NUMERIC
001270        MOVE ZEROS TO DATMOV-04
001280     ELSE
001290        MOVE DATMOV-AUX TO DATMOV-04.
001300     IF VENDEDOR-AUX NOT NUMERIC
001310        MOVE ZEROS TO VENDEDOR-04
001320     ELSE
001330        MOVE VENDEDOR-AUX TO VENDEDOR-04.
001340     IF CUSTO-EMPCE = "N"
001350        MOVE ZEROS TO CC-04
001360        GO TO R-0500.
001370     IF CC-AUX NOT NUMERIC
001380        MOVE ZEROS TO CC-04
001390     ELSE
001400        MOVE CC-AUX TO CC-04.
001410 R-0500.
001420     IF PRZ-AUX NOT NUMERIC
001430        MOVE ZEROS TO PRZ-04
001440     ELSE
001450        MOVE PRZ-AUX TO PRZ-04.
001460     IF CMEDIO-AUX NOT NUMERIC
001470        MOVE ZEROS TO CMEDIO-04
001480     ELSE
001490        MOVE CMEDIO-AUX TO CMEDIO-04.
001500     IF CREAL-AUX NOT NUMERIC
001510        MOVE ZEROS TO CREAL-04
001520     ELSE
001530        MOVE CREAL-AUX TO CREAL-04.
001540     IF PRVEND-AUX NOT NUMERIC
001550        MOVE ZEROS TO PRVEND-04
001560     ELSE
001570        MOVE PRVEND-AUX TO PRVEND-04.
001580     IF SREAL-AUX NOT NUMERIC
001590        MOVE ZEROS TO SREAL-04
001600     ELSE
001610        MOVE SREAL-AUX TO SREAL-04.
001620     IF CICM-AUX NOT NUMERIC
001630        MOVE ZEROS TO CICM-04
001640     ELSE
001650        MOVE CICM-AUX TO CICM-04.
001660     IF DIF-AUX NOT NUMERIC
001670        MOVE ZEROS TO DIF-04
001680     ELSE
001690        MOVE DIF-AUX  TO DIF-04.
001700     MOVE STATUS-AUX  TO STATUS-04.
001710     MOVE NAT-AUX     TO NAT-04.
001720     MOVE CLIENTE-AUX TO CLIENTE-04.
001730     MOVE CONSUMO-AUX TO CONSUMO-04.
001740     IF CPU-AUX NOT NUMERIC
001750        MOVE ZEROS     TO CPU-04
001760     ELSE
001770        MOVE CPU-AUX   TO CPU-04.
001780 R-0600.
001790     WRITE REG-04 INVALID KEY
001800        MOVE "MCE6204C" TO CODMENFS
001810        MOVE "ACE04" TO ARQFS
001820        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001830     GO TO R-0300.
001840 R-9999.
001850     CLOSE ACEAUX ACE04.
001860     DISPLAY (22, 14) EX-MENS.
001870     EXIT PROGRAM.
001880*===================F=I=M==============
