000010***********************************
000020* SCE6202-REORGANIZACAO DO ACE02  *
000030***********************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6202.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-02".
000080      SELECT  ACEAUX  ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE IS DYNAMIC
                            LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000110                      RECORD KEY IS CHAVE-AUX
000120                      ALTERNATE RECORD KEY IS COD-AUX
000130                      WITH DUPLICATES
000140                      FILE STATUS IS FS.
000150 COPY "/dados1/book/FDCE".
000160 COPY "/dados1/book/FD-02".
000170 FD  ACEAUX
000180     VALUE OF FILE-ID IS "ACEAUX".
000190 01  REG-AUX.
000200     03 CHAVE-AUX.
000210        05 LOJA-AUX    PIC XX.
000220        05 COD-AUX     PIC X(06).
000230     03 FLAG-AUX       PIC X.
000240     03 QTLOJ-AUX      PIC 9(07).
000250     03 QTLOJ-AUXR REDEFINES QTLOJ-AUX PIC 9(05)V99.
000260     03 QTREP-AUX      PIC 9(07).
000270     03 QTREP-AUXR REDEFINES QTREP-AUX PIC 9(05)V99.
000280     03 QTMIN-AUX      PIC 9(07).
000290     03 QTMIN-AUXR REDEFINES QTMIN-AUX PIC 9(05)V99.
000300     03 QTSAI-AUX      PIC 9(07).
000310     03 QTSAI-AUXR REDEFINES QTSAI-AUX PIC 9(05)V99.
000320     03 DATNOV-AUX.
000330        05 MESNOV-AUX  PIC 99.
000340        05 ANONOV-AUX  PIC 99.
000350     03 VED-AUX        PIC 9(12).
000360     03 VED-AUXR REDEFINES VED-AUX PIC 9(10)V99.
000370*VENDA NO MES
000380     03 SUG-AUX       PIC X(01).
000390     03 VRCUS-AUX     PIC 9(10).
000400     03 VRCUS-AUXR REDEFINES VRCUS-AUX PIC 9(08)V99.
000410 COPY "/dados1/book/TAB-W".
000420 COPY "/dados1/book/CPYPDCE".
000430 COPY "/dados1/book/CPYPDFS".
000440 R-0000.
000450     MOVE "TCR6202" TO TS.
000460     MOVE "REORGANIZACAO DO ARQUIVO - ACE02" TO INFT.
000470 COPY "/dados1/book/CPYTPCE".
000480     DISPLAY (08, 30) "REORGANIZACAO DO ACE02".
000490     DISPLAY (10, 30) "REORGANIZAR (S/<N>) [ ]".
000500     ACCEPT (10, 51) RESP WITH UPDATE.
000510     IF RESP NOT = "S"
000520        EXIT PROGRAM.
000530 R-0100.
000540     DISPLAY (22, 14) "ESTOU PROCESSANDO ARQUIVO AUXILIAR"
000550     OPEN INPUT  ACE02.
000560     OPEN OUTPUT ACEAUX.
000570     MOVE ZEROS TO CHAVE-02.
000580     START ACE02 KEY IS NOT LESS CHAVE-02 INVALID KEY
000590        DISPLAY (22, 14) "ARQUIVO ACE02 VAZIO"
000600        ACCEPT CR DISPLAY (22, 14) EX-MENS
000610        CLOSE ACEAUX ACE02 STOP RUN.
000620 R-0110.
000630     READ ACE02 NEXT RECORD AT END
000640        CLOSE ACE02 ACEAUX
000650        OPEN OUTPUT ACE02
000660        CLOSE ACE02
000670        GO TO R-0200.
000680     WRITE REG-AUX FROM REG-02 INVALID KEY
000690        DISPLAY (22, 14) "ERRO NA GRAVACAO ACEAUX " FS
000700        ACCEPT CR DISPLAY (22, 14) EX-MENS.
000710     GO TO R-0110.
000720*===============================
000730 R-0200.
000740     DISPLAY (22, 14) EX-MENS.
000750     OPEN INPUT ACEAUX.
000760     IF FS NOT = "00"
000770        MOVE "MCE6202A" TO CODMENFS
000780        MOVE "ACEAUX" TO ARQFS
000790        PERFORM TESTA-FS THRU SAI-TESTA-FS
000800        CLOSE ACEAUX STOP RUN.
000810     OPEN I-O ACE02.
000820     IF FS NOT = "00"
000830        MOVE "MCE6202B" TO CODMENFS
000840        MOVE "ACE02" TO ARQFS
000850        PERFORM TESTA-FS THRU SAI-TESTA-FS
000860        CLOSE ACEAUX ACE02 STOP RUN.
000870 R-0300.
000880     READ ACEAUX NEXT RECORD AT END
000890         GO TO R-9999.
000900     MOVE "01"      TO LOJA-02.
000910     MOVE COD-AUX   TO COD-02.
000920     MOVE FLAG-AUX  TO FLAG-02.
000930     IF QTLOJ-AUX NOT NUMERIC
000940        MOVE ZEROS TO QTLOJ-02
000950     ELSE
000960        MOVE QTLOJ-AUX TO QTLOJ-02.
000970     IF QTREP-AUX NOT NUMERIC
000980        MOVE ZEROS TO QTREP-02
000990     ELSE
001000        MOVE QTREP-AUX TO QTREP-02.
001010     IF QTMIN-AUX NOT NUMERIC
001020        MOVE ZEROS TO QTMIN-02
001030     ELSE
001040        MOVE QTMIN-AUX TO QTMIN-02.
001050     IF QTSAI-AUX NOT NUMERIC
001060        MOVE ZEROS TO QTSAI-02
001070     ELSE
001080        MOVE QTSAI-AUX TO QTSAI-02.
001090     IF DATNOV-AUX NOT NUMERIC
001100        MOVE ZEROS TO DATNOV-02
001110     ELSE
001120        MOVE DATNOV-AUX TO DATNOV-02
001130     IF VED-AUX NOT NUMERIC
001140        MOVE ZEROS TO VED-02
001150     ELSE
001160        MOVE VED-AUX TO VED-02.
001170     IF SUG-AUX NOT NUMERIC
001180        MOVE ZEROS TO SUG-02
001190     ELSE
001200        MOVE SUG-AUX TO SUG-02.
001210     IF VRCUS-AUX NOT NUMERIC
001220        MOVE ZEROS TO VRCUS-02
001230     ELSE
001240        MOVE VRCUS-AUX TO VRCUS-02.
001250 R-0500.
001260     WRITE REG-02 INVALID KEY
001270        MOVE "MCE6202C" TO CODMENFS
001280        MOVE "ACE02" TO ARQFS
001290        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001300     GO TO R-0300.
001310 R-9999.
001320     CLOSE ACEAUX ACE02.
001330     DISPLAY (22, 14) EX-MENS.
001340     EXIT PROGRAM.
001350************* FIM DO PROGRAMA *******************
