000010********************************************************
000020* SCE6301-PREPARACAO P/DIGITACAO DE MOVIMENTO DE BAIXAS*
000030********************************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6301.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/FDCE".
000080 COPY "/dados1/book/TAB-W".
000090 COPY "/dados1/book/CPYPDCE".
000100 COPY "/dados1/book/CPYPDFS".
000110 R-0000.
000120     OPEN I-O EMPCE.
000130     IF FS NOT = "00"
000140        MOVE "MCE6301B" TO CODMENFS
000150        MOVE "EMPCE" TO ARQFS
000160        PERFORM TESTA-FS THRU SAI-TESTA-FS
000170        CLOSE EMPCE STOP RUN.
000180 R-0100.
000190     MOVE  "TCE6301" TO TS.
000200     MOVE "PREPARACAO P/DIGITACAO DO MOVIMENTO DE BAIXA" TO INFT.
000210 COPY "/dados1/book/CPYTPCE".
000220     DISPLAY (07, 26) "DIGITE NOVO MES P/MOVIMENTO.:".
000230     ACCEPT (07, 56) IND1-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000240     IF E = "01"
000250        GO TO R-9999.
000260 R-0110.
000270     IF IND1-W = 0 OR IND1-W > 12
000280        DISPLAY (22, 14) "MES INVALIDO - REDIGITE"
000290        ACCEPT (22, 78) CR WITH UPDATE
000300        DISPLAY (22, 14) EX-MENS  GO TO R-0100.
000310     IF ROT-CE(01) = "N"
000320        DISPLAY (22, 14)
000330        "EMITIR RELATORIO VENDA NO MES/SUGESTAO DE COMPRAS"
000340        ACCEPT (22, 78) CR WITH UPDATE
000350        DISPLAY (22, 14) EX-MENS
000360        GO TO R-9999
000370     ELSE
000380        MOVE "N" TO ROT-CE(01).
000390     MOVE "S" TO ROT-CE(02).
000400     IF ROT-CE(02) = "N"
000410        DISPLAY (22, 14) "EMITIR RELATORIO CUSTO REAL/VENDA"
000420        ACCEPT (22, 78) CR WITH UPDATE
000430        DISPLAY (22, 14) EX-MENS
000440        GO TO R-9999
000450     ELSE
000460        MOVE "N" TO ROT-CE(02).
000470     IF ROT-CE(03) = "N"
000480        DISPLAY (22, 14) "EMITIR COMISSAO DE VENDEDORES "
000490        ACCEPT (22, 78) CR WITH UPDATE
000500        DISPLAY (22, 14) EX-MENS
000510        GO TO R-9999
000520     ELSE
000530        MOVE "N" TO ROT-CE(03).
000540     IF ROT-CE(04) = "N"
000550        DISPLAY (22, 14) "ZERAR ACUMULADO DE VENDA NO MES "
000560        ACCEPT (22, 78) CR WITH UPDATE
000570        DISPLAY (22, 14) EX-MENS
000580        GO TO R-9999
000590     ELSE
000600        MOVE "N" TO ROT-CE(04).
000610     IF ROT-CE(05) = "N"
000620        DISPLAY (22, 14) "INFLACIONAR CUSTO REAL"
000630        ACCEPT (22, 78) CR WITH UPDATE
000640        DISPLAY (22, 14) EX-MENS
000650        GO TO R-9999
000660     ELSE
000670        MOVE "N" TO ROT-CE(05).
000680     IF ROT-CE(06) = "N"
000690        DISPLAY (22, 14)
000700        "VENDAS/SUGESTAO COMPRAS VIA LISTA DE PRECO"
000710        ACCEPT (22, 78) CR WITH UPDATE
000720        DISPLAY (22, 14) EX-MENS
000730        GO TO R-9999
000740     ELSE
000750        MOVE "N" TO ROT-CE(06).
000760     MOVE IND1-W  TO MES-EMP.
000770     MOVE ALL "N" TO ROT-EMP.
000780     REWRITE REG-EMPCE INVALID KEY
000790        MOVE 1 TO ST.
000800     DISPLAY (22, 14) "PREPARACAO P/DIGITACAO ATUALIZADA"
000810     ACCEPT (22, 25) CR WITH UPDATE.
000820     DISPLAY (22, 14) EX-MENS.
000830  R-9999.
000840     CLOSE EMPCE.
000850     EXIT PROGRAM.
000860*-------------F-I-M----------------
