000010*************************************
000020* SCE6102-INICIALIZACAO DE ARQUIVOS *
000030*************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6102.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-13".
000080 COPY "/dados1/book/SELBA03".
000090 COPY "/dados1/book/SELC-15".
000100 COPY "/dados1/book/SELC-16".
000110 COPY "/dados1/book/SELC-18".
000120 COPY "/dados1/book/SELCB08".
000130 COPY "/dados1/book/SELC-20".
000140 COPY "/dados1/book/SELC-21".
000150 COPY "/dados1/book/SELC-22".
000160 COPY "/dados1/book/SELCC01".
000170 COPY "/dados1/book/SELCT52".
000180 COPY "/dados1/book/SELCF04".
000190 COPY "/dados1/book/FDCE".
000200 COPY "/dados1/book/FD-13".
000210 COPY "/dados1/book/FDBA03".
000220 COPY "/dados1/book/FD-15".
000230 COPY "/dados1/book/FD-16".
000240 COPY "/dados1/book/FD-18".
000250 COPY "/dados1/book/FDCB08".
000260 COPY "/dados1/book/FD-20".
000270 COPY "/dados1/book/FD-21".
000280 COPY "/dados1/book/FD-22".
000290 COPY "/dados1/book/FDACC01".
000300 COPY "/dados1/book/FDCT52".
000310 COPY "/dados1/book/FDCF-04".
000320 COPY "/dados1/book/TAB-W".
000330 01  SENHA          PIC X(06) VALUE SPACES.
000340 01  MENS           PIC X(34) VALUE
000350     "SENHA NAO AUTORIZADA A ESTA FUNCAO".
000360 COPY "/dados1/book/CPYPDCE".
000370 COPY "/dados1/book/CPYPDFS".
000380 R-0100.
000390     DISPLAY (22, 14) EX-MENS.
000400     MOVE ZEROS TO OPCAO-2.
000410     DISPLAY (22, 14) "<   > - ARQUIVO DESEJADO  .......".
000420     DISPLAY (22, 47) "SENHA:......: CONFIRMA (<S/N>):".
000430     ACCEPT (22, 15) OPCAO-2 WITH UPDATE.
000440     IF OPCAO-2 < 13 OR OPCAO-2 > 24
000450        EXIT PROGRAM.
000460     IF OPCAO-2 = 13 GO TO R-0500.
000470     IF OPCAO-2 = 14 GO TO R-0600.
000480     IF OPCAO-2 = 15 GO TO R-0700.
000490     IF OPCAO-2 = 16 GO TO R-0800.
000500     IF OPCAO-2 = 17 GO TO R-0900.
000510     IF OPCAO-2 = 18 GO TO R-1000.
000520     IF OPCAO-2 = 19 GO TO R-1100.
000530     IF OPCAO-2 = 20 GO TO R-1200.
000540     IF OPCAO-2 = 21 GO TO R-1300.
000550     IF OPCAO-2 = 22 GO TO R-1400.
000560     IF OPCAO-2 = 23 GO TO R-1500.
000570     IF OPCAO-2 = 24 GO TO R-1600.
000580     GO TO R-0100.
000590 R-0500.
000600     DISPLAY (22, 39) "ACE13" COMP-W.
000610     PERFORM R-7777 THRU R-7778.
000620     IF CR NOT = "S" GO TO R-0100.
000630     OPEN OUTPUT ACE13 CLOSE ACE13.
000640     DISPLAY (22, 61) "** INICIALIZADO **"
000650     ACCEPT (22, 79) CR WITH UPDATE.
000660     GO TO R-0100.
000670 R-0600.
000680     DISPLAY (22, 39) "ABA03" COMP-W.
000690     PERFORM R-7777 THRU R-7778.
000700     IF CR NOT = "S" GO TO R-0100.
000710     OPEN OUTPUT ABA03 CLOSE ABA03.
000720     DISPLAY (22, 61) "** INICIALIZADO **"
000730     ACCEPT (22, 79) CR WITH UPDATE.
000740     GO TO R-0100.
000750 R-0700.
000760     DISPLAY (22, 39) "ACE15 " COMP-W.
000770     PERFORM R-7777 THRU R-7778.
000780     IF CR NOT = "S"  GO TO R-0100.
000790     OPEN OUTPUT ACE15 CLOSE ACE15.
000800     DISPLAY (22, 61) "** INICIALIZADO **"
000810     ACCEPT (22, 79) CR WITH UPDATE.
000820     GO TO R-0100.
000830 R-0800.
000840     DISPLAY (22, 39) "ACE16" COMP-W.
000850     PERFORM R-7777 THRU R-7778.
000860     IF CR NOT = "S" GO TO R-0100.
000870     OPEN OUTPUT ACE16   CLOSE ACE16.
000880     DISPLAY (22, 61) "** INICIALIZADO **"
000890     ACCEPT (22, 79) CR WITH UPDATE.
000900     GO TO R-0100.
000910 R-0900.
000920     DISPLAY (22, 39) "ACE18" COMP-W.
000930     PERFORM R-7777 THRU R-7778.
000940     IF CR NOT = "S" GO TO R-0100.
000950     OPEN OUTPUT ACE18 CLOSE ACE18.
000960     DISPLAY (22, 61) "** INICIALIZADO **"
000970     ACCEPT (22, 79) CR WITH UPDATE.
000980     GO TO R-0100.
000990 R-1000.
001000     DISPLAY (22, 39) "ACC01" COMP-W.
001010     PERFORM R-7777 THRU R-7778.
001020     IF CR NOT = "S" GO TO R-0100.
001030     OPEN OUTPUT ACC01   CLOSE ACC01.
001040     DISPLAY (22, 61) "** INICIALIZADO **"
001050     ACCEPT (22, 79) CR WITH UPDATE.
001060     GO TO R-0100.
001070 R-1100.
001080     DISPLAY (22, 39) "ACB08" COMP-W.
001090     PERFORM R-7777 THRU R-7778.
001100     IF CR NOT = "S" GO TO R-0100.
001110     OPEN OUTPUT ACB08 CLOSE ACB08.
001120     DISPLAY (22, 61) "** INICIALIZADO **"
001130     ACCEPT (22, 79) CR WITH UPDATE.
001140     GO TO R-0100.
001150 R-1200.
001160     DISPLAY (22, 39) "ACT52" COMP-W.
001170     PERFORM R-7777 THRU R-7778.
001180     IF CR NOT = "S" GO TO R-0100.
001190     OPEN OUTPUT ACT52 CLOSE ACT52.
001200     DISPLAY (22, 61) "** INICIALIZADO **"
001210     ACCEPT (22, 79) CR WITH UPDATE.
001220     GO TO R-0100.
001230 R-1300.
001240     DISPLAY (22, 39) "ACF04" COMP-W.
001250     PERFORM R-7777 THRU R-7778.
001260     IF CR NOT = "S" GO TO R-0100.
001270     OPEN OUTPUT ACF04 CLOSE ACF04.
001280     DISPLAY (22, 61) "** INICIALIZADO **"
001290     ACCEPT (22, 79) CR WITH UPDATE.
001300     GO TO R-0100.
001310 R-1400.
001320     DISPLAY (22, 39) "ACE20" COMP-W.
001330     PERFORM R-7777 THRU R-7778.
001340     IF CR NOT = "S" GO TO R-0100.
001350     OPEN OUTPUT ACE20 CLOSE ACE20.
001360     DISPLAY (22, 61) "** INICIALIZADO **"
001370     ACCEPT (22, 79) CR WITH UPDATE.
001380     GO TO R-0100.
001390 R-1500.
001400     DISPLAY (22, 39) "ACE21" COMP-W.
001410     PERFORM R-7777 THRU R-7778.
001420     IF CR NOT = "S" GO TO R-0100.
001430     OPEN OUTPUT ACE21 CLOSE ACE21.
001440     DISPLAY (22, 61) "** INICIALIZADO **"
001450     ACCEPT (22, 79) CR WITH UPDATE.
001460     GO TO R-0100.
001470 R-1600.
001480     DISPLAY (22, 39) "ACE22" COMP-W.
001490     PERFORM R-7777 THRU R-7778.
001500     IF CR NOT = "S" GO TO R-0100.
001510     OPEN OUTPUT ACE22 CLOSE ACE22.
001520     DISPLAY (22, 61) "** INICIALIZADO **"
001530     ACCEPT (22, 79) CR WITH UPDATE.
001540     GO TO R-0100.
001550 R-7777.
001560     ACCEPT (22, 53) SENHA WITH NO-ECHO.
001570     IF SENHA NOT = "INICIO"
001580        MOVE "N" TO CR
001590        GO TO R-7778.
001600     ACCEPT (22, 78) CR WITH UPDATE.
001610 R-7778.
001620     EXIT.
001630 R-7779.
001640     WRITE REG-13 INVALID KEY MOVE 1 TO ST.
001650     WRITE REG-BA03 INVALID KEY MOVE 1 TO ST.
001660     WRITE REGCB-08 INVALID KEY MOVE 1 TO ST.
001670     WRITE REG-15 INVALID KEY MOVE 1 TO ST.
001680     WRITE REG-16 INVALID KEY MOVE 1 TO ST.
001690     WRITE REG-18 INVALID KEY MOVE 1 TO ST.
001700     WRITE REG-ACE20 INVALID KEY MOVE 1 TO ST.
001710     WRITE REG-21 INVALID KEY MOVE 1 TO ST.
001720     WRITE REG-ACE22 INVALID KEY MOVE 1 TO ST.
001730     WRITE REGCC-01 INVALID KEY MOVE 1 TO ST.
001740     WRITE REG-CT52 INVALID KEY MOVE 1 TO ST.
001750     WRITE REG-CF04 INVALID KEY MOVE 1 TO ST.
001760*============F=I=M=================
