000010****************************************
000020* SEQUENCIA ACE02 GERANDO ACE02S       *
000030****************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6905.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-02".
000080 COPY "/dados1/book/FDCE".
000090 COPY "/dados1/book/FD-02".
000100 COPY "/dados1/book/TAB-W".
000110 01 LIMPA-1         PIC X(76) VALUE SPACES.
000120 COPY "/dados1/book/CPYPDCE".
000130 COPY "/dados1/book/CPYPDFS".
000140 R-0100.
000150     DISPLAY (01, 01) ERASE.
000160 COPY "/dados1/book/MOLDURA".
000170 ROT-OPCAO.
000180     MOVE "TCE6905" TO TS.
000190     MOVE "REINDEXA / SEQUENCIA - ACE02" TO INFT.
000200     DISPLAY (02, 25) "SISTEMA CONTROLE DE ESTOQUE".
000210     DISPLAY (02, 75) COD-EMPCE.
000220     DISPLAY (04, 01) LIMPA-1.    
000230     DISPLAY (04, 04) TS.
000240     DISPLAY (04, 25) INFT.
000250     DISPLAY (22, 14) EX-MENS.
000260     DISPLAY (02, 14) HH-W ":" MS-W.
000270     DISPLAY (08, 25) "LIMPAR CAMPO SUGESTAO "
000280     DISPLAY (12, 25) "< > CONFIRMA ESTA OPCAO".
000290     ACCEPT (12, 26) OPCAO WITH UPDATE.
000300     ACCEPT E FROM ESCAPE KEY.
000310     IF E = "01" GO TO R-9999.
000320     IF OPCAO = "S" GO TO ROT-S.
000330     GO TO ROT-OPCAO.
000340 ROT-S.
000350     MOVE "AGUADE PROCESSAMENTO OK       " TO INFT.
000360     DISPLAY (22, 25) INFT.
000370     OPEN I-O ACE02.   
000380     IF FS NOT = "00"
000390        MOVE "MCE6905A" TO CODMENFS
000400        MOVE "ACE02" TO ARQFS
000410        PERFORM TESTA-FS THRU SAI-TESTA-FS
000420        CLOSE ACE02 STOP RUN.
000430     MOVE LOW-VALUES TO CHAVE-02.
000440     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
000450        DISPLAY (22, 14) "CAD. ESTOQUE NA LOJA, VAZIO < >"
000460        ACCEPT (22, 78) CR WITH UPDATE
000470        GO TO R-9999.
000480 R-100.
000490     READ ACE02 NEXT RECORD AT END
000500        CLOSE ACE02 GO TO R-9999.
000510     MOVE SPACES TO SUG-02.
000520     REWRITE REG-02 INVALID KEY
000530        MOVE "MCE6905D" TO CODMENFS
000540        MOVE "ACE02" TO ARQFS
000550        PERFORM TESTA-FS THRU SAI-TESTA-FS.
000560     GO TO R-100.
000570 R-9999.
000580      EXIT PROGRAM.
000590*---------------F-I-M-------------------
