000010*******************************************
000020* SCE6501-PROGRAMA PARA ZERAR OS CAMPOS   *
000030*         VENDAMES-01 CUSTO-REAL NO ACE01 *
000040******************************************COMP EM 01/08/2005*
000050 IDENTIFICATION DIVISION.
000060 PROGRAM-ID. OCE6501.
000070 COPY "/dados1/book/SELCE".
000080 COPY "/dados1/book/SELC-01".
000090 COPY "/dados1/book/SELC-23".
000100 COPY "/dados1/book/SELC-02".
000110 COPY "/dados1/book/FDCE".
000120 COPY "/dados1/book/FD-01".
000130 COPY "/dados1/book/FD-02".
000140 COPY "/dados1/book/FD-23".
000150 COPY "/dados1/book/TAB-W".
000160 COPY "/dados1/book/CPYPDCE".
000170 COPY "/dados1/book/CPYPDFS".
000180 R-0000.
000190     OPEN I-O ACE01.
000200     IF FS NOT = "00"
000210        MOVE "MCE6401A" TO CODMENFS
000220        MOVE "ACE01"     TO ARQFS
000230        PERFORM TESTA-FS THRU SAI-TESTA-FS
000240        CLOSE ACE01 STOP RUN.
000250     OPEN I-O ACE02.
000260     IF FS NOT = "00"
000270        MOVE "MCE6401B" TO CODMENFS
000280        MOVE "ACE02"     TO ARQFS
000290        PERFORM TESTA-FS THRU SAI-TESTA-FS
000300        CLOSE ACE01 ACE02 STOP RUN.
000310     OPEN I-O ACE23.
000320     IF FS NOT = "00"
000330        MOVE "MCE6401B" TO CODMENFS
000340        MOVE "ACE23"     TO ARQFS
000350        PERFORM TESTA-FS THRU SAI-TESTA-FS
000360        CLOSE ACE01 ACE02 ACE23 STOP RUN.
000370 R-0100.
000380     MOVE "ZERAR ACUMULADORES DO MES/GERAR LIVRO" TO INFT.
000390     MOVE "TCE6501" TO TS.
000400 COPY "/dados1/book/CPYTPCE".
000410 R-0200.
000420     DISPLAY (12, 26) "MES E ANO A ENCERRAR:".
000430     ACCEPT (12, 47) IND1-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000440     IF E = "01" GO TO R-9999.
000450     IF IND1-W = ZEROS OR > 12 GO TO R-0200.
000460     DISPLAY (12, 49) "/".
000470     ACCEPT (12, 50) IND2-W WITH UPDATE.
000480     IF IND2-W = ZEROS GO TO R-0200.
000490     DISPLAY (16, 26) "CONFIRMA (S/<N>) ....:.".
000500     ACCEPT (16, 48) RESP WITH UPDATE.
000510     IF RESP NOT = "S" GO TO R-9999.
000520     IF ROT-CE(04) NOT = "S" GO TO R-0201.
000530     DISPLAY (22, 14) "JA FOI ACUMULADO CONTINUA <S/<N>>:".
000540     ACCEPT (22, 78) RESP WITH UPDATE.
000550     IF RESP NOT = "S" GO TO R-9999.
000560 R-0201.
000570     MOVE LOW-VALUES TO CHAVE-02.
000580     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
000590         GO TO R-0206.
000600 R-0202.
000610     READ ACE02 NEXT RECORD AT END GO TO R-0206.
000620     MOVE COD-02    TO COD-01 COD-23.
000630     READ ACE01 INVALID KEY GO TO R-0202.
000640     MOVE IND2-W    TO ANO-23.
000650     MOVE LOJA-02   TO LOJA-23.
000660     MOVE DESC-01   TO DESC-23.
000670     MOVE UND-01    TO UND-23.
000680     MOVE CLASSECE-01 TO CLASSE-23.
000690     READ ACE23 INVALID KEY
000700         GO TO R-0203.
000710     MOVE QTLOJ-02  TO EST-23(IND1-W).
000720     MOVE CREAL-01  TO CREAL-23(IND1-W).
000730     MOVE CMEDIO-01 TO CMEDIO-23(IND1-W).
000740     MOVE CATUAL-01 TO CATUAL-23(IND1-W).
000750     REWRITE REG-ACE23 INVALID KEY
000760        MOVE "MCE6501A" TO CODMENFS
000770        MOVE "ACE23" TO ARQFS
000780        PERFORM TESTA-FS THRU SAI-TESTA-FS
000790        GO TO R-9999.
000800     GO TO R-0202.
000810 R-0203.
000820     MOVE ALL ZEROS TO REG-ACE23.
000830     MOVE IND2-W    TO ANO-23.
000840     MOVE LOJA-02   TO LOJA-23.
000850     MOVE COD-01    TO COD-23.
000860     MOVE UND-01    TO UND-23.
000870     MOVE QTLOJ-02  TO EST-23(IND1-W).
000880     MOVE DESC-01   TO DESC-23.
000890     MOVE CLASSECE-01 TO CLASSE-23.
000900     MOVE CREAL-01  TO CREAL-23(IND1-W).
000910     MOVE CMEDIO-01 TO CMEDIO-23(IND1-W).
000920     MOVE CATUAL-01 TO CATUAL-23(IND1-W).
000930     WRITE REG-ACE23 INVALID KEY
000940        MOVE "MCE6501A" TO CODMENFS
000950        MOVE "ACE23" TO ARQFS
000960        PERFORM TESTA-FS THRU SAI-TESTA-FS
000970        GO TO R-0202.
000980     GO TO R-0202.
000990 R-0206.
001000     MOVE LOW-VALUES TO COD-01.
001010     START ACE01 KEY IS NOT < COD-01 INVALID KEY
001020         GO TO R-209.
001030 R-207.
001040     READ ACE01 NEXT RECORD AT END GO TO R-209.
001050     IF EST-01 = ZEROS GO TO R-207.
001060     MOVE COD-01    TO COD-23.
001070     MOVE IND2-W    TO ANO-23.
001080     MOVE "88"      TO LOJA-23.
001090     READ ACE23 INVALID KEY
001100         GO TO R-0208.
001110     MOVE EST-01    TO EST-23(IND1-W).
001120     MOVE UND-01    TO UND-23.
001130     MOVE CLASSECE-01 TO CLASSE-23.
001140     MOVE CREAL-01  TO CREAL-23(IND1-W).
001150     MOVE CMEDIO-01 TO CMEDIO-23(IND1-W).
001160     MOVE CATUAL-01 TO CATUAL-23(IND1-W).
001170     REWRITE REG-ACE23 INVALID KEY
001180         MOVE "MCE6501A" TO CODMENFS
001190         MOVE "ACE23" TO ARQFS
001200         PERFORM TESTA-FS THRU SAI-TESTA-FS
001210         GO TO R-9999.
001220     GO TO R-207.
001230 R-0208.
001240     MOVE ALL ZEROS TO REG-ACE23.
001250     MOVE IND2-W    TO ANO-23.
001260     MOVE "88"      TO LOJA-23.
001270     MOVE COD-01    TO COD-23.
001280     MOVE EST-01    TO EST-23(IND1-W).
001290     MOVE DESC-01   TO DESC-23.
001300     MOVE UND-01    TO UND-23.
001310     MOVE CLASSECE-01 TO CLASSE-23.
001320     MOVE CREAL-01  TO CREAL-23(IND1-W).
001330     MOVE CMEDIO-01 TO CMEDIO-23(IND1-W).
001340     MOVE CATUAL-01 TO CATUAL-23(IND1-W).
001350     WRITE REG-ACE23 INVALID KEY
001360        MOVE "MCE6501A" TO CODMENFS
001370        MOVE "ACE23" TO ARQFS
001380        PERFORM TESTA-FS THRU SAI-TESTA-FS
001390        GO TO R-9999.
001400     GO TO R-207.
001410 R-209.
001420     IF IND1-W = 12
001430        MOVE 01 TO IND1-W
001440     ELSE
001450        ADD 1 TO IND1-W.
001460     MOVE SPACES TO CHAVE-01.
001470     START ACE01 KEY IS NOT < CHAVE-01 INVALID KEY
001480        GO TO R-0301.
001490 R-0300.
001500     READ ACE01 NEXT RECORD AT END
001510        GO TO R-0301.
001520     MOVE ZEROS TO QTSAI-01(IND1-W) QTENT-01.
001530     REWRITE REG-01 INVALID KEY
001540        DISPLAY (22, 14) "ERRO NA REGRAVACAO ACE01 < > " FS
001550        ACCEPT (22, 78) CR WITH UPDATE
001560        DISPLAY (22, 14) EX-MENS
001570        GO TO R-9999.
001580     GO TO R-0300.
001590 R-0301.
001600     MOVE SPACES TO CHAVE-02.
001610     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
001620        GO TO R-0500.
001630 R-0400.
001640     READ ACE02 NEXT RECORD AT END GO TO R-0500.
001650     MOVE 0 TO QTSAI-02 VED-02.
001660     REWRITE REG-02 INVALID KEY
001670        DISPLAY (23, 02) "ERRO NA REGRAVACAO ACE02 < > " FS
001680        ACCEPT (23, 01) CR WITH UPDATE
001690        GO TO R-0400.
001700     GO TO R-0400.
001710 R-0500.
001720     OPEN I-O EMPCE.
001730     IF FS NOT = "00"
001740        MOVE "MCE6401C" TO CODMENFS
001750        MOVE "EMPCE"     TO ARQFS
001760        PERFORM TESTA-FS THRU SAI-TESTA-FS
001770        CLOSE EMPCE GO TO R-9999.
001780     MOVE ARG-W  TO  COD-EMPCE
001790     READ EMPCE INVALID KEY
001800        MOVE 1 TO ST.
001810 R-0600.
001820     MOVE "N" TO CR.
001830     DISPLAY (16, 26) "ENCERRAR O MES:--> (S/<N>):".
001840     ACCEPT (16, 53) CR WITH UPDATE
001850     IF CR = "S"
001860        MOVE "S" TO ROT-CE(04)
001870        DISPLAY (22, 14) "EXECUTADO ENCERRAMENTO DO MES"
001880     ELSE
001890        MOVE "N" TO ROT-CE(04).
001900     MOVE ZEROS TO VENDA-EMPCE FINC-EMPCE.
001910     MOVE ALL ZEROS TO MES-EMPCE(IND1-W).
001920     REWRITE REG-EMPCE INVALID KEY
001930        MOVE 1 TO ST.
001940     CLOSE EMPCE.
001950 R-9999.
001960     CLOSE ACE01 ACE02 ACE23.
001970     EXIT PROGRAM.
001980*-------------------F-I-M--------------------
