000010***********************************
000020* SCE6201-REORGANIZACAO DO ACE01  *
000030***********************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6201.
000060 COPY "\book\SELCE".
000070 COPY "\book\SELC-01".
000080      SELECT ACEAUX   ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE IS DYNAMIC
000110                      RECORD KEY IS CHAVE-AUX
000120                      ALTERNATE RECORD KEY IS DESC-AUX
000130                      WITH DUPLICATES
000140                      FILE STATUS IS FS.
000150 COPY "\book\FDCE".
000160 COPY "\book\FD-01".
000170 FD  ACEAUX
000180     LABEL RECORD IS STANDARD VALUE OF FILE-ID IS "ACEAUX".
000190 01  REG-AUX.
000200     03 CHAVE-AUX.
000210        04 COD-AUX     PIC X(06).
000220        04 COD-AUXR REDEFINES COD-AUX PIC 9(06).
000230     03 DESC-AUX       PIC X(40).
000240     03 UND-AUX        PIC X(04).
000250     03 LIVRO-AUX      PIC X.
000260     03 CLASSECE-AUX   PIC X.
000270     03 ESTMIN-AUX     PIC 9(07).
000280     03 ESTMIN-AUXR REDEFINES ESTMIN-AUX PIC 9(05)V99.
000290     03 QTPED-AUX      PIC 9(07).
000300     03 QTPED-AUXR REDEFINES QTPED-AUX PIC 9(05)V99.
000310     03 QTENT-AUX      PIC 9(07).
000320     03 QTENT-AUXR REDEFINES QTENT-AUX PIC 9(05)V99.
000330     03 QTSAIDAR-AUX OCCURS 12 TIMES.
000340        05 QTSAI-AUX   PIC 9(05).
000350        05 QTSAI-AUXR REDEFINES QTSAI-AUX PIC 9(03)V99.
000360     03 EST-AUX        PIC 9(07).
000370     03 EST-AUXR REDEFINES EST-AUX PIC 9(05)V99.
000380     03 DCUSTO-AUX.
000390        04 DIACUSTO-AUX PIC 99.
000400        04 MESCUSTO-AUX PIC 99.
000410        04 ANOCUSTO-AUX PIC 99.
000420     03 CONDPG-AUX     PIC 9(03).
000430     03 DATCAD-AUX.
000440        04 DIACAD-AUX  PIC 99.
000450        04 MESCAD-AUX  PIC 99.
000460        04 ANOCAD-AUX  PIC 99.
000470     03 DATNOV-AUX.
000480        04 MESNOV-AUX  PIC 99.
000490        04 ANONOV-AUX  PIC 99.
000500     03 CODTAB-AUX     PIC X(01).
000510     03 CONTOU-AUX     PIC X(01).
000520     03 CODFOR-AUX     PIC 9(04).
000530     03 CREAL-AUX      PIC 9(10).
000540     03 CREAL-AUXR REDEFINES CREAL-AUX PIC 9(08)V99.
000550     03 CMEDIO-AUX     PIC 9(10).
000560     03 CMEDIO-AUXR REDEFINES CMEDIO-AUX PIC 9(08)V99.
000570     03 PRATAC-AUX     PIC 9(10).
000580     03 PRATAC-AUXR REDEFINES PRATAC-AUX PIC 9(08)V99.
000590     03 PRVAR-AUX      PIC 9(10).
000600     03 PRVAR-AUXR REDEFINES PRVAR-AUX PIC 9(08)V99.
000610     03 VRPU-AUX       PIC 9(10).
000620     03 VRPU-AUXR REDEFINES VRPU-AUX PIC 9(08)V99.
000630     03 CATUAL-AUX     PIC 9(10).
000640     03 CATUAL-AUXR REDEFINES CATUAL-AUX PIC 9(08)V99.
000650     03 EMB-AUX        PIC 999.
000660     03 ARTIGO-AUX     PIC 9(06).
000670     03 DTCON-AUX.
000680        05 ACON-AUX    PIC 9(02).
000690        05 MCON-AUX    PIC 9(02).
000700        05 DCON-AUX    PIC 9(02).
000710     03 COD2-AUX       PIC X(11).
000720     03 CODTRI-AUX     PIC 9.
000730     03 DATINF-AUX.
000740        04 DIAINF-AUX  PIC 99.
000750        04 MESINF-AUX  PIC 99.
000760 COPY "\book\TAB-W".
000770*======================================
000780 COPY "\book\CPYPDCE".
000790 COPY "\book\CPYPDFS".
000800 R-0000.
000810     MOVE "TCE6201" TO TS.
000820     MOVE "REORGANIZACAO DO ARQUIVO - ACE01" TO INFT.
000830 COPY "\book\CPYTPCE".
000840     DISPLAY (08, 30) "REORGANIZACAO DO ACE01".
000850     DISPLAY (10, 30) "REORGANIZAR (S/<N>) [ ]".
000860     ACCEPT (10, 51) RESP WITH UPDATE.
000870     IF RESP NOT = "S"
000880        EXIT PROGRAM.
000890 R-0100.
000900     DISPLAY (22, 14) "ESTOU PROCESSANDO ARQUIVO AUXILIAR"
000910     OPEN INPUT  ACE01.
000920     OPEN OUTPUT ACEAUX.
000930     MOVE ZEROS TO CHAVE-01.
000940     START ACE01 KEY IS NOT LESS CHAVE-01 INVALID KEY
000950        DISPLAY (22, 14) "ARQUIVO ACE01 VAZIO"
000960        ACCEPT CR DISPLAY (22, 14) EX-MENS
000970        CLOSE ACEAUX ACE01 STOP RUN.
000980 R-0110.
000990     READ ACE01 NEXT RECORD AT END
001000        CLOSE ACE01 ACEAUX
001010        OPEN OUTPUT ACE01
001020        CLOSE ACE01
001030        GO TO R-0200.
001040     WRITE REG-AUX FROM REG-01 INVALID KEY
001050        DISPLAY (22, 14)
001060        "ERRO NA GRAVACAO ACEAUX " FS  "  ==>" COD-01
001070        ACCEPT CR DISPLAY (22, 14) EX-MENS.
001080     GO TO R-0110.
001090*===============================
001100 R-0200.
001110     DISPLAY (22, 14) EX-MENS.
001120     OPEN INPUT ACEAUX.
001130     IF FS NOT = "00"
001140        MOVE "MCE6201A" TO CODMENFS
001150        MOVE "ACEAUX" TO ARQFS
001160        PERFORM TESTA-FS THRU SAI-TESTA-FS
001170        CLOSE ACEAUX STOP RUN.
001180     OPEN I-O ACE01.
001190     IF FS NOT = "00"
001200        MOVE "MCE6201B" TO CODMENFS
001210         MOVE "ACE01" TO ARQFS
001220        PERFORM TESTA-FS THRU SAI-TESTA-FS
001230        CLOSE ACEAUX ACE01 STOP RUN.
001240 R-0300.
001250     READ ACEAUX NEXT RECORD AT END
001260         GO TO R-9999.
001270     MOVE COD-AUX     TO COD-01.
001280     MOVE DESC-AUX    TO DESC-01.
001290     MOVE UND-AUX    TO UND-01.
001300     MOVE LIVRO-AUX   TO LIVRO-01.
001310     MOVE CLASSECE-AUX  TO CLASSECE-01.
001320     IF EST-AUX NOT NUMERIC
001330        MOVE ZEROS TO EST-01
001340     ELSE
001350        MOVE EST-AUX TO EST-01.
001360     IF DCUSTO-AUX NOT NUMERIC
001370     IF ARTIGO-AUX NOT NUMERIC
001380        MOVE ZEROS    TO ARTIGO-01
001390     ELSE
001400        MOVE ARTIGO-AUX TO ARTIGO-01.
001410     MOVE COD2-AUX    TO COD2-01.
001420     IF ESTMIN-AUX NOT NUMERIC
001430        MOVE ZEROS TO ESTMIN-01
001440     ELSE
001450        MOVE ESTMIN-AUX TO ESTMIN-01.
001460     IF QTPED-AUX NOT NUMERIC
001470        MOVE ZEROS TO QTPED-01
001480     ELSE
001490        MOVE QTPED-AUX TO QTPED-01.
001500     IF QTENT-AUX NOT NUMERIC
001510        MOVE ZEROS TO QTENT-01
001520     ELSE
001530        MOVE QTENT-AUX TO QTENT-01.
001540     MOVE 1 TO IND1-W.
001550 R-0400.
001560     IF IND1-W > 12
001570        GO TO R-0500.
001580     IF QTSAI-AUX(IND1-W) NOT NUMERIC
001590        MOVE ZEROS TO QTSAI-01(IND1-W)
001600     ELSE
001610        MOVE QTSAI-AUX(IND1-W) TO QTSAI-01(IND1-W).
001620     ADD 1 TO IND1-W
001630     GO TO R-0400.
001640 R-0500.
001650     IF DCUSTO-AUX NOT NUMERIC
001660        MOVE ZEROS TO DCUSTO-01
001670     ELSE
001680        MOVE DCUSTO-AUX TO DCUSTO-01.
001690     IF CONDPG-AUX NOT NUMERIC
001700        MOVE ZEROS TO CONDPG-01
001710     ELSE
001720        MOVE CONDPG-AUX TO CONDPG-01.
001730     IF DATCAD-AUX NOT NUMERIC
001740        MOVE ZEROS TO DATCAD-01
001750     ELSE
001760        MOVE DATCAD-AUX TO DATCAD-01.
001770     IF DATNOV-AUX NOT NUMERIC
001780        MOVE ZEROS TO DATNOV-01
001790     ELSE
001800        MOVE DATNOV-AUX TO DATNOV-01.
001810     MOVE CODTAB-AUX TO CODTAB-01.
001820     IF CODFOR-AUX NOT NUMERIC
001830        MOVE ZEROS TO CODFOR-01
001840     ELSE
001850        MOVE CODFOR-AUX TO CODFOR-01.
001860     IF CREAL-AUX NOT NUMERIC
001870        MOVE ZEROS TO CREAL-01
001880     ELSE
001890        MOVE CREAL-AUX TO CREAL-01.
001900     IF CMEDIO-AUX NOT NUMERIC
001910        MOVE ZEROS TO CMEDIO-01
001920     ELSE
001930        MOVE CMEDIO-AUX TO CMEDIO-01.
001940     IF PRATAC-AUX NOT NUMERIC
001950        MOVE ZEROS TO PRATAC-01
001960     ELSE
001970        MOVE PRATAC-AUX TO PRATAC-01.
001980     IF PRVAR-AUX NOT NUMERIC
001990        MOVE ZEROS TO PRVAR-01
002000     ELSE
002010        MOVE PRVAR-AUX TO PRVAR-01.
002020     IF VRPU-AUX NOT NUMERIC
002030        MOVE ZEROS TO VRPU-01
002040     ELSE
002050        MOVE VRPU-AUX TO VRPU-01.
002060     IF CATUAL-AUX NOT NUMERIC
002070        MOVE ZEROS TO CATUAL-01
002080     ELSE
002090        MOVE CATUAL-AUX TO CATUAL-01.
002100     IF DATINF-AUX NOT NUMERIC
002110        MOVE ZEROS TO DATINF-01
002120     ELSE
002130        MOVE DATINF-AUX TO DATINF-01.
002140     IF EMB-AUX NOT NUMERIC
002150        MOVE ZEROS TO EMB-01
002160     ELSE
002170        MOVE EMB-AUX TO EMB-01.
002180     MOVE CONTOU-AUX TO CONTOU-01.
002190     MOVE ACON-AUX   TO ACON-01.
002200     MOVE MCON-AUX   TO MCON-01.
002210     MOVE DCON-AUX   TO DCON-01.
002220     MOVE ARTIGO-AUX TO ARTIGO-01.
002230     MOVE CODTRI-AUX TO CODTRI-01.
002240 R-0600.
002250     WRITE REG-01 INVALID KEY
002260        MOVE "MCE6201C" TO CODMENFS
002270        MOVE "ACE01" TO ARQFS
002280        PERFORM TESTA-FS THRU SAI-TESTA-FS.
002290     GO TO R-0300.
002300 R-9999.
002310     CLOSE ACEAUX ACE01.
002320     DISPLAY (22, 14) EX-MENS.
002330     EXIT PROGRAM.
002340*======================F=I================
