000010*************************************
000020*RELATORIO DE PRODUTOS SEM MOVIMENTO*
000030*************************************
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE7307.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-01".
000080 COPY "/dados1/book/SELC-02".
000090     SELECT REL       ASSIGN TO PRINTER
000100                      FILE STATUS IS FS.
000110 COPY "/dados1/book/FDCE".
000120 COPY "/dados1/book/FD-01".
000130 COPY "/dados1/book/FD-02".
000140 COPY "/dados1/book/FDREL132".
000150 COPY "/dados1/book/TAB-W".
000160 01  CAB2.
000170     05 FILLER        PIC X(45) VALUE
000180     "RELATORIO DE PRODUTOS SEM MOVIMENTO".
000190 01  CAB3.
000200     05 FILLER        PIC X(39) VALUE
000210     "CODIGO DESCRICAO DO PRODUTO".
000220     05 FILLER        PIC X(46) VALUE
000230     "DATA DEPOSITO LOJA 01 LOJA 02 LOJA 03 LOJA 04".
000240     05 FILLER        PIC X(47) VALUE
000250     "LOJA 05 LOJA 06 LOJA 07 LOJA 08 LOJA 09   TOTAL".
000260 01  CAB5.
000270     05 COD-5         PIC X(07) VALUE SPACES.
000280     05 DESC-5        PIC X(31) VALUE SPACES.
000290     05 FILLER        PIC X VALUE SPACES.
000300     05 M-5           PIC 99 VALUE ZEROS.
000310     05 FILLER        PIC X VALUE "/".
000320     05 A-5           PIC 99 VALUE ZEROS.
000330     05 LOJAS OCCURS 10 TIMES.
000340        07 QTSAI-5    PIC X(08).
000350     05 TGSAI-5       PIC X(08) VALUE SPACES.
000360 01  DADOS.
000370     02 EST-W         PIC 9(07) VALUE ZEROS.
000380     02 EST-WR REDEFINES EST-W PIC 9(05)V99.
000390     02 CODIGO-I      PIC X(06) VALUE SPACES.
000400     02 CODIGO-IR REDEFINES CODIGO-I PIC 9(06).
000410     02 CODIGO-F      PIC X(06) VALUE SPACES.
000420     02 CODIGO-FR REDEFINES CODIGO-F PIC 9(06).
000430     02 CODIGO-W      PIC X(06) VALUE SPACES.
000440     02 CODIGO-WR REDEFINES CODIGO-W  PIC 9(06).
000450     02 DATAB.
000460        03 AB         PIC 99 VALUE ZEROS.
000470        03 MB         PIC 99 VALUE ZEROS.
000480     02 DNOVW.
000490        03 ANW        PIC 99 VALUE ZEROS.
000500        03 MNW        PIC 99 VALUE ZEROS.
000510 01  EDI-INT          PIC ZZZ.ZZZ VALUE ZEROS.
000520 01  EDI-DEC          PIC ZZZZ,ZZ VALUE ZEROS.
000530 COPY "/dados1/book/CPYPDCE".
000540 COPY "/dados1/book/CPYPDFS".
000550 R-0000.
000560 COPY "/dados1/book/PDIMP".
000570     OPEN INPUT ACE01.
000580     IF FS NOT = "00"
000590        MOVE "MCE7307A" TO CODMENFS
000600        MOVE "ACE01" TO ARQFS
000610        PERFORM TESTA-FS THRU SAI-TESTA-FS
000620        CLOSE ACE01 STOP RUN.
000630     OPEN INPUT ACE02.
000640     IF FS NOT = "00"
000650        MOVE "MCE7307B" TO CODMENFS
000660        MOVE "ACE02" TO ARQFS
000670        PERFORM TESTA-FS THRU SAI-TESTA-FS
000680        CLOSE ACE01 ACE02 STOP RUN.
000690     OPEN OUTPUT REL.
000700     IF FS NOT = "00"
000710        MOVE "MCE7307C" TO CODMENFS
000720        MOVE "RELATO" TO ARQFS
000730        PERFORM TESTA-FS THRU SAI-TESTA-FS
000740        CLOSE ACE01 ACE02 REL STOP RUN.
000750     MOVE "RELATORIO DE PRODUTOS SEM MOVIMENTO" TO INFT.
000760     MOVE "TCE7307" TO TS.
000770     MOVE "RCE7307" TO NOME-RELA.
000780 R-0100.
000790     MOVE ALL ZEROS TO DADOS.
000800 COPY "/dados1/book/CPYTPCE".
000810     DISPLAY (06, 23) "CODIGO INICIAL.:".
000820     DISPLAY (08, 23) "CODIGO FINAL...:".
000830     DISPLAY (10, 23) "DATA BASE M/A..:../..".
000840 R-0200.
000850     MOVE SPACES TO CODIGO-I.
000860     ACCEPT (06, 39) CODIGO-I WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000870     IF E = "01"
000880        GO TO R-9999.
000890 R-0300.
000900     MOVE SPACES TO CODIGO-F.
000910     ACCEPT (08, 39) CODIGO-F WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000920     IF E = "01" GO TO R-0200.
000930 R-0400.
000940     MOVE ZEROS TO MB.
000950     ACCEPT (10, 39) MB WITH UPDATE
000960        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
000970     IF E = "01" GO TO R-0300.
000980     IF MB = ZEROS OR > 12 GO TO R-0400.
000990 R-0500.
001000     MOVE ZEROS TO AB.
001010     ACCEPT (10, 42) AB WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001020     IF E = "01" GO TO R-0400.
001030     IF AB = ZEROS GO TO R-0400.
001040 R-0600.
001050     MOVE SPACES TO RESP.
001060     DISPLAY (12, 23) "IMPRIMIR <<S>N>:".
001070     ACCEPT (12, 39) RESP WITH UPDATE.
001080     IF RESP = "N" GO TO R-0100.
001090 R-0700.
001100     DISPLAY (12, 23) "I M P R I M I N D O ".
001110     MOVE CODIGO-I TO COD-01.
001120     START ACE01 KEY IS NOT < CHAVE-01 INVALID KEY
001130         GO TO R-9999.
001140 R-0800.
001150     READ ACE01 NEXT RECORD AT  END
001160         GO TO R-9999.
001170     MOVE ANONOV-01 TO ANW.
001180     MOVE MESNOV-01 TO MNW.
001190     IF DNOVW > DATAB GO TO R-0800.
001200     MOVE COD-01 TO CODIGO-W.
001210     IF CODIGO-WR > CODIGO-FR
001220        GO TO R-9999.
001230     MOVE COD-01    TO COD-5.
001240     MOVE DESC-01   TO DESC-5.
001250     IF DECIMAL-EMPCE = "S"
001260        MOVE EST-01R TO EDI-DEC
001270        MOVE ED-DEC  TO QTSAI-5(01)
001280     ELSE
001290        MOVE EST-01  TO EDI-INT
001300        MOVE ED-INT  TO QTSAI-5(01).
001310     MOVE MESNOV-01  TO M-5.
001320     MOVE ANONOV-01  TO A-5.
001330     MOVE EST-01     TO EST-W.
001340     MOVE 0 TO IND1-W.
001350     MOVE 1 TO IND2-W.
001360 R-0900.
001370     ADD 1 TO IND1-W IND2-W.
001380     IF IND1-W > 9 GO TO R-1000.
001390     MOVE COD-01 TO COD-02.
001400     MOVE IND1-W TO LOJA-02.
001410     READ ACE02 INVALID KEY
001420        MOVE ZEROS TO QTLOJ-02.
001430     IF DECIMAL-EMPCE = "S"
001440        MOVE QTLOJ-02R TO EDI-DEC
001450        MOVE ED-DEC TO QTSAI-5(IND2-W)
001460     ELSE
001470        MOVE QTLOJ-02  TO EDI-INT
001480        MOVE ED-INT TO QTSAI-5(IND2-W).
001490     ADD QTLOJ-02 TO EST-W.
001500     GO TO R-0900.
001510 R-1000.
001520     IF EST-W NOT = ZEROS GO TO R-0800.
001530     IF CTL > 57
001540        ADD 1 TO CTP
001550        MOVE CTP TO PAG-CAB1A
001560        WRITE REG-REL FROM CAB1A AFTER PAGE
001570        WRITE REG-REL FROM CAB2A AFTER 1
001580        WRITE REG-REL FROM CAB132 AFTER 1
001590        WRITE REG-REL FROM CAB2 AFTER 1
001600        WRITE REG-REL FROM CAB132 AFTER 1
001610        WRITE REG-REL FROM CAB3 AFTER 2
001620        MOVE 8 TO CTL.
001630     IF DECIMAL-EMPCE = "S"
001640        MOVE EST-WR TO EDI-DEC
001650        MOVE ED-DEC TO TGSAI-5
001660     ELSE
001670        MOVE EST-W  TO EDI-INT
001680        MOVE ED-INT TO TGSAI-5.
001690     WRITE REG-REL FROM CAB5 AFTER 2
001700     ADD 3 TO CTL.
001710     GO TO R-0800.
001720 R-9999.
001730     CLOSE ACE01 ACE02 REL.
001740     EXIT PROGRAM.
001750*-------------F-I-M----------------
