000010*=======================================*
000020*SCE7304-PLANILHA PARA ATERACAO DE PRECO*
000030*=======================================*
000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE7304.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-01".
000080     SELECT RELATO    ASSIGN TO PRINTER
000090                      FILE STATUS IS FS.
000100 COPY "/dados1/book/FDCE".
000110 COPY "/dados1/book/FD-01".
000120 COPY "/dados1/book/FDREL80".
000130 COPY "/dados1/book/TAB-W".
000140 01  CAB1.
000150     05 FILLER          PIC X(20) VALUE SPACES.
000160     05 FILLER          PIC X(35) VALUE
000170     "RELATORIO DE CODIGOS DISPONIVEIS".
000180 01  CAB2.
000190     05 FILLER          PIC X(16) VALUE " CODIGO   ".
000200     05 FILLER          PIC X(21) VALUE "PRECO DE VENDA".
000210     05 FILLER          PIC X(12) VALUE "PAG.".
000220     05 FILLER          PIC X(10) VALUE "SEQU.".
000230     05 FILLER          PIC X(14) VALUE "DATA/ALTERACAO".
000240 01  CAB3.
000250     05 FILLER          PIC X VALUE '!'.
000260     05 COD-CAB3        PIC 9(06) VALUE ZEROS.
000270     05 FILLER          PIC X(08) VALUE '!'.
000280     05 FILLER          PIC X(21) VALUE '!             !'.
000290     05 FILLER          PIC X(12) VALUE '!    !'.
000300     05 FILLER          PIC X(11) VALUE '!     !'.
000310     05 FILLER          PIC X(16) VALUE '!    /    /    !'.
000320 COPY "/dados1/book/CPYPDCE".
000330 COPY "/dados1/book/CPYPDFS".
000340 R-0000.
000350 COPY "/dados1/book/PDIMP".
000360     OPEN INPUT ACE01.
000370     IF FS NOT = "00"
000380        MOVE "MCE7304A" TO CODMENFS
000390        MOVE "ACE01" TO ARQFS
000400        PERFORM TESTA-FS THRU SAI-TESTA-FS
000410        CLOSE ACE01 STOP RUN.
000420     OPEN OUTPUT RELATO.
000430     IF FS NOT = "00"
000440        MOVE "MCE7304B" TO CODMENFS
000450        MOVE "RELATO" TO ARQFS
000460        PERFORM TESTA-FS THRU SAI-TESTA-FS
000470        CLOSE ACE01 RELATO STOP RUN.
000480     MOVE "TCE7304" TO TS.
000490     MOVE "RELATORIOS DE CODIGOS DISPONIVEIS" TO INFT.
000500 R-0100.
000510 COPY "/dados1/book/CPYTPCE".
000520     DISPLAY (07, 30) "IMPRIMIR (S<N>)".
000530     ACCEPT (07, 46) RESP WITH UPDATE.
000540     IF RESP NOT = "S" GO TO R-9999.
000550     MOVE ZEROS TO CTP.
000560     MOVE 70 TO CTL.
000570     DISPLAY (07, 30) "I M P R I M I N D O ".
000580 R-0200.
000590     READ ACE01 NEXT RECORD AT END GO TO R-9999.
000600     IF DESC-01 NOT = SPACES
000610         GO TO R-0200.
000620 R-0300.
000630     MOVE COD-01 TO  COD-CAB3.
000640     IF CTL > 58
000650        ADD 1 TO CTP
000660        MOVE CTP TO PAG-CAB1B
000670        WRITE REG-RELATO FROM CAB1B AFTER PAGE
000680        MOVE "RCE7304" TO NOME-RELB
000690        WRITE REG-RELATO FROM CAB2B AFTER 1
000700        WRITE REG-RELATO FROM CAB132 AFTER 1
000710        WRITE REG-RELATO FROM CAB1 AFTER 1
000720        WRITE REG-RELATO FROM CAB132 AFTER 1
000730        WRITE REG-RELATO FROM CAB2 AFTER 2
000740        MOVE 6 TO CTL.
000750     WRITE REG-RELATO FROM CAB3 AFTER 2.
000760     ADD 2 TO CTL.
000770     GO TO R-0200.
000780 R-9999.
000790     CLOSE ACE01 RELATO.
000800     EXIT PROGRAM.
000810*------------------F-I-M-------------
