000010*******************************************************
000020*SCE0000-GERENCIADOR DO SISTEMA / CONTROLE DE ESTOQUE *
000030*******************************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE0000.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/FDCE".
000080 COPY "/dados1/book/TAB-W".
000090 01  SENHA-W          PIC X(08) VALUE SPACES.
000100 01  LIMPA-1            PIC X(70) VALUE SPACES.
000110 01  EMP              PIC 99.
000120 01  EMP-R REDEFINES EMP PIC XX.
000130 01  EMP-1            PIC X(22).
000140 01  ARQCE-00.
000150     05 FILLER  PIC X(21) VALUE "/Dados2/arquivos/ace/".
000160     05 FILLER  PIC X(05) VALUE "EMPCE".
000170     05 COMP-00 PIC 99.
000180 01  PARAM-W.
000190     05 PROG-W        PIC X(8).
000200     05 PW-W          PIC X(4).
000210     05 ARG-W         PIC 9(6).
000220     05 FILLER REDEFINES ARG-W.
000230        07 FILLER     PIC X(4).
000240        07 COMP-W     PIC 99.
000250 COPY "/dados1/book/TELASIS".
000260 PROCEDURE DIVISION.
000270 R-0000.
000280     ACCEPT DATA-W FROM DATE.
000290     ACCEPT HORA-W FROM TIME.
000300 COPY "/dados1/book/MOLDURA".
000310     DISPLAY (02, 23) " C O N T R O L E  D E  E S T O Q U E".
000320     MOVE "TCE0000" TO TS.
000330     MOVE "*** M E N U  G E R A L ***" TO INFT.
000340     DISPLAY (02, 75) COD-EMPCE.
000350     DISPLAY (04, 04) TS.
000360     DISPLAY (04, 24) INFT.
000370 R-0100.
000380     DISPLAY (06, 27) "EMPRESA: ".
000390     ACCEPT (06, 36) EMP WITH UPDATE AUTO-SKIP.
000400
           ACCEPT E FROM ESCAPE KEY.
000410     IF E = "01"
000420        OR EMP = ZEROS
000430        DISPLAY (01, 01) ERASE STOP RUN.
000440     MOVE EMP TO ARG-W COMP-00.
000450     OPEN I-O EMPCE.
000460     IF FS NOT = "00"
000470        DISPLAY (22, 14) "MCE000A EMPCE NAO EXISTE FS " FS
000480        ACCEPT (22, 78) CR WITH UPDATE
000490        DISPLAY (22, 14) EX-MENS
000500        CLOSE EMPCE GO TO R-0100.
000510     MOVE EMP TO COD-EMPCE.
000520     READ EMPCE INVALID KEY
000530        DISPLAY (22, 14) "EMPRESA NAO ENCONTRADA-REDIGITE"
000540        ACCEPT (22, 78) CR WITH UPDATE
000550        DISPLAY (22, 14) EX-MENS
000560        CLOSE EMPCE GO TO R-0100.
           MOVE 1 TO REFCI-EMPCE
           REWRITE REG-EMPCE.
000570     CLOSE EMPCE.
000580     DISPLAY (06, 39) DESC-EMPCE.
000590 R-0200.
000600     DISPLAY (08, 27) "OPCOES:"
000610     DISPLAY (09, 34) "M- MANUTENCAO"
000620     DISPLAY (10, 34) "B- BAIXA"
000630     DISPLAY (11, 34) "R- REPOSICAO"
000640     DISPLAY (12, 34) "E- ENTRADA"
000650     DISPLAY (13, 34) "P- PEDIDO"
000660     DISPLAY (14, 34) "U- UTILITARIOS"
000670     DISPLAY (15, 34) "L- LISTAGEM".
000680     DISPLAY (18, 33) "[ ] - OPCAO DESEJADA".
000690     ACCEPT (18, 34) OPCAO WITH UPDATE.
000700     ACCEPT E FROM ESCAPE KEY.
000710     IF E = "01"
000720        OR OPCAO = ZEROS
000730        DISPLAY (06, 39) EX-MENS
000740        GO TO R-0100.
000750     IF OPCAO = "M" GO TO ROT-M.
000760     IF OPCAO = "B" GO TO ROT-B.
000770     IF OPCAO = "R" GO TO ROT-REL.
000780     IF OPCAO = "E" GO TO ROT-E.
000790     IF OPCAO = "P" GO TO ROT-P.
000800     IF OPCAO = "U" GO TO ROT-U.
000810     IF OPCAO = "L" GO TO ROT-L.
000820     GO TO R-0200.
000830 ROT-M.
000840     DISPLAY (01, 01) ERASE.
000850 COPY "/dados1/book/MOLDURA".
000860     MOVE "TCE0000A" TO TS.
000870     MOVE "MANUTENCAO DE CADASTROS" TO INFT.
000880     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
000890     DISPLAY (02, 75) COD-EMPCE.
000900     DISPLAY (04, 01) LIMPA-1.    
000910     DISPLAY (04, 04) TS.
000920     DISPLAY (04, 23) INFT.
000930     DISPLAY (22, 14) EX-MENS.
000940     DISPLAY (02, 14) HH-W ":" MS-W.
000950     DISPLAY (06, 02) "01-L O J A".
000960     DISPLAY (07, 02) "02-ESTOQUE NA EMPRESA".
000970     DISPLAY (08, 02) "03-ESTOQUE NA LOJA".
000980     DISPLAY (09, 02) "04-FORNECEDOR".
000990     DISPLAY (10, 02) "05-PRAZOS E JUROS".
001000     DISPLAY (11, 02) "06-VENDEDOR".
001010     DISPLAY (12, 02) "07-ENTRADA DE MERC.E DESPESAS".
001020     DISPLAY (13, 02) "08-ALTERA MOVIMENTO DE BAIXA".
001030     DISPLAY (14, 02) "09-ALTERACAO DE ESTOQUE(LOJA/EMPRESA)".
001040     DISPLAY (15, 02) "10-MANUTENCAO NOTA FISCAL ENTRADA".
001050     DISPLAY (06, 41) "11-MANUTENCAO TRANSPORTADORAS".
001060     DISPLAY (07, 41) "12-MANUTENCAO DIFERENCA DE VENDAS".
001070     DISPLAY (08, 41) "13-MANUTENCAO BALANCO DE ESTOQUE".
001080     DISPLAY (09, 41) "14-MANUTENCAO CENTRO DE CUSTOS".
001090     DISPLAY (10, 41) "15-MANUTENCAO RESPONSAVEIS".
001100     DISPLAY (11, 41) "16-MANUTENCAO DE INDICES ".
001110     DISPLAY (12, 41) "17-MANUTENCAO CODIGOS CORRESPONDENTES".
001110     DISPLAY (13, 41) "18-MANUTENCAO CODIGOS X COD FORNECEDOR".
001120 R-0300.
001130     DISPLAY (22, 28) "[  ]- OPCAO DESEJADA".
001140     ACCEPT (22, 29) OPCAO-2 WITH UPDATE.
001150     ACCEPT E FROM ESCAPE KEY.
001160     IF E = "01"
001170        OR OPCAO-2 = ZEROS
001180        DISPLAY (06, 39) EX-MENS
001190        GO TO R-0000.
001200     IF OPCAO-2 = 1
001210        MOVE "OCE1101"      TO PROG-W PERFORM CHAMA-PROG.
001220     IF OPCAO-2 = 2
001230        MOVE "OCE1201"      TO PROG-W PERFORM CHAMA-PROG.
001240     IF OPCAO-2 = 3
001250        MOVE "OCE1301"      TO PROG-W PERFORM CHAMA-PROG.
001260     IF OPCAO-2 = 4
001270        MOVE "OCE1401"      TO PROG-W PERFORM CHAMA-PROG.
001280     IF OPCAO-2 = 5
001290        MOVE "OCE1501"      TO PROG-W PERFORM CHAMA-PROG.
001300     IF OPCAO-2 = 6
001310        MOVE "OCE1601"      TO PROG-W PERFORM CHAMA-PROG.
001320     IF OPCAO-2 = 7
001330        MOVE "OCE1701"      TO PROG-W PERFORM CHAMA-PROG.
001340     IF OPCAO-2 = 8
001350        MOVE "OCE1801"      TO PROG-W PERFORM CHAMA-PROG.
001360     IF OPCAO-2 = 9
001370        MOVE "OCE1901"      TO PROG-W PERFORM CHAMA-PROG.
001380     IF OPCAO-2 = 10
001390        MOVE "OCE1902"      TO PROG-W PERFORM CHAMA-PROG.
001400     IF OPCAO-2 = 11
001410        MOVE "OCE1903"      TO PROG-W PERFORM CHAMA-PROG.
001420     IF OPCAO-2 = 12
001430        MOVE "OCE1904"      TO PROG-W PERFORM CHAMA-PROG.
001440     IF OPCAO-2 = 13
001450        MOVE "OCE1905"      TO PROG-W PERFORM CHAMA-PROG.
001460     IF OPCAO-2 = 14
001470        MOVE "OCE1906"      TO PROG-W PERFORM CHAMA-PROG.
001480     IF OPCAO-2 = 15
001490        MOVE "OCE1907"      TO PROG-W PERFORM CHAMA-PROG.
001500     IF OPCAO-2 = 16
001510        MOVE "OCE1908"      TO PROG-W PERFORM CHAMA-PROG.
001520     IF OPCAO-2 = 17
001530        MOVE "OCE1909"      TO PROG-W PERFORM CHAMA-PROG.
001520     IF OPCAO-2 = 18
001530        MOVE "OCE1302"      TO PROG-W PERFORM CHAMA-PROG.
001540     GO TO ROT-M.
001550 ROT-B.
001560     DISPLAY (01, 01) ERASE.
001570 COPY "/dados1/book/MOLDURA".
001580     MOVE "TCE0000B" TO TS.
001590     MOVE "* OPCOES ***** B A I X AS " TO INFT.
001600     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
001610     DISPLAY (02, 75) COD-EMPCE.
001620     DISPLAY (04, 01) LIMPA-1.    
001630     DISPLAY (04, 04) TS.
001640     DISPLAY (04, 23) INFT.
001650     DISPLAY (22, 14) EX-MENS.
001660     DISPLAY (02, 14) HH-W ":" MS-W.
001670     DISPLAY (06, 30) "1- GRAVACAO".
001680     DISPLAY (07, 30) "2- ATUALIZACAO".
001690     DISPLAY (08, 30) "3- PESQUISA".
001700     DISPLAY (09, 30) "4- EXCLUSAO".
001710     DISPLAY (10, 30) "5- LISTAGEM".
001720     DISPLAY (11, 30) "6- RELATORIO DE CONCILIACAO".
001730     DISPLAY (12, 30)
001740     "7- RELATORIO DE VENDAS NO MES/SUGESTAO DE COMPRAS".
001750     DISPLAY (13, 30)
001760     "8- RELATORIO ESTOQUE,VENDA E DIFERANCA ENTRE ELES".
001770     DISPLAY (14, 30) "9- REQUISICAO E NOTA FISCAL".
001780     DISPLAY (15, 29) "10- RELATORIO DE LOTES ATUALIZADOS".
001790     DISPLAY (16, 29)
001800     "11- RELATORIO DE SAIDAS NO MES P/SETOR".
001810     DISPLAY (17, 29) "12- CONSISTENCIA RAZAO DE ESTOQUE".
001820     DISPLAY (18, 29) "13- EMISSAO DE NOTA FISCAL DE VENDA".
001830     DISPLAY (19, 29) "14- MANUTENCAO DO ARQUIVO DE SAIDAS".
001840     DISPLAY (20, 29) "15- CONSISTENCIA DO ACE21 - SERIE O".
001850 R-0400.
001860     DISPLAY (22, 29) "<  >- OPCAO DESEJADA".
001870     ACCEPT (22, 30) OPCAO-2 WITH UPDATE.
001880     ACCEPT E FROM ESCAPE KEY.
001890     IF E = "01"
001900        OR OPCAO-2 = ZEROS
001910        DISPLAY (06, 39) EX-MENS
001920        GO TO R-0000.
001930     IF OPCAO-2 = 1
001940        MOVE "OCE2101"      TO PROG-W PERFORM CHAMA-PROG.
001950     IF OPCAO-2 = 2
001960        MOVE "OCE2201"      TO PROG-W PERFORM CHAMA-PROG.
001970     IF OPCAO-2 = 3
001980        MOVE "OCE2301"      TO PROG-W PERFORM CHAMA-PROG.
001990     IF OPCAO-2 = 4
002000        MOVE "OCE2401"      TO PROG-W PERFORM CHAMA-PROG.
002010     IF OPCAO-2 = 5
002020        MOVE "OCE2501"      TO PROG-W PERFORM CHAMA-PROG.
002030     IF OPCAO-2 = 6
002040        MOVE "OCE2601"      TO PROG-W PERFORM CHAMA-PROG.
002050     IF OPCAO-2 = 7
002060        MOVE "OCE2701"      TO PROG-W PERFORM CHAMA-PROG.
002070     IF OPCAO-2 = 8
002080        MOVE "OCE2801"      TO PROG-W PERFORM CHAMA-PROG.
002090     IF OPCAO-2 = 9
002100        MOVE "OCE2901"      TO PROG-W PERFORM CHAMA-PROG.
002110     IF OPCAO-2 = 10
002120        MOVE "OCE2902"      TO PROG-W PERFORM CHAMA-PROG.
002130     IF OPCAO-2 = 11
002140        MOVE "OCE2903"      TO PROG-W PERFORM CHAMA-PROG.
002150     IF OPCAO-2 = 12
002160        MOVE "OCE2904"      TO PROG-W PERFORM CHAMA-PROG.
002170     IF OPCAO-2 = 13
002180        MOVE "OCE2905"      TO PROG-W PERFORM CHAMA-PROG.
002190     IF OPCAO-2 = 14
002200        MOVE "OCE2906"      TO PROG-W PERFORM CHAMA-PROG.
002210     IF OPCAO-2 = 15
002220        MOVE "OCE2907"      TO PROG-W PERFORM CHAMA-PROG.
002230     GO TO ROT-B.
002240 ROT-REL.
002250     DISPLAY (01, 01) ERASE.
002260 COPY "/dados1/book/MOLDURA".
002270     MOVE "TCE0000C" TO TS.
002280     MOVE "* * * *  O  P  C  O  E  S  * * * * " TO INFT.
002290     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
002300     DISPLAY (02, 75) COD-EMPCE.
002310     DISPLAY (04, 01) LIMPA-1.    
002320     DISPLAY (04, 04) TS.
002330     DISPLAY (04, 23) INFT.
002340     DISPLAY (22, 14) EX-MENS.
002350     DISPLAY (02, 14) HH-W ":" MS-W.
002360     DISPLAY (06, 27) "REPOSICAO:"
002370     DISPLAY (08, 30) "1- LANCAMENTO DE REPOSICAO".
002380     DISPLAY (10, 30) "2- RELATORIO DE REPOSICAO".
002390     DISPLAY (12, 30) "3- NOTA FISCAL DE REPOSICAO".
002400     DISPLAY (14, 30) "4- REPOSICAO LOJA A LOJA".
002410     DISPLAY (16, 30) "5- LISTAGEM TRANSFERENCIA".
002420 R-0500.
002430     DISPLAY (18, 29) "< >- OPCAO DESEJADA".
002440     ACCEPT (18, 30) OPCAO-1 WITH UPDATE.
002450     ACCEPT E FROM ESCAPE KEY.
002460     IF E = "01"
002470        OR OPCAO-1 = ZEROS
002480        DISPLAY (06, 39) EX-MENS
002490        GO TO R-0000.
002500     IF OPCAO-1 = 1
002510        MOVE "OCE3101"      TO PROG-W PERFORM CHAMA-PROG.
002520     IF OPCAO-1 = 2
002530        MOVE "OCE3201"      TO PROG-W PERFORM CHAMA-PROG.
002540     IF OPCAO-1 = 3
002550        MOVE "OCE3301"      TO PROG-W PERFORM CHAMA-PROG.
002560     IF OPCAO-1 = 4
002570        MOVE "OCE3401"      TO PROG-W PERFORM CHAMA-PROG.
002580     IF OPCAO-1 = 5
002590        MOVE "OCE3501"      TO PROG-W PERFORM CHAMA-PROG.
002600     GO TO ROT-REL.
002610 ROT-E.
002620     DISPLAY (01, 01) ERASE.
002630 COPY "/dados1/book/MOLDURA".
002640     MOVE "TCE0000D" TO TS.
002650     MOVE  "* * * *  O  P  C  O  E  S  * * * *" TO INFT.
002660     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
002670     DISPLAY (02, 75) COD-EMPCE.
002680     DISPLAY (04, 01) LIMPA-1.    
002690     DISPLAY (04, 04) TS.
002700     DISPLAY (04, 23) INFT.
002710     DISPLAY (22, 14) EX-MENS.
002720     DISPLAY (02, 14) HH-W ":" MS-W.
002730     DISPLAY (06, 27) "ENTRADA:"
002740     DISPLAY (08, 30) "1- GRAVACAO".
002750     DISPLAY (10, 30)
002760     "2- RELATORIO DE ENTRADA DE MERCADORIA".
002770 R-0600.
002780     DISPLAY (12, 29) "< >- OPCAO DESEJADA".
002790     ACCEPT (12, 30) OPCAO-1 WITH UPDATE.
002800     ACCEPT E FROM ESCAPE KEY.
002810     IF E = "01"
002820        OR OPCAO-1 = ZEROS
002830        DISPLAY (06, 39) EX-MENS
002840        GO TO R-0000.
002850     IF OPCAO-1 = 1
002860        MOVE "OCE4101"      TO PROG-W PERFORM CHAMA-PROG.
002870     IF OPCAO-1 = 2
002880        MOVE "OCE4201"      TO PROG-W PERFORM CHAMA-PROG.
002890     GO TO ROT-E.
002900 ROT-P.
002910     DISPLAY (01, 01) ERASE.
002920 COPY "/dados1/book/MOLDURA".
002930     MOVE "TCE0000E" TO TS.
002940     MOVE "* * * *  O  P  C  O  E  S  * * * *" TO INFT.
002950     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
002960     DISPLAY (02, 75) COD-EMPCE.
002970     DISPLAY (04, 01) LIMPA-1.    
002980     DISPLAY (04, 04) TS.
002990     DISPLAY (04, 23) INFT.
003000     DISPLAY (22, 14) EX-MENS.
003010     DISPLAY (02, 14) HH-W ":" MS-W.
003020     DISPLAY (06, 27) "PEDIDO:"
003030     DISPLAY (08, 30) "1- MANUTENCAO PEDIDOS-COMPRA".
003040     DISPLAY (10, 30) "2- MANUTENCAO PEDIDOS-VENDA".
003050     DISPLAY (12, 30) "3- MANUTENCAO PEDIDOS-FAX  ".
003060     DISPLAY (14, 29) "< >- OPCAO DESEJADA".
003070 R-0700.
003080     ACCEPT (14, 30) OPCAO-1 WITH UPDATE.
003090     ACCEPT E FROM ESCAPE KEY.
003100     IF E = "01"
003110        OR OPCAO-1 = ZEROS
003120        DISPLAY (06, 39) EX-MENS
003130        GO TO R-0000.
003140     IF OPCAO-1 = 1
003150        MOVE "OCE5101"      TO PROG-W PERFORM CHAMA-PROG.
003160     IF OPCAO-1 = 2
003170        MOVE "OCE5201"      TO PROG-W PERFORM CHAMA-PROG.
003180     IF OPCAO-1 = 3
003190        MOVE "OCE5301"      TO PROG-W PERFORM CHAMA-PROG.
003200     GO TO ROT-P.
003210 ROT-U.
003220     DISPLAY (01, 01) ERASE.
003230 COPY "/dados1/book/MOLDURA".
003240     MOVE "TCE0000F" TO TS.
003250     MOVE "* * * *  O  P  C  O  E  S  * * * *" TO INFT.
003260     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
003270     DISPLAY (02, 75) COD-EMPCE.
003280     DISPLAY (04, 01) LIMPA-1.    
003290     DISPLAY (04, 04) TS.
003300     DISPLAY (04, 23) INFT.
003310     DISPLAY (22, 14) EX-MENS.
003320     DISPLAY (02, 14) HH-W ":" MS-W.
003330     DISPLAY (06, 23) "U T I L I T A R I O S".
003340     DISPLAY (07, 23) " 1- INICIALIZACAO".
003350     DISPLAY (08, 23) " 2- REORGANIZACAO".
003360     DISPLAY (09, 23)
003370     " 3- PREPARACAO P/DIGITACAO DE MOVIMENTO DE BAIXAS".
003380     DISPLAY (10, 23) " 4- INFLACIONAR PRECO DE CUSTO REAL".
003390     DISPLAY (11, 23) " 5- ZERAR ACUMULADORES".
003400     DISPLAY (12, 23) " 6- DELETA PRODUTOS COM ESTOQUE ZERO".
003410     DISPLAY (13, 23)
003420     " 7- ALTERACAO DE PRECO P/VARIACAO DO INDICE + PERCENTUAL".
003430     DISPLAY (14, 23) " 8- ESTORNO DE BAIXAS ATUALIZADAS".
003440     DISPLAY (15, 23)
003450     "9- ACUMULA COMISSAO DE VENDEDOR SOBRE VENDA"
003460     DISPLAY (16, 23) "10- MANUTENCAO DE SENHAS".
003470     DISPLAY (17, 23)
003480      "11- ALTERACAO DE PRECO DE VAREJO P/FORNECEDOR".
003490     DISPLAY (18, 23) "12- SEQUENCIA ARQUIVOS".
003500     DISPLAY (19, 23) "13- REINDEXA ARQUIVOS".
003470     DISPLAY (20, 23)
003480      "14- RELATORIO DE VENDAS ACUMULADO P/SETOR    ".
003510 R-0800.
003520     DISPLAY (22, 23) "<  >- OPCAO DESEJADA".
003530     ACCEPT (22, 24) OPCAO-2 WITH UPDATE.
003540     ACCEPT E FROM ESCAPE KEY.
003550     IF E = "01"
003560        OR OPCAO-2 = ZEROS
003570        DISPLAY (06, 39) EX-MENS
003580        GO TO R-0000.
003590     IF OPCAO-2 = 1         GO TO ROT-I.
003600     IF OPCAO-2 = 2         GO TO ROT-REO.
003610     IF OPCAO-2 = 3
003620        MOVE "OCE6301"      TO PROG-W PERFORM CHAMA-PROG.
003630     IF OPCAO-2 = 4
003640        MOVE "OCE6401"      TO PROG-W PERFORM CHAMA-PROG.
003650     IF OPCAO-2 = 5
003660        MOVE "OCE6501"      TO PROG-W PERFORM CHAMA-PROG.
003670     IF OPCAO-2 = 6
003680        MOVE "OCE6601"      TO PROG-W PERFORM CHAMA-PROG.
003690     IF OPCAO-2 = 7
003700        MOVE "OCE6701"      TO PROG-W PERFORM CHAMA-PROG.
003710     IF OPCAO-2 = 8
003720        MOVE "OCE6801"      TO PROG-W PERFORM CHAMA-PROG.
003730     IF OPCAO-2 = 9
003740        MOVE "OCE6901"      TO PROG-W PERFORM CHAMA-PROG.
003750     IF OPCAO-2 = 10
003760        MOVE "OCE6902"      TO PROG-W PERFORM CHAMA-PROG.
003770     IF OPCAO-2 = 11
003780        MOVE "OCE6903"      TO PROG-W PERFORM CHAMA-PROG.
002210     IF OPCAO-2 = 14
002220        MOVE "OCE6802"      TO PROG-W PERFORM CHAMA-PROG.
003790     IF OPCAO-2 = 12 GO TO ROT-U1.
003800     IF OPCAO-2 = 13 GO TO ROT-U2.
003810     GO TO ROT-U.
003820 ROT-U1.
003830     DISPLAY (01, 01) ERASE.
003840 COPY "/dados1/book/MOLDURA".
003850     MOVE "TCE0000H" TO TS.
003860     MOVE "* * * *  O  P  C  O  E  S  * * * *" TO INFT.
003870     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
003880     DISPLAY (02, 75) COD-EMPCE.
003890     DISPLAY (02, 75) COD-EMPCE.
003900     DISPLAY (04, 01) LIMPA-1.    
003910     DISPLAY (04, 04) TS.
003920     DISPLAY (04, 23) INFT.
003930     DISPLAY (22, 14) EX-MENS.
003940     DISPLAY (02, 14) HH-W ":" MS-W.
003950     DISPLAY (06, 27) "SEQUENCIA:".
003960 R-0900.
003970     DISPLAY (07, 01) " 1- ACE01 PRODUTO NA EMPRESA".
003980     DISPLAY (07, 39) " 2- ACE02 PRODUTO NA LOJA".
003990     DISPLAY (08, 01) " 3- ACE03 MOVIMENTO P/REPOSICAO".
004000     DISPLAY (08, 39) " 4- ACE04 MOVIMENTO DE BAIXA".
004010     DISPLAY (09, 01) " 5- ACE05 CAD. DE LOJA".
004020     DISPLAY (09, 39) " 6- ACE06 CAD. DE COMPRAS".
004030     DISPLAY (10, 01) " 7- ACE07 CAD. DE FORNECEDOR".
004040     DISPLAY (10, 39) " 8- ACE08 ENTRADA DE MERCADORIA".
004050     DISPLAY (11, 01) " 9- ACE09 TITULOS DA LISTA".
004060     DISPLAY (11, 39) "10- ACE10 ITENS DA LISTA DE PRECO".
004070     DISPLAY (12, 01) "11- ACE11 ALTERACAO DE PRECOS".
004080     DISPLAY (12, 39) "12- ACE12 REPOSICAO".
004090     DISPLAY (13, 01) "13- ACE13 CAD. DE JUROS".
004100     DISPLAY (13, 39) "14- ACE14 APURACAO DE ESTOQUE".
004110     DISPLAY (14, 01) "15- ACE15 CAD. DE SENHA".
004120     DISPLAY (14, 39) "16- ACE16 ALTERACAO DE ESTOQUE".
004130     DISPLAY (15, 01) "17- ACI01 ARQUIVOS DE INDICE".
004140     DISPLAY (15, 39) "18- ACE18 BAIXAS ATUALIZADAS".
004150     DISPLAY (16, 01) "19- ACE19 VENDAS".
004160     DISPLAY (16, 39) "20- ACE20 TRANSPORTADOR".
004170     DISPLAY (17, 01) "21- ACE21 BAIXAS SERIE O".
004180     DISPLAY (17, 39) "22- ACE22 DIFERENCA DE VENDAS".
004190     DISPLAY (18, 01) "23- ACE23 BALANCO DE ESTOQUE".
004200 R-1000.
004210     DISPLAY (19, 30) "<  >-OPCAO".
004220     ACCEPT (19, 31) OPCAO-2 WITH UPDATE.
004230     ACCEPT E FROM ESCAPE KEY.
004240     IF E = "01"
004250        OR OPCAO-2 = ZEROS
004260        DISPLAY (06, 39) EX-MENS
004270        GO TO R-0000.
004280     IF OPCAO-2 = 1
004290        MOVE "OCE6904"      TO PROG-W PERFORM CHAMA-PROG.
004300     IF OPCAO-2 = 2
004310        MOVE "OCE6905"      TO PROG-W PERFORM CHAMA-PROG.
004320     IF OPCAO-2 = 3
004330        MOVE "OCE6906"      TO PROG-W PERFORM CHAMA-PROG.
004340     IF OPCAO-2 = 4
004350        MOVE "OCE6907"      TO PROG-W PERFORM CHAMA-PROG.
004360     IF OPCAO-2 = 5
004370        MOVE "OCE6908"      TO PROG-W PERFORM CHAMA-PROG.
004380     IF OPCAO-2 = 6
004390        MOVE "OCE6909"      TO PROG-W PERFORM CHAMA-PROG.
004400     IF OPCAO-2 = 7
004410        MOVE "OCE6910"      TO PROG-W PERFORM CHAMA-PROG.
004420     IF OPCAO-2 = 8
004430        MOVE "OCE6911"      TO PROG-W PERFORM CHAMA-PROG.
004440     IF OPCAO-2 = 9
004450        MOVE "OCE6912"      TO PROG-W PERFORM CHAMA-PROG.
004460     IF OPCAO-2 = 10
004470        MOVE "OCE6913"      TO PROG-W PERFORM CHAMA-PROG.
004480     IF OPCAO-2 = 11
004490        MOVE "OCE6914"      TO PROG-W PERFORM CHAMA-PROG.
004500     IF OPCAO-2 = 12
004510        MOVE "OCE6915"      TO PROG-W PERFORM CHAMA-PROG.
004520     IF OPCAO-2 = 13
004530        MOVE "OCE6916"      TO PROG-W PERFORM CHAMA-PROG.
004540     IF OPCAO-2 = 15
004550        MOVE "OCE6918"      TO PROG-W PERFORM CHAMA-PROG.
004560     IF OPCAO-2 = 16
004570        MOVE "OCE6919"      TO PROG-W PERFORM CHAMA-PROG.
004580     IF OPCAO-2 = 17
004590        MOVE "OCE6917"      TO PROG-W PERFORM CHAMA-PROG.
004600     IF OPCAO-2 = 18
004610        MOVE "OCE6920"      TO PROG-W PERFORM CHAMA-PROG.
004620     IF OPCAO-2 = 19
004630        MOVE "OCE6921"      TO PROG-W PERFORM CHAMA-PROG.
004640     IF OPCAO-2 = 20
004650        MOVE "OCE6922"      TO PROG-W PERFORM CHAMA-PROG.
004660     IF OPCAO-2 = 21
004670        MOVE "OCE6923"      TO PROG-W PERFORM CHAMA-PROG.
004680     IF OPCAO-2 = 22
004690        MOVE "OCE6924"      TO PROG-W PERFORM CHAMA-PROG.
004700     IF OPCAO-2 = 23
004710        MOVE "OCE6947"      TO PROG-W PERFORM CHAMA-PROG.
004720     GO TO ROT-U.
004730 ROT-U2.
004740     DISPLAY (01, 01) ERASE.
004750 COPY "/dados1/book/MOLDURA".
004760     MOVE "TCE0000I" TO TS.
004770     MOVE "* * * *  O  P  C  O  E  S  * * * *" TO INFT.
004780     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
004790     DISPLAY (02, 75) COD-EMPCE.
004800     DISPLAY (04, 01) LIMPA-1.    
004810     DISPLAY (04, 04) TS.
004820     DISPLAY (04, 23) INFT.
004830     DISPLAY (22, 14) EX-MENS.
004840     DISPLAY (02, 14) HH-W ":" MS-W.
004850     DISPLAY (06, 27) "REINDEXA:"
004860     PERFORM R-0900.
004870 R-1100.
004880     DISPLAY (19, 30) "<  >-OPCAO".
004890     DISPLAY (22, 14) "SENHA:".
004900     ACCEPT (22, 21) SENHA-W WITH UPDATE
004910        NO-ECHO.
004920     IF SENHA-W NOT = "REINDEXA" GO TO ROT-U2.
004930     DISPLAY (22, 14) EX-MENS.
004940     ACCEPT (19, 31) OPCAO-2 WITH UPDATE.
004950     ACCEPT E FROM ESCAPE KEY.
004960     IF E = "01"
004970        OR OPCAO-2 = ZEROS
004980        DISPLAY (06, 39) EX-MENS
004990        GO TO R-0000.
005000     IF OPCAO-2 = 1
005010        MOVE "OCE6925"      TO PROG-W PERFORM CHAMA-PROG.
005020     IF OPCAO-2 = 2
005030        MOVE "OCE6926"      TO PROG-W PERFORM CHAMA-PROG.
005040     IF OPCAO-2 = 3
005050        MOVE "OCE6927"      TO PROG-W PERFORM CHAMA-PROG.
005060     IF OPCAO-2 = 4
005070        MOVE "OCE6928"      TO PROG-W PERFORM CHAMA-PROG.
005080     IF OPCAO-2 = 5
005090        MOVE "OCE6929"      TO PROG-W PERFORM CHAMA-PROG.
005100     IF OPCAO-2 = 6
005110        MOVE "OCE6930"      TO PROG-W PERFORM CHAMA-PROG.
005120     IF OPCAO-2 = 7
005130        MOVE "OCE6931"      TO PROG-W PERFORM CHAMA-PROG.
005140     IF OPCAO-2 = 8
005150        MOVE "OCE6932"      TO PROG-W PERFORM CHAMA-PROG.
005160     IF OPCAO-2 = 9
005170        MOVE "OCE6933"      TO PROG-W PERFORM CHAMA-PROG.
005180     IF OPCAO-2 = 10
005190        MOVE "OCE6934"      TO PROG-W PERFORM CHAMA-PROG.
005200     IF OPCAO-2 = 11
005210        MOVE "OCE6935"      TO PROG-W PERFORM CHAMA-PROG.
005220     IF OPCAO-2 = 12
005230        MOVE "OCE6936"      TO PROG-W PERFORM CHAMA-PROG.
005240     IF OPCAO-2 = 13
005250        MOVE "OCE6937"      TO PROG-W PERFORM CHAMA-PROG.
005260     IF OPCAO-2 = 15
005270        MOVE "OCE6939"      TO PROG-W PERFORM CHAMA-PROG.
005280     IF OPCAO-2 = 16
005290        MOVE "OCE6940"      TO PROG-W PERFORM CHAMA-PROG.
005300     IF OPCAO-2 = 17
005310        MOVE "OCE6938"      TO PROG-W PERFORM CHAMA-PROG.
005320     IF OPCAO-2 = 18
005330        MOVE "OCE6941"      TO PROG-W PERFORM CHAMA-PROG.
005340     IF OPCAO-2 = 19
005350        MOVE "OCE6942"      TO PROG-W PERFORM CHAMA-PROG.
005360     IF OPCAO-2 = 20
005370        MOVE "OCE6943"      TO PROG-W PERFORM CHAMA-PROG.
005380     IF OPCAO-2 = 21
005390        MOVE "OCE6944"      TO PROG-W PERFORM CHAMA-PROG.
005400     IF OPCAO-2 = 22
005410        MOVE "OCE6945"      TO PROG-W PERFORM CHAMA-PROG.
005420     IF OPCAO-2 = 23
005430        MOVE "OCE6946"      TO PROG-W PERFORM CHAMA-PROG.
005440     GO TO ROT-U.
005450 ROT-I.
005460     DISPLAY (01, 01) ERASE.
005470 COPY "/dados1/book/MOLDURA".
005480     MOVE "** INICIALIZACAO DE ARQUIVOS  **" TO INFT.
005490     MOVE "TCE6101" TO TS.
005500     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
005510     DISPLAY (02, 75) COD-EMPCE.
005520     DISPLAY (04, 01) LIMPA-1.    
005530     DISPLAY (04, 04) TS.
005540     DISPLAY (04, 23) INFT.
005550     DISPLAY (22, 14) EX-MENS.
005560     DISPLAY (02, 14) HH-W ":" MS-W.
005570     DISPLAY (06, 16)
005580     " 1a PARTE    2a PARTE     3a PARTE     4a PARTE".
005590     DISPLAY (07, 16)
005600     "===========  ===========  ===========  ===========".
005610     DISPLAY (08, 16)
005620     "01- ACE01    13- ACE13    25- ACP01    37- ACE27".
005630     DISPLAY (09, 16)
005640     "02- ACE02    14- ABA03    26- ACP10    38- ACE17".
005650     DISPLAY (10, 16)
005660     "03- ACE03    15- ACE15    27- ACF01    39- ACE28".
005670     DISPLAY (11, 16)
005680     "04- ACE04    16- ACE16    28- ACE23    40-      ".
005690     DISPLAY (12, 16) 
005700     "05- ACE05    17- ACE18    29- ACC01    41-      ".
005710     DISPLAY (13, 16)
005720     "06- ACE06    18- ACC01    30- ACA04    42-      ".
005730     DISPLAY (14, 16)
005740     "07- ACE07    19- ACA03    31- ACE14    43-      ".
005750     DISPLAY (15, 16)
005760     "08- ACE08    20- ACT52    32- ACI01    44-      ".
005770     DISPLAY (16, 16)
005780     "09- ACE09    21- ACF04    33- ACP05    45-      ".
005790     DISPLAY (17, 16)
005800     "10- ACE10    22- ACE20    34- ACE24    46-      ".
005810     DISPLAY (18, 16)
005820     "11- ACE11    23- ACE21    35- ACE25    47-      ".
005830     DISPLAY (19, 16)
005840     "12- ACE12    24- ACE22    36- ACE26    48-      ".
005850 R-1200.
005860     DISPLAY (20, 15) "  - PARTE DESEJADA (1,2,3,4) [ ]".
005870     ACCEPT (20, 46) OPCAO-1 WITH UPDATE.
005880     ACCEPT E FROM ESCAPE KEY.
005890     IF E = "01"
005900        OR OPCAO-1 = ZEROS
005910        DISPLAY (06, 39) EX-MENS
005920        GO TO R-0000.
005930     IF OPCAO-1 = 1
005940        MOVE "OCE6101"      TO PROG-W PERFORM CHAMA-PROG.
005950     IF OPCAO-1 = 2
005960        MOVE "OCE6102"      TO PROG-W PERFORM CHAMA-PROG.
005970     IF OPCAO-1 = 3
005980        MOVE "OCE6103"      TO PROG-W PERFORM CHAMA-PROG.
005990     IF OPCAO-1 = 4
006000        MOVE "OCE6104"      TO PROG-W PERFORM CHAMA-PROG.
006010     GO TO ROT-I.
006020 ROT-REO.
006030     DISPLAY (01, 01) ERASE.
006040 COPY "/dados1/book/MOLDURA".
006050     MOVE "TCE0000G" TO TS.
006060     MOVE "***  REORGANIZACAO  DE  ARQUIVOS  ***" TO INFT.
006070     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
006080     DISPLAY (02, 75) COD-EMPCE.
006090     DISPLAY (04, 01) LIMPA-1.    
006100     DISPLAY (04, 04) TS.
006110     DISPLAY (04, 23) INFT.
006120     DISPLAY (22, 14) EX-MENS.
006130     DISPLAY (02, 14) HH-W ":" MS-W.
006140     PERFORM R-0900.
006150 R-1400.
006160     DISPLAY (22, 29) "<  >- OPCAO DESEJADA".
006170     ACCEPT (22, 30) OPCAO-2 WITH UPDATE.
006180     ACCEPT E FROM ESCAPE KEY.
006190     IF E = "01"
006200        OR OPCAO-2 = ZEROS
006210        DISPLAY (06, 39) EX-MENS
006220        GO TO R-0000.
006230     IF OPCAO-2 = 1
006240        MOVE "OCE6201"      TO PROG-W PERFORM CHAMA-PROG.
006250     IF OPCAO-2 = 2
006260        MOVE "OCE6202"      TO PROG-W PERFORM CHAMA-PROG.
006270     IF OPCAO-2 = 3
006280        MOVE "OCE6203"      TO PROG-W PERFORM CHAMA-PROG.
006290     IF OPCAO-2 = 4
006300        MOVE "OCE6204"      TO PROG-W PERFORM CHAMA-PROG.
006310     IF OPCAO-2 = 5
006320        MOVE "OCE6205"      TO PROG-W PERFORM CHAMA-PROG.
006330     IF OPCAO-2 = 6
006340        MOVE "OCE6206"      TO PROG-W PERFORM CHAMA-PROG.
006350     IF OPCAO-2 = 7
006360        MOVE "OCE6207"      TO PROG-W PERFORM CHAMA-PROG.
006370     IF OPCAO-2 = 8
006380        MOVE "OCE6208"      TO PROG-W PERFORM CHAMA-PROG.
006390     IF OPCAO-2 = 9
006400        MOVE "OCE6209"      TO PROG-W PERFORM CHAMA-PROG.
006410     IF OPCAO-2 = 10
006420        MOVE "OCE6210"      TO PROG-W PERFORM CHAMA-PROG.
006430     IF OPCAO-2 = 11
006440        MOVE "OCE6211"      TO PROG-W PERFORM CHAMA-PROG.
006450     IF OPCAO-2 = 12
006460        MOVE "OCE6212"      TO PROG-W PERFORM CHAMA-PROG.
006470     IF OPCAO-2 = 13
006480        MOVE "OCE6213"      TO PROG-W PERFORM CHAMA-PROG.
006490     IF OPCAO-2 = 14
006500        MOVE "OCE6214"      TO PROG-W PERFORM CHAMA-PROG.
006510     IF OPCAO-2 = 16
006520        MOVE "OCE6216"      TO PROG-W PERFORM CHAMA-PROG.
006530     IF OPCAO-2 = 17
006540        MOVE "OCE6217"      TO PROG-W PERFORM CHAMA-PROG.
006550     IF OPCAO-2 = 18
006560        MOVE "OCE6218"      TO PROG-W PERFORM CHAMA-PROG.
006570     IF OPCAO-2 = 21
006580        MOVE "OCE6221"      TO PROG-W PERFORM CHAMA-PROG.
006590     IF OPCAO-2 = 23
006600        MOVE "OCE6223"      TO PROG-W PERFORM CHAMA-PROG.
006610     GO TO ROT-REO.
006620 ROT-L.
006630     DISPLAY (01, 01) ERASE.
006640 COPY "/dados1/book/MOLDURA".
006650     MOVE "TCE0000J" TO TS.
006660     MOVE "     R E L A T O R I O S     " TO INFT.
006670     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
006680     DISPLAY (02, 75) COD-EMPCE.
006690     DISPLAY (04, 01) LIMPA-1.    
006700     DISPLAY (04, 04) TS.
006710     DISPLAY (04, 23) INFT.
006720     DISPLAY (22, 14) EX-MENS.
006730     DISPLAY (02, 14) HH-W ":" MS-W.
006740     DISPLAY (05, 29)
006750     "01- RELATORIO DE ESTOQUE ORDEM NUMERICA".
006760     DISPLAY (06, 29)
006770     "02- RELATORIO DE ESTOQUE ORDEM ALFABETICA".
006780     DISPLAY (07, 29) "03- LISTA DE DIRETORIA".
006790     DISPLAY (08, 29) "04- RELATORIO DE VENDAS ANUAL".
006800     DISPLAY (09, 29) "05- RELATORIO DE ESTOQUE P/BALANCO".
006810     DISPLAY (10, 29)
006820     "06- RELATORIO DE CODIGOS DISPONIVEIS P/PRODUTOS".
006830     DISPLAY (11, 29) "07- RELATORIO DEMONSTRATIVO DE VENDA".
006840     DISPLAY (12, 29) "08- RELATORIO DE ESTOQUE NAS LOJAS".
006850     DISPLAY (13, 29)
006860     "09- RELATORIO DE PRODUTOS SEM MOVIMENTO".
006870     DISPLAY (14, 29)
006880     "10- LISTA TODOS OS CAMPOS DO ACE01".
006890     DISPLAY (15, 29)
006900     "11- RELATORIO DO PRECO DE CUSTO ESTOQUE".
006910     DISPLAY (16, 29)
006920     "12- RELATORIO DE PRODUTOS VENDIDOS NO DIA".
006930     DISPLAY (17, 29) "13- RELATORIO CURVA ABC".
006940     DISPLAY (18, 29) "14- RELATORIO CURVA ABC (JUROS)".
006950     DISPLAY (19, 29) "15- LISTAGEM DE SAIDAS NO PERIODO".
006960     DISPLAY (20, 29) "16- RELATORIO DE COMPRAS NO MES".
006970 R-1500.
006980     DISPLAY (22, 28)
006990     "<  >- OPCAO DESEJADA <DIGITE ENTER P/ PROXIMA TELA>".
007000     ACCEPT (22, 29) OPCAO-2 WITH UPDATE.
007010     ACCEPT E FROM ESCAPE KEY.
007020     IF E = "01"
007030        DISPLAY (06, 39) EX-MENS
007040        GO TO R-0000.
007050     IF OPCAO-2 = ZEROS GO TO R-1600.
007060     IF OPCAO-2 = 1
007070        MOVE "OCE7101"      TO PROG-W PERFORM CHAMA-PROG.
007080     IF OPCAO-2 = 2
007090        MOVE "OCE7201"      TO PROG-W PERFORM CHAMA-PROG.
007100     IF OPCAO-2 = 3
007110        MOVE "OCE7301"      TO PROG-W PERFORM CHAMA-PROG.
007120     IF OPCAO-2 = 4
007130        MOVE "OCE7302"      TO PROG-W PERFORM CHAMA-PROG.
007140     IF OPCAO-2 = 5
007150        MOVE "OCE7303"      TO PROG-W PERFORM CHAMA-PROG.
007160     IF OPCAO-2 = 6
007170        MOVE "OCE7304"      TO PROG-W PERFORM CHAMA-PROG.
007180     IF OPCAO-2 = 7
007190        MOVE "OCE7305"      TO PROG-W PERFORM CHAMA-PROG.
007200     IF OPCAO-2 = 8
007210        MOVE "OCE7306"      TO PROG-W PERFORM CHAMA-PROG.
007220     IF OPCAO-2 = 9
007230        MOVE "OCE7307"      TO PROG-W PERFORM CHAMA-PROG.
007240     IF OPCAO-2 = 10
007250        MOVE "OCE7308"      TO PROG-W PERFORM CHAMA-PROG.
007260     IF OPCAO-2 = 11
007270        MOVE "OCE7309"      TO PROG-W PERFORM CHAMA-PROG.
007280     IF OPCAO-2 = 12
007290        MOVE "OCE7401"      TO PROG-W PERFORM CHAMA-PROG.
007300     IF OPCAO-2 = 13
007310        MOVE "OCE7402"      TO PROG-W PERFORM CHAMA-PROG.
007320     IF OPCAO-2 = 14
007330        MOVE "OCE7403"      TO PROG-W PERFORM CHAMA-PROG.
007340     IF OPCAO-2 = 15
007350        MOVE "OCE7404"      TO PROG-W PERFORM CHAMA-PROG.
007360     IF OPCAO-2 = 16
007370        MOVE "OCE7405"      TO PROG-W PERFORM CHAMA-PROG.
007380     GO TO ROT-L.
007390 R-1600.
007400     DISPLAY (01, 01) ERASE.
007410 COPY "/dados1/book/MOLDURA".
007420     MOVE "TCE0000J" TO TS.
007430     MOVE "   RELATORIOS PARTE II    " TO INFT.
007440     DISPLAY (02, 23) "GERENCIADOR SISTEMA DE ESTOQUE   ".
007450     DISPLAY (02, 75) COD-EMPCE.
007460     DISPLAY (04, 01) LIMPA-1.    
007470     DISPLAY (04, 04) TS.
007480     DISPLAY (04, 23) INFT.
007490     DISPLAY (22, 14) EX-MENS.
007500     DISPLAY (02, 14) HH-W ":" MS-W.
007510     DISPLAY (05, 29)
007520     "17- CONSISTENCIA DAS NOTAS FISCAIS DE ENTRADA".
007530     DISPLAY (06, 29)
007540     "18- RELATORIO DE VENDAS (CUSTO REAL * VENDA REAL)".
007550     DISPLAY (07, 29)
007560     "19- RELATORIO DE APURACAO ESTOQUE x (CUSTO,venda)".
007570     DISPLAY (08, 29)
007580     "20- RELATORIO DE CODIGOS DISPONIVEIS P/PRODUTOS".
007590     DISPLAY (09, 29)
007600     "21- RELATORIO CURVA ABC (POR CLASSE DE PRODUTOS)".
007610 R-1700.
007620     DISPLAY (22, 28)
007630     "<  >- OPCAO DESEJADA".
007640     ACCEPT (22, 29) OPCAO-2 WITH UPDATE.
007650     ACCEPT E FROM ESCAPE KEY.
007660     IF E = "01"
007670        DISPLAY (06, 39) EX-MENS
007680        GO TO ROT-L.
007690     IF OPCAO-2 = 17
007700        MOVE "OCE7406"      TO PROG-W PERFORM CHAMA-PROG.
007710     IF OPCAO-2 = 18
007720        MOVE "OCE7407"      TO PROG-W PERFORM CHAMA-PROG.
007730     IF OPCAO-2 = 19
007740        MOVE "OCE7408"      TO PROG-W PERFORM CHAMA-PROG.
007750     IF OPCAO-2 = 20
007760        MOVE "OCE7409"      TO PROG-W PERFORM CHAMA-PROG.
007770     IF OPCAO-2 = 21
007780        MOVE "OCE7411"      TO PROG-W PERFORM CHAMA-PROG.
007790     GO TO R-1600.
007800 CHAMA-PROG.
007810     MOVE EMP TO ARG-W.
007820     CALL PROG-W USING PARAM-W CANCEL PARAM-W.
007830*----------------F-I-M----------------
