000010****** ALTERTADO POR CLAUDIO (10\02\96)
000020********************************************
000030*OCE1201-MANUTENCAO DE PRODUTOS NA EMPRESA  COMPILDO 01\08\2005*
000040********************************************
000020$ set osvs ms(2) nowarning

000050 IDENTIFICATION DIVISION.
000060 PROGRAM-ID. SCE1201.
000070 COPY "\dados1\book\SELCE".
000080 COPY "\dados1\book\SELC-01".
000090 COPY "\dados1\book\SELC-02".
000100 COPY "\dados1\book\SELC-05".
000110     SELECT RELATO  ASSIGN TO PRINTER
000120                    FILE STATUS IS FS.
000130 COPY "\dados1\book\FDCE".
000140 COPY "\dados1\book\FD-01".
000150 COPY "\dados1\book\FD-02".
000160 COPY "\dados1\book\FD-05".
000170 COPY "\dados1\book\FDREL80".
000180 COPY "\dados1\book\TAB-W".
000190 01  CONT            PIC X VALUE SPACES.
000200 01  COD-AW          PIC X(06).
000210 01  COD-NW REDEFINES COD-AW.
000220     05 DIGITO-W     PIC 9(05).
000230     05 FILLER REDEFINES DIGITO-W.
000240        07 BILHAR    PIC 9.
000250        07 MILHAR    PIC 9.
000260        07 CENTENA   PIC 9.
000270        07 DEZENA    PIC 9.
000280        07 UNIDADE   PIC 9.
000290     05 DV-DIGITO-W  PIC 9.
000300 01  ED3             PIC ZZZ.ZZZ.ZZ9,99 VALUE ZEROS.
000310 01  PROD-UND        PIC 9(04) VALUE ZEROS.
000320 01  PROD-DEZ        PIC 9(04) VALUE ZEROS.
000330 01  PROD-CEM        PIC 9(04) VALUE ZEROS.
000340 01  PROD-MIL        PIC 9(04) VALUE ZEROS.
000350 01  PROD-BIL        PIC 9(04) VALUE ZEROS.
000360 01  RESTO           PIC 9(04) VALUE ZEROS.
000370 01  RESULTADO       PIC 9(04) VALUE ZEROS.
000380 01  SOMA            PIC 9(04) VALUE ZEROS.
000390 01  COD-W           PIC 9(06) VALUE ZEROS.
000400 01  ART-W           PIC 9(06) VALUE ZEROS.
000410 01  SEG-W           PIC X     VALUE SPACES.
000420 01  EST-W           PIC 9(07) VALUE ZEROS.
000430 01  EST-WR REDEFINES EST-W PIC 9(05)V99.
000440 01  CAMP-W          PIC 99 VALUE ZEROS.
000450 01  COD-F           PIC 9(06) VALUE ZEROS.
000460 01  CAB2.
000470     05 FILLER      PIC X(24) VALUE SPACES.
000480     05 FILLER      PIC X(32) VALUE
000490     "RELATORIO DE PRODUTOS NA EMPRESA".
000500 01  CAB3.
000510     05 FILLER      PIC X(80) VALUE
000520     "LOJA   QT.LOJA   QT.REPOS.   QT.MINIMA   SAIDA\MES DAT.ULT.M
000530-    "OVE     VENDA NO MES".
000540 01  CAB4.
000550     05 FILLER      PIC X(08) VALUE "01-COD.:".
000560     05 COD-4       PIC 9(06) VALUE ZEROS.
000570     05 FILLER      PIC X(14) VALUE SPACES.
000580     05 FILLER      PIC X(09) VALUE "02-DESC.:".
000590     05 DESC-4      PIC X(40) VALUE SPACES.
000600 01  CAB5.
000610     05 FILLER      PIC X(17) VALUE "03-ESTOQ.GERAL.: ".
000620     05 ESTG-5      PIC X(11) VALUE SPACES.
000630     05 FILLER      PIC X(07) VALUE "SAIDAS:".
000640     05 FILLER      PIC X(10) VALUE SPACES.
000650     05 FILLER      PIC X(17) VALUE "04-CUSTO REAL..: ".
000660     05 CUSTREAL-5  PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000670 01  CAB6.
000680     05 FILLER      PIC X(17) VALUE "05-ESTOQ.DEPOS.: ".
000690     05 ESTDEP-6    PIC X(11) VALUE SPACES.
000700     05 FILLER      PIC X(06) VALUE "06-J- ".
000710     05 SAIJAN      PIC X(11) VALUE SPACES.
000720     05 FILLER      PIC X(17) VALUE "07-CUSTO MEDIO.: ".
000730     05 CUSTMED-6   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000740 01  CAB7.
000750     05 FILLER      PIC X(17) VALUE "08-ESTOQ.MINIMO: ".
000760     05 ESTMIN-7    PIC X(09) VALUE SPACES.
000770     05 FILLER      PIC X(02) VALUE SPACES.
000780     05 FILLER      PIC X(06) VALUE "09-F- ".
000790     05 SAIFEV      PIC X(11) VALUE SPACES.
000800     05 FILLER      PIC X(06) VALUE "10-VR.".
000810     05 IND-7       PIC X(09) VALUE SPACES.
000820     05 FILLER      PIC X(02) VALUE ":".
000830     05 VRPU-7      PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000840 01  CAB8.
000850     05 FILLER      PIC X(17) VALUE "11-FORNECEDOR..: ".
000860     05 CODFOR-8    PIC 9(04) VALUE ZEROS.
000870     05 FILLER      PIC X(07) VALUE SPACES.
000880     05 FILLER      PIC X(06) VALUE "12-M- ".
000890     05 SAIMAR      PIC X(11) VALUE SPACES.
000900     05 FILLER      PIC X(17) VALUE "13-CUSTO ATUAL.: ".
000910     05 CUSTATU-8   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
000920 01  CAB9.
000930     05 FILLER      PIC X(17) VALUE "14-PRZ.PGTO.MED: ".
000940     05 PRZMED-9    PIC 9(03) VALUE ZEROS.
000950     05 FILLER      PIC X(08) VALUE SPACES.
000960     05 FILLER      PIC X(06) VALUE "15-A- ".
000970     05 SAIABR      PIC X(11) VALUE SPACES.
000980     05 FILLER      PIC X(17) VALUE "16-PRECO VAREJO: ".
000990     05 PRVAR-9     PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
001000 01  CAB10.
001010     05 FILLER      PIC X(17) VALUE "17-CLASSE......: ".
001020     05 CLASSE-10   PIC X     VALUE SPACES.
001030     05 FILLER      PIC X(10) VALUE SPACES.
001040     05 FILLER      PIC X(06) VALUE "18-M- ".
001050     05 SAIMAI      PIC X(11) VALUE SPACES.
001060     05 FILLER      PIC X(17) VALUE "19-PRECO ATAC..: ".
001070     05 PRATAC-10   PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
001080 01  CAB11.
001090     05 FILLER      PIC X(17) VALUE "20-DAT.CADASTR.: ".
001100     05 DIACAD-11   PIC 99    VALUE ZEROS.
001110     05 FILLER      PIC X     VALUE "\".
001120     05 MESCAD-11   PIC 99    VALUE ZEROS.
001130     05 FILLER      PIC X     VALUE "\".
001140     05 ANOCAD-11   PIC 99    VALUE ZEROS.
001150     05 FILLER      PIC X(03) VALUE SPACES.
001160     05 FILLER      PIC X(06) VALUE "21-J- ".
001170     05 SAIJUN      PIC X(11) VALUE SPACES.
001180     05 FILLER      PIC X(17) VALUE "22-COD.TABELA..: ".
001190     05 CODTAB-11   PIC X(01) VALUE SPACES.
001200 01  CAB12.
001210     05 FILLER      PIC X(17) VALUE "23-DATA.CUSTO..: ".
001220     05 DIACUS-12   PIC 99    VALUE ZEROS.
001230     05 FILLER      PIC X     VALUE "\".
001240     05 MESCUS-12   PIC 99    VALUE ZEROS.
001250     05 FILLER      PIC X     VALUE "\".
001260     05 ANOCUS-12   PIC 99    VALUE ZEROS.
001270     05 FILLER      PIC X(03) VALUE SPACES.
001280     05 FILLER      PIC X(06) VALUE "24-J- ".
001290     05 SAIJUL      PIC X(11) VALUE SPACES.
001300     05 FILLER      PIC X(17) VALUE "25-EMBALAGEM...:".
001310     05 EMB-16      PIC 999 VALUE ZEROS.
001320 01  CAB13.
001330     05 FILLER      PIC X(17) VALUE "26-DAT.ULT.MOV.: ".
001340     05 MESNOV-13   PIC 99   VALUE ZEROS.
001350     05 FILLER      PIC X     VALUE "\".
001360     05 ANONOV-13   PIC 99   VALUE ZEROS.
001370     05 FILLER      PIC X(06) VALUE SPACES.
001380     05 FILLER      PIC X(06) VALUE "27-A- ".
001390     05 SAIAGO      PIC X(11) VALUE SPACES.
001400     05 FILLER      PIC X(17) VALUE "28-DAT.ULT.INFL: ".
001410     05 DIAINF-13   PIC 99  VALUE ZEROS.
001350     05 FILLER      PIC X     VALUE "\".
001420     05 MESINF-13   PIC 99  VALUE ZEROS.
001430 01  CAB14.
001440     05 FILLER      PIC X(17) VALUE "29-PEDIDO......: ".
001450     05 QTPED-14    PIC X(11) VALUE SPACES.
001460     05 FILLER      PIC X(06) VALUE "30-S- ".
001470     05 SAISET      PIC X(11) VALUE SPACES.
001480     05 FILLER      PIC X(17) VALUE "31-............: ".
001490 01  CAB15.
001500     05 FILLER      PIC X(17) VALUE "32-ENTRADA MES.: ".
001510     05 QTENT-15    PIC X(11) VALUE SPACES.
001520     05 FILLER      PIC X(06) VALUE "33-O- ".
001530     05 SAIOUT      PIC X(11) VALUE SPACES.
001540     05 FILLER      PIC X(17) VALUE "34-............: ".
001550 01  CAB16.
001560     05 FILLER      PIC X(17) VALUE "35-UNIDADE.....: ".
001570     05 UNID-16     PIC X(04) VALUE SPACES.
001580     05 FILLER      PIC X(07) VALUE SPACES.
001590     05 FILLER      PIC X(06) VALUE "36-N- ".
001600     05 SAINOV      PIC X(11) VALUE SPACES.
001610     05 FILLER      PIC X(17) VALUE "37-............: ".
001620     05 FILLER      PIC 9(14) VALUE ZEROS.
001630 01  CAB17.
001640     05 FILLER      PIC X(17) VALUE "38-LIVRO.......: ".
001650     05 LIVRO-17    PIC X     VALUE SPACES.
001660     05 FILLER      PIC X(10) VALUE SPACES.
001670     05 FILLER      PIC X(06) VALUE "39-D- ".
001680     05 SAIDEZ      PIC X(11) VALUE SPACES.
001690     05 FILLER      PIC X(17) VALUE "40-............: ".
001700     05 FILLER      PIC 9(14) VALUE ZEROS.
001710 01  CAB18.
001720     05 FILLER      PIC X     VALUE SPACES.
001730     05 LOJA-18     PIC XX    VALUE SPACES.
001740     05 FILLER      PIC XX    VALUE SPACES.
001750     05 QTL-18      PIC X(12) VALUE SPACES.
001760     05 QTR-18      PIC X(12) VALUE SPACES.
001770     05 QTM-18      PIC X(12) VALUE SPACES.
001780     05 QTSAI-18    PIC X(12) VALUE SPACES.
001790     05 FILLER      PIC X(01) VALUE SPACES.
001800     05 MM-18       PIC 99    VALUE ZEROS.
001810     05 FILLER      PIC X     VALUE "\".
001820     05 AA-18       PIC 99    VALUE ZEROS.
001830     05 FILLER      PIC X(04) VALUE SPACES.
001840     05 VENDA-18    PIC Z.ZZZ.ZZZ.ZZ9,99.
001850 01  EX-MENS1       PIC X(28) VALUE SPACES.
001860 01  EX-MENS2       PIC X(34) VALUE SPACES.
001870 01  W-LOJA.
001880     02 QTLJA-W OCCURS 14 TIMES.
001890        03 QTLJ-W   PIC 9(07).
001900        03 QTLJ-WR REDEFINES QTLJ-W PIC 9(05)V99.





001910 COPY "\dados1\book\CPYPDCE".
001930 R-0000.
001940     IF REFCI-EMPCE = 1 MOVE "DOLAR" TO IND-7.
001950     IF REFCI-EMPCE = 2 MOVE "UFIR " TO IND-7.
001960     IF REFCI-EMPCE = 3 MOVE "T R D" TO IND-7.
001970 COPY "\dados1\book\PDIMP".
001980     OPEN I-O ACE01.
001990     IF FS NOT = "00"
002000        MOVE "MCE1201A" TO CODMENFS
002010         MOVE "ACE01"     TO ARQFS
002020        PERFORM TESTA-FS THRU SAI-TESTA-FS
002030        CLOSE ACE01 STOP RUN.
002040     OPEN I-O ACE02.
002050     IF FS NOT = "00"
002060        MOVE "MCE1201B" TO CODMENFS
002070        MOVE "ACE02"     TO ARQFS
002080        PERFORM TESTA-FS THRU SAI-TESTA-FS
002090        CLOSE ACE02 ACE01 STOP RUN.
002100     OPEN INPUT ACE05.
002110     IF FS NOT = "00"
002120        MOVE "MCE1201D" TO CODMENFS
002130        MOVE "ACE05"     TO ARQFS
002140        PERFORM TESTA-FS THRU SAI-TESTA-FS
002150        CLOSE ACE05 ACE01 ACE02 STOP RUN.
002160 R-0090.
002170     MOVE "MANUTENCAO DE ESTOQUE NA EMPRESA" TO INFT.
002180     MOVE "TCE1201" TO TS.
002190     MOVE "RCE1201" TO NOME-RELB.
002200 R-0100.
002210 COPY "\dados1\book\CPYTPCE".
002220     DISPLAY (08, 69) "<L>ISTAGEM".
002230 COPY "\dados1\book\CPYTMCE".
002240     IF OPCAO = "L" GO TO ROT-L.
002250     GO TO R-8888.
002260 ROT-I.
002270     MOVE "INCLUSAO DE PRODUTOS NA EMPRESA" TO INFT.
002280     MOVE "TCE1201A" TO TS.
002290 COPY "\dados1\book\CPYTPCE".
002300     MOVE SPACES TO CR.
002310     MOVE SPACES TO CODTAB-01 DESC-01 UND-01 LIVRO-01 CLASSECE-01.
002320     MOVE ZEROS TO ESTMIN-01 QTPED-01 QTENT-01
002330          EST-01 DCUSTO-01 CONDPG-01 DATCAD-01 DATNOV-01
002340          CODFOR-01 CREAL-01 CMEDIO-01 PRATAC-01
002350          PRVAR-01 VRPU-01 CATUAL-01 EMB-01 DATINF-01
002360          QTSAI-01(01) QTSAI-01(02) QTSAI-01(03) QTSAI-01(04)
002370          QTSAI-01(05) QTSAI-01(06) QTSAI-01(07) QTSAI-01(08)
002380          QTSAI-01(09) QTSAI-01(10) QTSAI-01(11) QTSAI-01(12).
002390*======================================
002400     DISPLAY (07, 01) "01-COD.:......".
002410     DISPLAY (07, 21)
002420     "02-DESC.:........................................".
002430     ACCEPT (07, 09) COD-W WITH UPDATE.
002440     DISPLAY (09, 01) "ARTIGO.:......".
           ACCEPT E FROM ESCAPE KEY.
002450     IF E = "01" GO TO R-0090.
002460     GO TO R-0300.
002470 R-0200.
002480 COPY "\dados1\book\CPYTPCE".
002490     DISPLAY (07, 01) "01-COD.:......".
002500     DISPLAY (07, 21)
002510     "02-DESC.:........................................".
002520     DISPLAY (09, 01) "ARTIGO.:......".
002530 R-0300.
002540     MOVE SPACES TO CR.
002550     DISPLAY (07, 09) COD-W
002560     ADD 10  TO  COD-W.
002570     MOVE COD-W  TO  COD-AW.
002580     MOVE 0 TO SOMA.
002590     IF COD-W  NUMERIC
002600        MOVE COD-W TO COD-AW
002610        MULTIPLY UNIDADE BY 2 GIVING PROD-UND
002620        MULTIPLY DEZENA  BY 3 GIVING PROD-DEZ
002630        MULTIPLY CENTENA BY 4 GIVING PROD-CEM
002640        MULTIPLY MILHAR  BY 5 GIVING PROD-MIL
002650        MULTIPLY BILHAR  BY 6 GIVING PROD-BIL
002660        ADD PROD-UND PROD-DEZ PROD-CEM PROD-MIL PROD-BIL
002670        TO SOMA
002680        DIVIDE SOMA BY 11 GIVING RESULTADO REMAINDER RESTO
002690        SUBTRACT RESTO FROM 11 GIVING DV-DIGITO-W
002700        MOVE COD-AW TO COD-W
002710        DISPLAY (07, 09) COD-W
002720     ELSE
002730        DISPLAY (22, 14) "CODIGO INVALIDO - REDIGITAR"
002740        ACCEPT (22, 29) CR WITH UPDATE
002750        DISPLAY (22, 14) "                           "
002760        GO TO  ROT-I.
002770     ACCEPT (07, 30) DESC-01 WITH UPDATE.
002780     ACCEPT (09, 09) ART-W WITH UPDATE.
002790     DISPLAY (22, 14) "CONFIRMA A INCLUSAO (S\<N>):.".
002800     ACCEPT (22, 42) CR WITH UPDATE.
002810     DISPLAY (22, 14) EX-MENS.
002820     IF CR NOT = "S" GO TO ROT-I.
002830     MOVE COD-W  TO COD-01.
002840     MOVE ART-W TO ARTIGO-01.
002850     MOVE 02 TO CODTRI-01.
002860     MOVE SPACES TO CLASSECE-01 LIVRO-01.
002870     WRITE REG-01 INVALID KEY
002880         DISPLAY (22, 14) "ERRO NA GRAVACAO DO ACE01=>" FS
002890         ACCEPT (22, 78) CR WITH UPDATE
002900         DISPLAY (22, 14) EX-MENS
002910         GO TO ROT-I.
002920     MOVE ZEROS TO ART-W.
002930     GO TO R-0200.
002940 ROT-E.
002950     MOVE "EXCLUSAO DE PRODUTOS NA EMPRESA" TO INFT.
002960     MOVE "TCE1201C" TO TS.
002970     PERFORM R-0200.
002980 R-0400.
002990     DISPLAY (08, 01) "03-ESTOQ.GERAL.: .......   ".
003000     DISPLAY (08, 30) "SAIDAS:".
003010     DISPLAY (08, 45) "04-CUSTO REAL..: ..............".
003020     DISPLAY (09, 01) "05-ESTOQ.DEPOS.: .......   ".
003030     DISPLAY (09, 30) "06-J- .....  ".
003040     DISPLAY (09, 45) "07-CUSTO MEDIO.: ..............".
003050     DISPLAY (10, 01) "08-ESTOQ.MINIMO: .......    ".
003060     DISPLAY (10, 30) "09-F- .....  ".
003070     DISPLAY (10, 45) "10-............: ..............".
003080     DISPLAY (10, 48) IND-7.
003090     DISPLAY (11, 01) "11-FORNECEDOR..: ....".
003100     DISPLAY (11, 30) "12-M- .....  ".
003110     DISPLAY (11, 45) "13-CUSTO ATUAL.: ..............".
003120     DISPLAY (12, 01) "14-PRZ.PGTO.MED: ...".
003130     DISPLAY (12, 30) "15-A- .....   ".
003140     DISPLAY (12, 45) "16-PRECO VAREJO: ..............".
003150     DISPLAY (13, 01) "17-CLASSE......: .".
003160     DISPLAY (13, 30) "18-M- .....   ".
003170     DISPLAY (13, 45) "19-PRECO ATAC..: ..............".
003180     DISPLAY (14, 01) "20-DAT.CAD\REMAR ..\..\..".
003190     DISPLAY (14, 30) "21-J- .....   ".
003200     DISPLAY (14, 45) "22-COD.TABELA..: .       ".
003210     DISPLAY (15, 01) "23-DATA CUSTO..: ..\..\..".
003220     DISPLAY (15, 30) "24-J- .....   ".
003230     DISPLAY (15, 45) "25-EMBALAGEM...: ".
003240     DISPLAY (16, 01) "26-DAT.ULT.MOV.: ..\..".
003250     DISPLAY (16, 30) "27-A- .....   ".
003260     DISPLAY (16, 45) "28-DAT.ULT.INFL: ..\..".
003270     DISPLAY (17, 01) "29-PEDIDO......: .......   ".
003280     DISPLAY (17, 30) "30-S-         ".
003290     DISPLAY (17, 45) "31-ARTIGO......: ......".
003300     DISPLAY (18, 01) "32-ENTRADA MES.: .......   ".
003310     DISPLAY (18, 30) "33-O- .....   ".
003320     DISPLAY (18, 45) "34-ULT.CONTAGEM: ..\..\..".
003330     DISPLAY (19, 01) "35-UNIDADE.....: ....".
003340     DISPLAY (19, 30) "36-N- .....   ".
003350     DISPLAY (19, 45) "37-COD-TRIBUTAR: ".
003360     DISPLAY (20, 01) "38-LIVRO.......: .".
003370     DISPLAY (20, 30) "39-D- .....   ".
003380     DISPLAY (20, 45) "40-............: ".
003390 R-0500.
003400     EXIT.
003410 R-0600.
003420     ACCEPT (07, 09) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003430     IF E = "01" GO TO R-0090.
003440     MOVE COD-W  TO  COD-01.
003450     READ ACE01 INVALID KEY
003460        DISPLAY (22, 14) "PRODUTO NAO ENCONTRADO NO ACE01=>"
003470        FS ACCEPT (22, 78) CR WITH UPDATE
003480        DISPLAY (22, 14) EX-MENS
003490        GO TO R-0600.
003500     MOVE EST-01 TO EST-W.
003510     MOVE COD-01 TO COD-02.
003520     START ACE02 KEY IS = COD-02 INVALID KEY
003530        GO TO R-0700.
003540     DISPLAY (22, 14)
003550     "ATENCAO, ESTE CODIGO NAO PODERA SER EXCLUIDO, VER ESTOQUE".
003560     ACCEPT (22, 71) CR WITH UPDATE.
003570     DISPLAY (22, 14) EX-MENS.
003580*     GO TO R-0600.
003590 R-0700.
003600     DISPLAY (07, 30) DESC-01.
003610     IF DECIMAL-EMPCE = "S"
003620        MOVE EST-WR TO ED-DEC
003630        DISPLAY (08, 18) ED-DEC
003640     ELSE
003650        MOVE EST-W TO ED-INT
003660        DISPLAY (08, 18) ED-INT.
003670     MOVE CREAL-01R TO ED3 DISPLAY (08, 62) ED3.
003680     IF DECIMAL-EMPCE = "S"
003690        MOVE EST-01R    TO ED-DEC DISPLAY (09, 18) ED-DEC
003700        MOVE ESTMIN-01R TO ED-DEC DISPLAY (10, 18) ED-DEC
003710     ELSE
003720        MOVE EST-01    TO ED-INT DISPLAY (09, 18) ED-INT
003730        MOVE ESTMIN-01 TO ED-INT DISPLAY (10, 18) ED-INT.
003740     MOVE CMEDIO-01R TO ED3 DISPLAY (09, 62) ED3.
003750     MOVE VRPU-01R  TO ED3 DISPLAY (10, 62) ED3.
003760     DISPLAY (11, 18) CODFOR-01.
003770     MOVE CATUAL-01R TO  ED3 DISPLAY (11, 62) ED3.
003780     DISPLAY (12, 18) CONDPG-01.
003790     MOVE PRVAR-01R  TO  ED3 DISPLAY (12, 62) ED3.
003800     DISPLAY (13, 18) CLASSECE-01.
003810     MOVE PRATAC-01R TO  ED3 DISPLAY (13, 62) ED3.
003820     DISPLAY (14, 18) DIACAD-01.
003830     DISPLAY (14, 21) MESCAD-01.
003840     DISPLAY (14, 24) ANOCAD-01.
003850     DISPLAY (14, 62) CODTAB-01.
003860     DISPLAY (15, 18) DIACUSTO-01.
003870     DISPLAY (15, 21) MESCUSTO-01.
003880     DISPLAY (15, 24) ANOCUSTO-01.
003890     DISPLAY (15, 62) EMB-01.
003900     DISPLAY (16, 18) MESNOV-01.
003910     DISPLAY (16, 21) ANONOV-01.
003920     DISPLAY (16, 62) DIAINF-01.
003930     DISPLAY (16, 65) MESINF-01.
003940     DISPLAY (17, 62) ARTIGO-01.
003950     DISPLAY (19, 62) CODTRI-01.
003960     IF DECIMAL-EMPCE = "S"
003970        MOVE QTPED-01R TO ED-DEC DISPLAY (17, 18) ED-DEC
003980        MOVE QTENT-01R TO ED-DEC DISPLAY (18, 18) ED-DEC
003990     ELSE
004000        MOVE QTPED-01 TO ED-INT DISPLAY (17, 18) ED-INT
004010        MOVE QTENT-01 TO ED-INT DISPLAY (18, 18) ED-INT.
004020     DISPLAY (18, 62) DCON-01.
004030     DISPLAY (18, 65) MCON-01.
004040     DISPLAY (18, 68) ACON-01.
004050     DISPLAY (19, 18) UND-01.
004060     DISPLAY (20, 18) LIVRO-01.
004070     IF DECIMAL-EMPCE = "S"
004080        MOVE QTSAI-01R(01) TO ED-DEC DISPLAY (09, 35) ED-DEC
004090        MOVE QTSAI-01R(02) TO ED-DEC DISPLAY (10, 35) ED-DEC
004100        MOVE QTSAI-01R(03) TO ED-DEC DISPLAY (11, 35) ED-DEC
004110        MOVE QTSAI-01R(04) TO ED-DEC DISPLAY (12, 35) ED-DEC
004120        MOVE QTSAI-01R(05) TO ED-DEC DISPLAY (13, 35) ED-DEC
004130        MOVE QTSAI-01R(06) TO ED-DEC DISPLAY (14, 35) ED-DEC
004140        MOVE QTSAI-01R(07) TO ED-DEC DISPLAY (15, 35) ED-DEC
004150        MOVE QTSAI-01R(08) TO ED-DEC DISPLAY (16, 35) ED-DEC
004160        MOVE QTSAI-01R(09) TO ED-DEC DISPLAY (17, 35) ED-DEC
004170        MOVE QTSAI-01R(10) TO ED-DEC DISPLAY (18, 35) ED-DEC
004180        MOVE QTSAI-01R(11) TO ED-DEC DISPLAY (19, 35) ED-DEC
004190        MOVE QTSAI-01R(12) TO ED-DEC DISPLAY (20, 35) ED-DEC
004200     ELSE
004210        MOVE QTSAI-01(01)  TO ED-INT DISPLAY (09, 35) ED-INT
004220        MOVE QTSAI-01(02)  TO ED-INT DISPLAY (10, 35) ED-INT
004230        MOVE QTSAI-01(03)  TO ED-INT DISPLAY (11, 35) ED-INT
004240        MOVE QTSAI-01(04)  TO ED-INT DISPLAY (12, 35) ED-INT
004250        MOVE QTSAI-01(05)  TO ED-INT DISPLAY (13, 35) ED-INT
004260        MOVE QTSAI-01(06)  TO ED-INT DISPLAY (14, 35) ED-INT
004270        MOVE QTSAI-01(07)  TO ED-INT DISPLAY (15, 35) ED-INT
004280        MOVE QTSAI-01(08)  TO ED-INT DISPLAY (16, 35) ED-INT
004290        MOVE QTSAI-01(09)  TO ED-INT DISPLAY (17, 35) ED-INT
004300        MOVE QTSAI-01(10)  TO ED-INT DISPLAY (18, 35) ED-INT
004310        MOVE QTSAI-01(11)  TO ED-INT DISPLAY (19, 35) ED-INT
004320        MOVE QTSAI-01(12)  TO ED-INT DISPLAY (20, 35) ED-INT.
004330 R-0800.
004340     MOVE SPACES TO CR.
004350     DISPLAY (22, 14) "CONFIRMA (S\<N>) :->".
004360     ACCEPT (22, 34) CR WITH UPDATE
004370     DISPLAY (22, 14) EX-MENS.
004380     IF CR NOT = "S" GO TO R-0600.
004390     DELETE ACE01 INVALID KEY
004400        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACE01=>" FS
004410        ACCEPT (22, 78) CR WITH UPDATE
004420        DISPLAY (22, 14) EX-MENS
004430        GO TO ROT-E.
004440     MOVE COD-W TO COD-02.
004450     READ ACE02 INVALID KEY
004460        DISPLAY (22, 14)
004470        "PRODUTO NAO ENCONTRADO NO ACE02 - EXCLUIDO DO ACE01"
004480        ACCEPT (22, 65) CR WITH UPDATE
004490        DISPLAY (22, 14) EX-MENS
004500        GO TO R-0600.
004510     DELETE ACE02 INVALID KEY
004520        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACE02=>" FS
004530        ACCEPT (22, 78) CR WITH UPDATE
004540        DISPLAY (22, 14) EX-MENS
004550        GO TO ROT-E.
004560     DISPLAY (22, 14) "EXCLUSAO COM EXITO !! ".
004570     ACCEPT (22, 35) CR WITH UPDATE
004580     DISPLAY (22, 14) EX-MENS
004590     GO TO ROT-E.
004600 ROT-P.
004610     MOVE "PESQUISA DE PRODUTOS NA EMPRESA" TO INFT.
004620     MOVE "TCE1201D" TO TS.
004630     PERFORM R-0200.
004640     PERFORM R-0400 THRU R-0500.
004650 R-0900.
004660     ACCEPT (07, 09) COD-01 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004670     IF E = "01" GO TO R-0090.
004680     READ ACE01 INVALID KEY
004690        DISPLAY (22, 14) "PRODUTO INEXISTENTE-ACE01 FS=>" FS
004700        ACCEPT (22, 78) CR WITH UPDATE
004710        DISPLAY (22, 14) EX-MENS
004720        GO TO R-0900.
004730     MOVE COD-01 TO COD-02.
004740     MOVE EST-01 TO EST-W.
004750     START ACE02 KEY IS NOT < COD-02 INVALID KEY
004760        GO TO R-1100.
004770 R-1000.
004780     READ ACE02 NEXT RECORD AT END
004790        MOVE LOW-VALUE TO COD-02.
004800     IF COD-02 = COD-01
004810        ADD QTLOJ-02 TO EST-W
004820        GO TO R-1000.
004830 R-1100.
004840     PERFORM R-0700.
004850     DISPLAY (22, 14)
004860     "DESEJA VISUALIZAR SAIDAS DAS LOJAS (S\<N>)".
004870     ACCEPT (22, 57) CONT WITH UPDATE.
004880     IF CONT NOT = "S"
004890        DISPLAY (22, 14) EX-MENS GO TO R-1500.
004900 R-1200.
004910     DISPLAY (22, 14) EX-MENS.
004920     DISPLAY (20, 01) EX-MENS1.
004930     DISPLAY (20, 45) EX-MENS2.
004940     DISPLAY (19, 01) EX-MENS1.
004950     DISPLAY (19, 45) EX-MENS2.
004960     DISPLAY (18, 01) EX-MENS1.
004970     DISPLAY (18, 45) EX-MENS2.
004980     DISPLAY (17, 01) EX-MENS1.
004990     DISPLAY (17, 45) EX-MENS2.
005000     DISPLAY (16, 01) EX-MENS1.
005010     DISPLAY (16, 45) EX-MENS2.
005020     DISPLAY (15, 01) EX-MENS1.
005030     DISPLAY (15, 01) EX-MENS1.
005040     DISPLAY (15, 62) EX-MENS1.
005050     DISPLAY (14, 01) EX-MENS1.
005060     DISPLAY (14, 45) EX-MENS2.
005070     DISPLAY (14, 01) "20-SAI\LOJA-01.: ".
005080     DISPLAY (14, 45) "22-SAI\LOJA-02.: ".
005090     DISPLAY (15, 01) "23-SAI\LOJA-03.: ".
005100     DISPLAY (15, 45) "25-SAI\LOJA-04.: ".
005110     DISPLAY (16, 01) "26-SAI\LOJA-05.: ".
005120     DISPLAY (16, 45) "28-SAI\LOJA-06.: ".
005130     DISPLAY (17, 01) "29-SAI\LOJA-07.: ".
005140     DISPLAY (17, 45) "31-SAI\LOJA-08.: ".
005150     DISPLAY (18, 01) "32-SAI\LOJA-09.: ".
005160     DISPLAY (18, 45) "34-SAI\LOJA-10.: ".
005170     DISPLAY (19, 01) "35-SAI\LOJA-11.: ".
005180     DISPLAY (19, 45) "37-SAI\LOJA-12.: "
005190     DISPLAY (20, 01) "38-SAI\LOJA-13.: ".
005200     DISPLAY (20, 45) "40-SAI\LOJA-14.: ".
005210     MOVE LOW-VALUE TO CHAVE-05
005220     MOVE ALL ZEROS TO W-LOJA.
005230     START ACE05 KEY IS NOT < CHAVE-05 INVALID KEY MOVE 1 TO ST.
005240     MOVE ZEROS TO IND1-W.
005250 R-1300.
005260     READ ACE05 NEXT RECORD AT END
005270        GO TO R-1400.
005280     IF LOJA-05 = ZEROS OR LOJA-05 > 14
005290        GO TO R-1300.
005300     MOVE COD-01  TO COD-02.
005310     MOVE LOJA-05 TO LOJA-02 IND2-W.
005320     READ ACE02 INVALID KEY
005330        GO TO R-1300.
005340     MOVE QTSAI-02 TO QTLJ-W(IND2-W).
005350     GO TO R-1300.
005360 R-1400.
005370     IF DECIMAL-EMPCE = "S"
005380        MOVE QTLJ-WR(01) TO ED-DEC DISPLAY (14, 18) ED-DEC
005390        MOVE QTLJ-WR(02) TO ED-DEC DISPLAY (14, 62) ED-DEC
005400        MOVE QTLJ-WR(03) TO ED-DEC DISPLAY (15, 18) ED-DEC
005410        MOVE QTLJ-WR(04) TO ED-DEC DISPLAY (15, 62) ED-DEC
005420        MOVE QTLJ-WR(05) TO ED-DEC DISPLAY (16, 18) ED-DEC
005430        MOVE QTLJ-WR(06) TO ED-DEC DISPLAY (16, 62) ED-DEC
005440        MOVE QTLJ-WR(07) TO ED-DEC DISPLAY (17, 18) ED-DEC
005450        MOVE QTLJ-WR(08) TO ED-DEC DISPLAY (17, 62) ED-DEC
005460        MOVE QTLJ-WR(09) TO ED-DEC DISPLAY (18, 18) ED-DEC
005470        MOVE QTLJ-WR(10) TO ED-DEC DISPLAY (18, 62) ED-DEC
005480        MOVE QTLJ-WR(11) TO ED-DEC DISPLAY (19, 18) ED-DEC
005490        MOVE QTLJ-WR(12) TO ED-DEC DISPLAY (19, 62) ED-DEC
005500        MOVE QTLJ-WR(13) TO ED-DEC DISPLAY (20, 18) ED-DEC
005510        MOVE QTLJ-WR(14) TO ED-DEC DISPLAY (20, 62) ED-DEC
005520     ELSE
005530        MOVE QTLJ-W(01)  TO ED-INT DISPLAY (14, 18) ED-INT
005540        MOVE QTLJ-W(02)  TO ED-INT DISPLAY (14, 62) ED-INT
005550        MOVE QTLJ-W(03)  TO ED-INT DISPLAY (15, 18) ED-INT
005560        MOVE QTLJ-W(04)  TO ED-INT DISPLAY (15, 62) ED-INT
005570        MOVE QTLJ-W(05)  TO ED-INT DISPLAY (16, 18) ED-INT
005580        MOVE QTLJ-W(06)  TO ED-INT DISPLAY (16, 62) ED-INT
005590        MOVE QTLJ-W(07)  TO ED-INT DISPLAY (17, 18) ED-INT
005600        MOVE QTLJ-W(08)  TO ED-INT DISPLAY (17, 62) ED-INT
005610        MOVE QTLJ-W(09)  TO ED-INT DISPLAY (18, 18) ED-INT
005620        MOVE QTLJ-W(10)  TO ED-INT DISPLAY (18, 62) ED-INT
005630        MOVE QTLJ-W(11)  TO ED-INT DISPLAY (19, 18) ED-INT
005640        MOVE QTLJ-W(12)  TO ED-INT DISPLAY (19, 62) ED-INT
005650        MOVE QTLJ-W(13)  TO ED-INT DISPLAY (20, 18) ED-INT
005660        MOVE QTLJ-W(14)  TO ED-INT DISPLAY (20, 62) ED-INT.
005670     DISPLAY (22, 14)
005680     "DESEJA VISUALIZAR ESTOQUE DAS LOJAS (S\<N>)".
005690     ACCEPT (22, 58) CONT WITH UPDATE.
005700     IF CONT NOT = "S"
005710        DISPLAY (22, 14) EX-MENS GO TO R-1500.
005720 R-1410.
005730     DISPLAY (22, 14) EX-MENS.
005740     DISPLAY (20, 01) EX-MENS1.
005750     DISPLAY (20, 45) EX-MENS2.
005760     DISPLAY (19, 01) EX-MENS1.
005770     DISPLAY (19, 45) EX-MENS2.
005780     DISPLAY (18, 01) EX-MENS1.
005790     DISPLAY (18, 45) EX-MENS2.
005800     DISPLAY (17, 01) EX-MENS1.
005810     DISPLAY (17, 45) EX-MENS2.
005820     DISPLAY (16, 01) EX-MENS1.
005830     DISPLAY (16, 45) EX-MENS2.
005840     DISPLAY (15, 01) EX-MENS1.
005850     DISPLAY (15, 01) EX-MENS1.
005860     DISPLAY (15, 62) EX-MENS1.
005870     DISPLAY (14, 01) EX-MENS1.
005880     DISPLAY (14, 45) EX-MENS2.
005890     DISPLAY (14, 01) "20-EST\LOJA-01.: ".
005900     DISPLAY (14, 45) "22-EST\LOJA-02.: ".
005910     DISPLAY (15, 01) "23-EST\LOJA-03.: ".
005920     DISPLAY (15, 45) "25-EST\LOJA-04.: ".
005930     DISPLAY (16, 01) "26-EST\LOJA-05.: ".
005940     DISPLAY (16, 45) "28-EST\LOJA-06.: ".
005950     DISPLAY (17, 01) "29-EST\LOJA-07.: ".
005960     DISPLAY (17, 45) "31-EST\LOJA-08.: ".
005970     DISPLAY (18, 01) "32-EST\LOJA-09.: ".
005980     DISPLAY (18, 45) "34-EST\LOJA-10.: ".
005990     DISPLAY (19, 01) "35-EST\LOJA-11.: ".
006000     DISPLAY (19, 45) "37-EST\LOJA-12.: "
006010     DISPLAY (20, 01) "38-EST\LOJA-13.: ".
006020     DISPLAY (20, 45) "40-EST\LOJA-14.: ".
006030     MOVE LOW-VALUE TO CHAVE-05
006040     MOVE ALL ZEROS TO W-LOJA.
006050     START ACE05 KEY IS NOT < CHAVE-05 INVALID KEY MOVE 1 TO ST.
006060     MOVE ZEROS TO IND1-W.
006070 R-1420.
006080     READ ACE05 NEXT RECORD AT END
006090        GO TO R-1450.
006100     IF LOJA-05 = ZEROS OR LOJA-05 > 14
006110        GO TO R-1420.
006120     MOVE COD-01  TO COD-02.
006130     MOVE LOJA-05 TO LOJA-02 IND2-W.
006140     READ ACE02 INVALID KEY
006150        GO TO R-1420.
006160     MOVE QTLOJ-02 TO QTLJ-W(IND2-W).
006170     GO TO R-1420.
006180 R-1450.
006190     IF DECIMAL-EMPCE = "S"
006200        MOVE QTLJ-WR(01) TO ED-DEC DISPLAY (14, 18) ED-DEC
006210        MOVE QTLJ-WR(02) TO ED-DEC DISPLAY (14, 62) ED-DEC
006220        MOVE QTLJ-WR(03) TO ED-DEC DISPLAY (15, 18) ED-DEC
006230        MOVE QTLJ-WR(04) TO ED-DEC DISPLAY (15, 62) ED-DEC
006240        MOVE QTLJ-WR(05) TO ED-DEC DISPLAY (16, 18) ED-DEC
006250        MOVE QTLJ-WR(06) TO ED-DEC DISPLAY (16, 62) ED-DEC
006260        MOVE QTLJ-WR(07) TO ED-DEC DISPLAY (17, 18) ED-DEC
006270        MOVE QTLJ-WR(08) TO ED-DEC DISPLAY (17, 62) ED-DEC
006280        MOVE QTLJ-WR(09) TO ED-DEC DISPLAY (18, 18) ED-DEC
006290        MOVE QTLJ-WR(10) TO ED-DEC DISPLAY (18, 62) ED-DEC
006300        MOVE QTLJ-WR(11) TO ED-DEC DISPLAY (19, 18) ED-DEC
006310        MOVE QTLJ-WR(12) TO ED-DEC DISPLAY (19, 62) ED-DEC
006320        MOVE QTLJ-WR(13) TO ED-DEC DISPLAY (20, 18) ED-DEC
006330        MOVE QTLJ-WR(14) TO ED-DEC DISPLAY (20, 62) ED-DEC
006340     ELSE
006350        MOVE QTLJ-W(01)  TO ED-INT DISPLAY (14, 18) ED-INT
006360        MOVE QTLJ-W(02)  TO ED-INT DISPLAY (14, 62) ED-INT
006370        MOVE QTLJ-W(03)  TO ED-INT DISPLAY (15, 18) ED-INT
006380        MOVE QTLJ-W(04)  TO ED-INT DISPLAY (15, 62) ED-INT
006390        MOVE QTLJ-W(05)  TO ED-INT DISPLAY (16, 18) ED-INT
006400        MOVE QTLJ-W(06)  TO ED-INT DISPLAY (16, 62) ED-INT
006410        MOVE QTLJ-W(07)  TO ED-INT DISPLAY (17, 18) ED-INT
006420        MOVE QTLJ-W(08)  TO ED-INT DISPLAY (17, 62) ED-INT
006430        MOVE QTLJ-W(09)  TO ED-INT DISPLAY (18, 18) ED-INT
006440        MOVE QTLJ-W(10)  TO ED-INT DISPLAY (18, 62) ED-INT
006450        MOVE QTLJ-W(11)  TO ED-INT DISPLAY (19, 18) ED-INT
006460        MOVE QTLJ-W(12)  TO ED-INT DISPLAY (19, 62) ED-INT
006470        MOVE QTLJ-W(13)  TO ED-INT DISPLAY (20, 18) ED-INT
006480        MOVE QTLJ-W(14)  TO ED-INT DISPLAY (20, 62) ED-INT.
006490 R-1500.
006500     DISPLAY (22, 14) "CONTINUAR (S\<N>:-> ".
006510     ACCEPT (22, 34) CR WITH UPDATE
006520     DISPLAY (22, 14) EX-MENS
006530     IF CR NOT = "S" GO TO R-0100.
006540     IF CONT = "S"
006550        GO TO ROT-P
006560     ELSE
006570        GO TO R-0900.
006580 ROT-A.
006590     MOVE "ALTERACAO DE PRODUTOS NA EMPRESA" TO INFT.
006600     MOVE "TCE1201B" TO TS.
006610     MOVE SPACES TO CR.
006620     PERFORM R-0200.
006630 R-1600.
006640     ACCEPT (07, 09) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
006650     IF E = "01" GO TO R-0090.
006660     MOVE COD-W  TO  COD-01.
006670     READ ACE01 INVALID KEY
006680        DISPLAY (22, 14) "PRODUTO INEXISTENTE-ACE01 FS=>" FS
006690        ACCEPT (22, 78) CR WITH UPDATE
006700        DISPLAY (22, 14) EX-MENS
006710        GO TO R-1600.
006720     MOVE COD-01 TO  COD-02.
006730     MOVE EST-01 TO  EST-W.
006740     START ACE02 KEY IS NOT < COD-02 INVALID KEY
006750        GO TO R-1800.
006760 R-1700.
006770     READ ACE02 NEXT RECORD AT END
006780        MOVE LOW-VALUE  TO COD-02.
006790     IF COD-02 = COD-01
006800        ADD QTLOJ-02 TO EST-W
006810        GO TO R-1700.
006820 R-1800.
006830     DISPLAY (07, 30) DESC-01.
006840     ACCEPT (07, 30) DESC-01 WITH UPDATE.
006850     DISPLAY (22, 14) "ALTERAR OS ACUMULADORES ? (S\<N>):."
006860     ACCEPT (22, 48) CR WITH UPDATE.
006870     DISPLAY (22, 14) EX-MENS.
006880     IF CR NOT = "S"
006890        GO TO R-5400.
006900     PERFORM R-0400.
006910     PERFORM R-0700.
006920 R-1900.
006930     MOVE SPACES TO CR.
006940     MOVE ZEROS TO CAMP-W.
006950     DISPLAY (22, 14) "CAMPO A SER ALTERADO:--> ..".
006960     ACCEPT (22, 39) CAMP-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
006970     IF E = "01"
006980        DISPLAY (22, 14) EX-MENS
006990        GO TO ROT-A.
007000     IF CAMP-W = SPACES OR 0
007010        DISPLAY (22, 14)
007020        "CAMPO NAO PODE SER = 0 OU ESPACO - REDIGITAR"
007030        ACCEPT (22, 58) CR WITH UPDATE
007040        DISPLAY (22, 14) EX-MENS
007050        GO TO R-1900.
007060     IF CAMP-W < 4 OR > 40 GO TO R-1900.
007070 R-2000.
007080     IF CAMP-W  = 04  PERFORM R-2100 GO TO R-5300.
007090     IF CAMP-W  = 05  PERFORM R-2200 GO TO R-1900.
007100     IF CAMP-W  = 06  PERFORM R-2300 GO TO R-5300.
007110     IF CAMP-W  = 07  PERFORM R-2400 GO TO R-5300.
007120     IF CAMP-W  = 08  PERFORM R-2500 GO TO R-5300.
007130     IF CAMP-W  = 09  PERFORM R-2600 GO TO R-5300.
007140     IF CAMP-W  = 10  PERFORM R-2700 GO TO R-5300.
007150     IF CAMP-W  = 11  PERFORM R-2800 GO TO R-5300.
007160     IF CAMP-W  = 12  PERFORM R-2900 GO TO R-5300.
007170     IF CAMP-W  = 13  PERFORM R-3000 GO TO R-5300.
007180     IF CAMP-W  = 14  PERFORM R-3100 GO TO R-5300.
007190     IF CAMP-W  = 15  PERFORM R-3200 GO TO R-5300.
007200     IF CAMP-W  = 16  PERFORM R-3300 GO TO R-5300.
007210     IF CAMP-W  = 17  PERFORM R-3400 GO TO R-5300.
007220     IF CAMP-W  = 18  PERFORM R-3500 GO TO R-5300.
007230     IF CAMP-W  = 19  PERFORM R-3600 GO TO R-5300.
007240     IF CAMP-W  = 20  PERFORM R-3700 GO TO R-5300.
007250     IF CAMP-W  = 21  PERFORM R-3800 GO TO R-5300.
007260     IF CAMP-W  = 22  PERFORM R-3900 GO TO R-5300.
007270     IF CAMP-W  = 23  PERFORM R-4000 GO TO R-5300.
007280     IF CAMP-W  = 24  PERFORM R-4100 GO TO R-5300.
007290     IF CAMP-W  = 25  PERFORM R-4110 GO TO R-5300.
007300     IF CAMP-W  = 26  PERFORM R-4200 GO TO R-5300.
007310     IF CAMP-W  = 27  PERFORM R-4300 GO TO R-5300.
007320     IF CAMP-W  = 28  PERFORM R-4350 GO TO R-5300.
007330     IF CAMP-W  = 29  PERFORM R-4400 GO TO R-5300.
007340     IF CAMP-W  = 30  PERFORM R-4500 GO TO R-5300.
007350     IF CAMP-W  = 31  PERFORM R-4550 GO TO R-5300.
007360     IF CAMP-W  = 32  PERFORM R-4600 GO TO R-5300.
007370     IF CAMP-W  = 33  PERFORM R-4700 GO TO R-5300.
007380     IF CAMP-W  = 35  PERFORM R-4800 GO TO R-5300.
007390     IF CAMP-W  = 36  PERFORM R-4900 GO TO R-5300.
007400     IF CAMP-W  = 39  PERFORM R-5000 GO TO R-5300.
007410     IF CAMP-W  = 37  PERFORM R-4801 GO TO R-5300.
007420     IF CAMP-W  = 38  PERFORM R-5100 GO TO R-5300.
007430     GO TO R-1900.
007440 R-2100.
007450     ACCEPT (08, 62) CREAL-01 WITH UPDATE.
007460     MOVE CREAL-01R TO ED3 DISPLAY (08, 62) ED3.
007470 R-2200.
007480     DISPLAY (22, 14) "ESTE CAMPO NAO PODE SER ALTERADO "
007490     ACCEPT (22, 47) CR WITH UPDATE
007500     DISPLAY (22, 14) EX-MENS.
007510 R-2300.
007520     ACCEPT (09, 35) QTSAI-01(01) WITH UPDATE.
007530     IF DECIMAL-EMPCE = "S"
007540        MOVE QTSAI-01R(01) TO ED-DEC DISPLAY (09, 35) ED-DEC
007550     ELSE
007560        MOVE QTSAI-01(01)  TO ED-INT DISPLAY (09, 35) ED-INT.
007570 R-2400.
007580     ACCEPT (09, 62) CMEDIO-01 WITH UPDATE.
007590     MOVE CMEDIO-01R TO ED3 DISPLAY (09, 62) ED3.
007600 R-2500.
007610     ACCEPT (10, 18) ESTMIN-01 WITH UPDATE.
007620     IF DECIMAL-EMPCE = "S"
007630        MOVE ESTMIN-01R TO ED-DEC
007640        DISPLAY (10, 18) ED-DEC
007650     ELSE
007660        MOVE ESTMIN-01 TO ED-INT
007670        DISPLAY (10, 18) ED-INT.
007680 R-2600.
007690     ACCEPT (10, 35) QTSAI-01(02) WITH UPDATE.
007700     IF DECIMAL-EMPCE = "S"
007710        MOVE QTSAI-01R(02) TO ED-DEC DISPLAY (10, 35) ED-DEC
007720     ELSE
007730        MOVE QTSAI-01(02)  TO ED-INT DISPLAY (10, 35) ED-INT.
007740 R-2700.
007750     ACCEPT (10, 62) VRPU-01 WITH UPDATE.
007760     MOVE VRPU-01R TO ED3 DISPLAY (10, 62) ED3.
007770 R-2800.
007780     ACCEPT (11, 18) CODFOR-01 WITH UPDATE.
007790 R-2900.
007800     ACCEPT (11, 35) QTSAI-01(03) WITH UPDATE.
007810     IF DECIMAL-EMPCE = "S"
007820        MOVE QTSAI-01R(03) TO ED-DEC DISPLAY (11, 35) ED-DEC
007830     ELSE
007840        MOVE QTSAI-01(03)  TO ED-INT DISPLAY (11, 35) ED-INT.
007850 R-3000.
007860     ACCEPT (11, 62) CATUAL-01 WITH UPDATE.
007870     MOVE CATUAL-01R TO ED3 DISPLAY (11, 62) ED3.
007880 R-3100.
007890     ACCEPT (12, 18) CONDPG-01 WITH UPDATE.
007900 R-3200.
007910     ACCEPT (12, 35) QTSAI-01(04) WITH UPDATE.
007920     IF DECIMAL-EMPCE = "S"
007930        MOVE QTSAI-01R(04) TO ED-DEC DISPLAY (12, 35) ED-DEC
007940     ELSE
007950        MOVE QTSAI-01(04)  TO ED-INT DISPLAY (12, 35) ED-INT.
007960 R-3300.
007970     ACCEPT (12, 62) PRVAR-01 WITH UPDATE.
007980     MOVE PRVAR-01R TO ED3 DISPLAY (12, 62) ED3.
007990 R-3400.
008000     ACCEPT (13, 18) CLASSECE-01 WITH UPDATE.
008010     IF CLASSECE-01 = SPACES
008020         DISPLAY (22, 14) "CLASSE NAO DIGITADA !!!!!"
008030         ACCEPT (22, 39) CR WITH UPDATE
008040         DISPLAY (22, 14) EX-MENS
008050         GO TO R-3400.
008060 R-3500.
008070     ACCEPT (13, 35) QTSAI-01(05) WITH UPDATE.
008080     IF DECIMAL-EMPCE = "S"
008090        MOVE QTSAI-01R(05) TO ED-DEC DISPLAY (13, 35) ED-DEC
008100     ELSE
008110        MOVE QTSAI-01(05)  TO ED-INT DISPLAY (13, 35) ED-INT.
008120 R-3600.
008130     ACCEPT (13, 62) PRATAC-01 WITH UPDATE.
008140     MOVE PRATAC-01R TO ED3 DISPLAY (13, 62) ED3.
008150 R-3700.
008160     ACCEPT (14, 18) DIACAD-01 WITH UPDATE.
008170     ACCEPT (14, 21) MESCAD-01 WITH UPDATE.
008180     ACCEPT (14, 24) ANOCAD-01 WITH UPDATE.
008190 R-3800.
008200     ACCEPT (14, 35) QTSAI-01(06) WITH UPDATE.
008210     IF DECIMAL-EMPCE = "S"
008220        MOVE QTSAI-01R(06) TO ED-DEC DISPLAY (14, 35) ED-DEC
008230     ELSE
008240        MOVE QTSAI-01(06)  TO ED-INT DISPLAY (14, 35) ED-INT.
008250 R-3900.
008260     ACCEPT (14, 62) CODTAB-01 WITH UPDATE.
008270 R-4000.
008280     ACCEPT (15, 18) DIACUSTO-01 WITH UPDATE.
008290     ACCEPT (15, 21) MESCUSTO-01 WITH UPDATE.
008300     ACCEPT (15, 24) ANOCUSTO-01 WITH UPDATE.
008310 R-4100.
008320     ACCEPT (15, 35) QTSAI-01(07) WITH UPDATE.
008330     IF DECIMAL-EMPCE = "S"
008340        MOVE QTSAI-01R(07) TO ED-DEC DISPLAY (15, 35) ED-DEC
008350     ELSE
008360        MOVE QTSAI-01(07)  TO ED-INT DISPLAY (15, 35) ED-INT.
008370 R-4110.
008380     ACCEPT (15, 62) EMB-01 WITH UPDATE.
008390 R-4200.
008400     ACCEPT (16, 18) MESNOV-01 WITH UPDATE.
008410     ACCEPT (16, 22) ANONOV-01 WITH UPDATE.
008420 R-4300.
008430     ACCEPT (16, 35) QTSAI-01(08) WITH UPDATE.
008440     IF DECIMAL-EMPCE = "S"
008450        MOVE QTSAI-01R(08) TO ED-DEC DISPLAY (16, 35) ED-DEC
008460     ELSE
008470        MOVE QTSAI-01(08)  TO ED-INT DISPLAY (16, 35) ED-INT.
008480 R-4350.
008490     ACCEPT (16, 62) DIAINF-01 WITH UPDATE
008500         AUTO-SKIP.
008510     ACCEPT (16, 65) MESINF-01 WITH UPDATE.
008520 R-4400.
008530     ACCEPT (17, 18) QTPED-01 WITH UPDATE.
008540     IF DECIMAL-EMPCE = "S"
008550        MOVE QTPED-01R TO ED-DEC
008560        DISPLAY (17, 18) ED-DEC
008570     ELSE
008580        MOVE QTPED-01 TO ED-INT
008590        DISPLAY (17, 18) ED-INT.
008600 R-4500.
008610     ACCEPT (17, 35) QTSAI-01(09) WITH UPDATE.
008620     IF DECIMAL-EMPCE = "S"
008630        MOVE QTSAI-01R(09) TO ED-DEC DISPLAY (17, 35) ED-DEC
008640     ELSE
008650        MOVE QTSAI-01(09)  TO ED-INT DISPLAY (17, 35) ED-INT.
008660 R-4550.
008670     IF ARTIGO-01 NOT NUMERIC MOVE ZEROS TO ARTIGO-01.
008680     ACCEPT (17, 62) ARTIGO-01 WITH UPDATE.
008690 R-4600.
008700     ACCEPT (18, 18) QTENT-01 WITH UPDATE.
008710     IF DECIMAL-EMPCE = "S"
008720        MOVE QTENT-01R TO ED-DEC DISPLAY (18, 18) ED-DEC
008730     ELSE
008740        MOVE QTENT-01 TO ED-INT DISPLAY (18, 18) ED-INT.
008750 R-4700.
008760     ACCEPT (18, 35) QTSAI-01(10) WITH UPDATE.
008770     IF DECIMAL-EMPCE = "S"
008780        MOVE QTSAI-01R(10) TO ED-DEC DISPLAY (18, 35) ED-DEC
008790     ELSE
008800        MOVE QTSAI-01(10)  TO ED-INT DISPLAY (18, 35) ED-INT.
008810 R-4800.
008820     ACCEPT (19, 18) UND-01 WITH UPDATE.
008830 R-4801.
008840     ACCEPT (19, 62) CODTRI-01 WITH UPDATE.
008850 R-4900.
008860     ACCEPT (19, 35) QTSAI-01(11) WITH UPDATE.
008870     IF DECIMAL-EMPCE = "S"
008880        MOVE QTSAI-01R(11) TO ED-DEC DISPLAY (19, 35) ED-DEC
008890     ELSE
008900        MOVE QTSAI-01(11)  TO ED-INT DISPLAY (19, 35) ED-INT.
008910 R-5000.
008920     ACCEPT (20, 35) QTSAI-01(12) WITH UPDATE.
008930     IF DECIMAL-EMPCE = "S"
008940        MOVE QTSAI-01R(12) TO ED-DEC DISPLAY (20, 35) ED-DEC
008950     ELSE
008960        MOVE QTSAI-01(12)  TO ED-INT DISPLAY (20, 35) ED-INT.
008970 R-5100.
008980     ACCEPT (20, 18) LIVRO-01 WITH UPDATE.
008990 R-5300.
009000     DISPLAY (22, 14) "CONFIRMA ALTERACAO (S\<N>):.".
009010     ACCEPT (22, 42) CR WITH UPDATE
009020     DISPLAY (22, 14) EX-MENS.
009030     IF CR NOT = "S"
009040        GO TO ROT-A.
009050     REWRITE REG-01 INVALID KEY
009060        DISPLAY (22, 14) "ERRO NA REGRAVACAO DO ACE01=>" FS
009070        ACCEPT (22, 78) CR WITH UPDATE
009080        DISPLAY (22, 14) EX-MENS
009090        GO TO ROT-A.
009100     DISPLAY (22, 14) "ALTERACAO COM EXITO "
009110     ACCEPT (22, 33) CR WITH UPDATE
009120     DISPLAY (22, 14) EX-MENS
009130     DISPLAY (22, 14) "ALTERAR MAIS ALGUM CAMPO (S\<N>):".
009140     ACCEPT (22, 47) CR WITH UPDATE.
009150     DISPLAY (22, 14) EX-MENS.
009160     IF CR NOT = "S"
009170        GO TO ROT-A.
009180     GO TO R-1900.
009190 R-5400.
009200     MOVE SPACES TO CR.
009210     DISPLAY (22, 14) "CONFIRMA ALTERACAO (S\<N>):.".
009220     ACCEPT (22, 42) CR WITH UPDATE
009230     DISPLAY (22, 14) EX-MENS.
009240     IF CR NOT = "S"
009250        GO TO ROT-A.
009260     REWRITE REG-01 INVALID KEY
009270        DISPLAY (22, 14) "ERRO NA REGRAVACAO DO ACE01=>" FS
009280        ACCEPT (22, 78) CR WITH UPDATE
009290        DISPLAY (22, 14) EX-MENS
009300        GO TO ROT-A.
009310     DISPLAY (22, 14) "ALTERACAO COM EXITO".
009320     ACCEPT (22, 34) CR WITH UPDATE.
009330     DISPLAY (22, 14) EX-MENS.
009340     GO TO ROT-A.
009350 ROT-L.
009360     MOVE "TCE1201E" TO TS.
009370     MOVE "RELATORIO DE PRODUTOS NA EMPRESA" TO INFT.
009380     MOVE 70 TO CTL.
009390 COPY "\dados1\book\CPYTPCE".
009400     DISPLAY (08, 26) "CODIGO INICIAL:---> ......".
009410     DISPLAY (10, 26) "CODIGO FINAL:-----> ......".
009420 R-5500.
009430     ACCEPT (08, 46) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
009440     IF E = "01"
009450        GO TO R-0090.
009460 R-5600.
009470     ACCEPT (10, 46) COD-F WITH UPDATE.
009480 R-5700.
009490     DISPLAY (22, 14) "CONFIRMA: (S\<N>):"
009500     ACCEPT (22, 33) CR WITH UPDATE.
009510     IF CR NOT = "S"
009520        DISPLAY (22, 14) EX-MENS
009530        GO TO ROT-L.
009540 R-5750.
009550     DISPLAY (22, 14) EX-MENS.
009560     MOVE COD-W  TO  COD-01.
009570     START ACE01 KEY IS NOT < COD-01 INVALID KEY
009580        DISPLAY (22, 14) "CODIGO INVALIDO REDIGITE "
009590        ACCEPT (22, 39) CR WITH UPDATE
009600        DISPLAY (22, 14) EX-MENS
009610        GO TO ROT-L.
009620     OPEN OUTPUT RELATO.
009630     IF FS NOT = "00"
009640        MOVE "MCE1201C" TO CODMENFS
009650        MOVE "RELATO"      TO ARQFS
009660        PERFORM TESTA-FS THRU SAI-TESTA-FS
009670        CLOSE RELATO GO TO R-9999.
009680 R-5800.
009690     READ ACE01 NEXT RECORD AT END
009700        CLOSE RELATO
009710        GO TO R-0100.
009720     IF COD-01 > COD-F
009730        CLOSE RELATO
009740        GO TO R-0100.
009750 R-5810.
009760     IF CTL  > 60
009770        ADD 1 TO CTP  MOVE CTP TO PAG-CAB1B
009780        WRITE REG-RELATO FROM CAB1B AFTER PAGE
009790        WRITE REG-RELATO FROM CAB2B AFTER 1
009800        WRITE REG-RELATO FROM CAB80 AFTER 1
009810        WRITE REG-RELATO FROM CAB2 AFTER 1
009820        WRITE REG-RELATO FROM CAB80 AFTER 1
009830        MOVE 05 TO CTL.
009840 R-05850.
009850     MOVE EST-01 TO EST-W.
009860     MOVE COD-01 TO COD-02.
009870     START ACE02 KEY IS NOT < COD-02 INVALID KEY MOVE 1 TO ST.
009880 R-5900.
009890     READ ACE02 NEXT RECORD AT END
009900        MOVE LOW-VALUE  TO COD-02.
009910     IF COD-02 = COD-01
009920        ADD QTLOJ-02 TO EST-W
009930        GO TO R-5900.
009940     MOVE COD-01       TO COD-4.
009950     MOVE DESC-01      TO DESC-4.
009960     IF DECIMAL-EMPCE = "S"
009970        MOVE EST-WR TO ED-DEC
009980        MOVE ED-DEC TO ESTG-5
009990     ELSE
010000        MOVE EST-W TO ED-INT
010010        MOVE ED-INT  TO ESTG-5.
010020     IF DECIMAL-EMPCE = "S"
010030        MOVE EST-01R TO ED-DEC
010040        MOVE ED-DEC TO ESTDEP-6
010050     ELSE
010060        MOVE EST-01 TO ED-INT
010070        MOVE ED-INT  TO ESTDEP-6.
010080     IF DECIMAL-EMPCE = "S"
010090        MOVE ESTMIN-01R TO ED-DEC
010100        MOVE ED-DEC    TO ESTMIN-7
010110     ELSE
010120        MOVE ESTMIN-01 TO ED-INT
010130        MOVE ED-INT   TO ESTMIN-7.
010140     IF DECIMAL-EMPCE = "S"
010150        MOVE QTSAI-01R(01) TO ED-DEC MOVE ED-DEC TO SAIJAN
010160        MOVE QTSAI-01R(02) TO ED-DEC MOVE ED-DEC TO SAIFEV
010170        MOVE QTSAI-01R(03) TO ED-DEC MOVE ED-DEC TO SAIMAR
010180        MOVE QTSAI-01R(04) TO ED-DEC MOVE ED-DEC TO SAIABR
010190        MOVE QTSAI-01R(05) TO ED-DEC MOVE ED-DEC TO SAIMAI
010200        MOVE QTSAI-01R(06) TO ED-DEC MOVE ED-DEC TO SAIJUN
010210        MOVE QTSAI-01R(07) TO ED-DEC MOVE ED-DEC TO SAIJUL
010220        MOVE QTSAI-01R(08) TO ED-DEC MOVE ED-DEC TO SAIAGO
010230        MOVE QTSAI-01R(09) TO ED-DEC MOVE ED-DEC TO SAISET
010240        MOVE QTSAI-01R(10) TO ED-DEC MOVE ED-DEC TO SAIOUT
010250        MOVE QTSAI-01R(11) TO ED-DEC MOVE ED-DEC TO SAINOV
010260        MOVE QTSAI-01R(12) TO ED-DEC MOVE ED-DEC TO SAIDEZ
010270     ELSE
010280        MOVE QTSAI-01(01) TO ED-INT MOVE ED-INT TO SAIJAN
010290        MOVE QTSAI-01(02) TO ED-INT MOVE ED-INT TO SAIFEV
010300        MOVE QTSAI-01(03) TO ED-INT MOVE ED-INT TO SAIMAR
010310        MOVE QTSAI-01(04) TO ED-INT MOVE ED-INT TO SAIABR
010320        MOVE QTSAI-01(05) TO ED-INT MOVE ED-INT TO SAIMAI
010330        MOVE QTSAI-01(06) TO ED-INT MOVE ED-INT TO SAIJUN
010340        MOVE QTSAI-01(07) TO ED-INT MOVE ED-INT TO SAIJUL
010350        MOVE QTSAI-01(08) TO ED-INT MOVE ED-INT TO SAIAGO
010360        MOVE QTSAI-01(09) TO ED-INT MOVE ED-INT TO SAISET
010370        MOVE QTSAI-01(10) TO ED-INT MOVE ED-INT TO SAIOUT
010380        MOVE QTSAI-01(11) TO ED-INT MOVE ED-INT TO SAINOV
010390        MOVE QTSAI-01(12) TO ED-INT MOVE ED-INT TO SAIDEZ.
010400     MOVE CODFOR-01    TO CODFOR-8.
010410     MOVE CONDPG-01    TO PRZMED-9.
010420     MOVE CLASSECE-01    TO CLASSE-10.
010430     MOVE CODTAB-01    TO CODTAB-11.
010440     MOVE LIVRO-01     TO LIVRO-17.
010450     MOVE DIACAD-01    TO DIACAD-11.
010460     MOVE MESCAD-01    TO MESCAD-11.
010470     MOVE ANOCAD-01    TO ANOCAD-11.
010480     MOVE DIACUSTO-01  TO DIACUS-12.
010490     MOVE MESCUSTO-01  TO MESCUS-12.
010500     MOVE ANOCUSTO-01  TO ANOCUS-12.
010510     MOVE MESNOV-01    TO MESNOV-13.
010520     MOVE ANONOV-01    TO ANONOV-13.
010530     MOVE DIAINF-01    TO DIAINF-13.
010540     MOVE MESINF-01    TO MESINF-13.
010550     IF DECIMAL-EMPCE = "S"
010560        MOVE QTPED-01R TO ED-DEC
010570        MOVE ED-DEC TO QTPED-14
010580     ELSE
010590        MOVE QTPED-01 TO ED-INT
010600        MOVE ED-INT  TO QTPED-14.
010610     IF DECIMAL-EMPCE = "S"
010620        MOVE QTENT-01R TO ED-DEC
010630        MOVE ED-DEC    TO QTENT-15
010640     ELSE
010650        MOVE QTENT-01 TO ED-INT
010660        MOVE ED-INT   TO QTENT-15.
010670     MOVE UND-01       TO UNID-16.
010680     MOVE EMB-01       TO EMB-16.
010690     MOVE CREAL-01R    TO CUSTREAL-5.
010700     MOVE CMEDIO-01R   TO CUSTMED-6.
010710     MOVE VRPU-01R     TO VRPU-7.
010720     MOVE CATUAL-01R   TO CUSTATU-8.
010730     MOVE PRVAR-01R    TO PRVAR-9.
010740     MOVE PRATAC-01R   TO PRATAC-10.
010750 R-6000.
010760     PERFORM R-5810.
010770     WRITE REG-RELATO FROM CAB4  AFTER 1
010780     ADD 1 TO CTL.
010790     PERFORM R-5810.
010800     WRITE REG-RELATO FROM CAB5  AFTER 1
010810     ADD 1 TO CTL.
010820     PERFORM R-5810.
010830     WRITE REG-RELATO FROM CAB6  AFTER 1
010840     ADD 1 TO CTL.
010850     PERFORM R-5810.
010860     WRITE REG-RELATO FROM CAB7  AFTER 1
010870     ADD 1 TO CTL.
010880     PERFORM R-5810.
010890     WRITE REG-RELATO FROM CAB8  AFTER 1
010900     ADD 1 TO CTL.
010910     PERFORM R-5810.
010920     WRITE REG-RELATO FROM CAB9  AFTER 1
010930     ADD 1 TO CTL.
010940     PERFORM R-5810.
010950     WRITE REG-RELATO FROM CAB10 AFTER 1
010960     ADD 1 TO CTL.
010970     PERFORM R-5810.
010980     WRITE REG-RELATO FROM CAB11 AFTER 1
010990     ADD 1 TO CTL.
011000     PERFORM R-5810.
011010     WRITE REG-RELATO FROM CAB12 AFTER 1
011020     ADD 1 TO CTL.
011030     PERFORM R-5810.
011040     WRITE REG-RELATO FROM CAB13 AFTER 1
011050     ADD 1 TO CTL.
011060     PERFORM R-5810.
011070     WRITE REG-RELATO FROM CAB14 AFTER 1
011080     ADD 1 TO CTL.
011090     PERFORM R-5810.
011100     WRITE REG-RELATO FROM CAB15 AFTER 1
011110     ADD 1 TO CTL.
011120     PERFORM R-5810.
011130     WRITE REG-RELATO FROM CAB16 AFTER 1
011140     ADD 1 TO CTL.
011150     PERFORM R-5810.
011160     WRITE REG-RELATO FROM CAB17 AFTER 1
011170     ADD 1 TO CTL.
011180     PERFORM R-5810.
011190     WRITE REG-RELATO FROM CAB3  AFTER 2
011200     ADD 2 TO CTL.
011210     MOVE SPACES TO CHAVE-05
011220     START ACE05 KEY IS NOT < CHAVE-05 INVALID KEY MOVE 1 TO ST.
011230 R-6100.
011240     PERFORM R-5810.
011250 R-6200.
011260     READ ACE05 NEXT RECORD AT END
011270        WRITE REG-RELATO FROM CAB80 AFTER 1
011280        ADD 1 TO CTL GO TO R-5800.
011290 R-6300.
011300     MOVE COD-01  TO COD-02.
011310     MOVE LOJA-05 TO LOJA-02.
011320     READ ACE02 INVALID KEY
011330        GO TO R-6100.
011340     IF QTLOJ-02 = 0 GO TO  R-6100.
011350     MOVE LOJA-02   TO LOJA-18
011360     IF DECIMAL-EMPCE = "S"
011370        MOVE QTLOJ-02R TO ED-DEC MOVE ED-DEC TO QTL-18
011380        MOVE QTREP-02R TO ED-DEC MOVE ED-DEC TO QTR-18
011390        MOVE QTMIN-02R TO ED-DEC MOVE ED-DEC TO QTM-18
011400        MOVE QTSAI-02R TO ED-DEC MOVE ED-DEC TO QTSAI-18
011410     ELSE
011420        MOVE QTLOJ-02 TO ED-INT MOVE ED-INT TO QTL-18
011430        MOVE QTREP-02 TO ED-INT MOVE ED-INT TO QTR-18
011440        MOVE QTMIN-02 TO ED-INT MOVE ED-INT TO QTM-18
011450        MOVE QTSAI-02 TO ED-INT MOVE ED-INT TO QTSAI-18.
011460     MOVE MESNOV-02 TO MM-18
011470     MOVE ANONOV-02 TO AA-18
011480     MOVE VED-02R   TO VENDA-18
011490     WRITE REG-RELATO FROM CAB18 AFTER 1
011500     ADD 1 TO CTL.
011510     GO TO R-6100.
011520 R-9999.
011530     CLOSE ACE01 ACE02 ACE05.
011540     EXIT PROGRAM.

001920 COPY "\dados1\book\CPYPDFS".
011550*=============F=I=M=================
