000010*************************************************
000020* SCE1401-ATUALIZACAO NO CADASTRO DE FORNECEDOR COMP 2005*
000030*************************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE1401.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-07".
000080     SELECT  REL      ASSIGN TO PRINTER
000090                      FILE STATUS IS FS.
000100     SELECT  ACEAUX   ASSIGN TO DISK
000110                      ORGANIZATION IS INDEXED
000120                      ACCESS MODE IS DYNAMIC
                            LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000130                      RECORD KEY IS CHAVE-AUX
000140                      ALTERNATE RECORD KEY IS NOMEFOR-AUX
000150                      WITH DUPLICATES
000160                      FILE STATUS IS FS.
000170 COPY "/dados1/book/FDCE".
000180 COPY "/dados1/book/FD-07".
000190 FD  ACEAUX
000200     VALUE OF FILE-ID IS "ACEAUX".
000210 01  REG-AUX.
000220     03 CHAVE-AUX.
000230        05 CODFOR-AUX  PIC 9999.
000240        05 CODFOR-AUXR REDEFINES
000250           CODFOR-AUX  PIC X(4).
000260     03 NOMEFOR-AUX    PIC X(30).
000270     03 ENDERECO-AUX.
000280        05 ENDFOR-AUX  PIC X(35).
000290        05 CIDFOR-AUX  PIC X(20).
000300        05 CEPFOR-AUX  PIC 9(05).
000310        05 UFFOR-AUX   PIC XX.
000320     03 CONTATO-AUX.
000330        05 TELFOR-AUX  PIC 9(08).
000340        05 RAMFOR-AUX  PIC 999.
000350        05 IDDFOR-AUX  PIC 99.
000360     03 FILLER        PIC XX.
000370     03 CGC-AUX.
000380        05 DIF-CGC-AUX PIC 999.
000390        05 FILLER     PIC 9(11).
000400     03 INSCR-AUX      PIC 9(13).
000410     03 CCEPFOR-AUX    PIC 9(03).
000420     03 FRETE-AUX      PIC 9(05).
000430     03 FRETE-AUXR REDEFINES FRETE-AUX PIC 9(02)V999.
000440     03 DESC-AUX       PIC 9(05).
000450     03 DESC-AUXR REDEFINES DESC-AUX PIC 9(02)V999.
000460     03 TXIPI-AUX      PIC 9(05).
000470     03 TXIPI-AUXR REDEFINES TXIPI-AUX PIC 9(02)V999.
000480     03 REP-AUX        PIC X(25).
000490     03 TELREP1-AUX.
000500        05 DREP1-AUX   PIC 9(02).
000510        05 PREP1-AUX   PIC 9(04).
000520        05 FONREP1-AUX PIC 9(04).
000530     03 TELEP2-AUX.
000540        05 DREP2-AUX   PIC 9(02).
000550        05 PREP2-AUX   PIC 9(04).
000560        05 FONREP2-AUX PIC 9(04).
000570     03 FAXREP1-AUX.
000580        05 DREP3-AUX   PIC 9(02).
000590        05 PREP3-AUX   PIC 9(04).
000600        05 FONREP3-AUX PIC 9(04).
000610     03 FAXFOR-AUX.
000620        05 DFOR1-AUX   PIC 9(02).
000630        05 PFOR1-AUX   PIC 9(04).
000640        05 FONFOR1-AUX PIC 9(04).
000650     03 OBS-AUX        PIC X(30).
000660     03 FILLER        PIC X(05).
000670 COPY "/dados1/book/FDREL132".
000680 COPY "/dados1/book/TAB-W".
000690 01 TELREP1-W.
000700    03 DREP1-W   PIC 9(02).
000710    03 PREP1-W   PIC 9(04).
000720    03 FONREP1-W PIC 9(04).
000730 01 TELREP2-W.
000740    03 DREP2-W   PIC 9(02).
000750    03 PREP2-W   PIC 9(04).
000760    03 FONREP2-W PIC 9(04).
000770 01 FAXREP1-W.
000780    03 DREP3-W   PIC 9(02).
000790    03 PREP3-W   PIC 9(04).
000800    03 FONREP3-W PIC 9(04).
000810 01 FAXFOR-W.
000820    03 DFOR1-W   PIC 9(02).
000830    03 PFOR1-W   PIC 9(04).
000840    03 FONFOR1-W PIC 9(04).
000850 01 TEL-ED.
000860    03 DDD-ED    PIC 9(02).
000870    03 TR-ED     PIC X.
000880    03 PREF-ED   PIC 9(04).
000890    03 PO-ED     PIC X.
000900    03 FONE-ED   PIC 9(04).
000910 01 TEL-ANT.
000920    03 T1-ANT    PIC 9(04).
000930    03 T2-ANT    PIC 9(04).
000940 01 TELFOR1-W.
000950    03 DTEL1-W   PIC 9(02).
000960    03 PTEL1-W   PIC 9(04).
000970    03 FONTEL1-W PIC 9(04).
000980 COPY "/dados1/book/WCGCCPF".
000990 01  CODFOR-W          PIC 9(04) VALUE ZEROS.
001000 77  W-CHAVE           PIC 9     VALUE ZEROS.
001010 77  FORN-I            PIC 9(04) VALUE ZEROS.
001020 77  FORN-F            PIC 9(04) VALUE ZEROS.
001030 01  ED1               PIC ZZ,ZZZ VALUE ZEROS.
001040 01  WTEL-AUX.
001050     05 WPRE-AUX       PIC 9999   VALUE ZEROS.
001060     05 WUF-AUX        PIC 9999  VALUE ZEROS.
001070 01  CAB3.
001080     05 FILLER         PIC X(40) VALUE SPACES.
001090     05 FILLER         PIC X(37) VALUE
001100     "RELATORIO DE FORNECEDORES POR ORDEM ".
001110     05 TIPO-3         PIC X(10) VALUE SPACES.
001120 01  CAB4.
001130     05 FILLER         PIC X(18) VALUE " COD".
001140     05 FILLER         PIC X(28) VALUE "N O M E".
001150     05 FILLER         PIC X(19) VALUE "C G C".
001160     05 FILLER         PIC X(09) VALUE "INSCRICAO".
001170 01  CAB5.
001180     05 FILLER         PIC X(13) VALUE SPACES.
001190     05 FILLER         PIC X(30) VALUE "E N D E R E C O".
001200     05 FILLER         PIC X(15) VALUE "C  E  P".
001210     05 FILLER         PIC X(20) VALUE "CIDADE".
001220     05 FILLER         PIC X(07) VALUE "UF".
001230     05 FILLER         PIC X(08) VALUE "DDD".
001240     05 FILLER         PIC X(12) VALUE "TELEFONE".
001250     05 FILLER         PIC X(08) VALUE "RAM".
001260 01  CAB6.
001270     05 FILLER         PIC X     VALUE SPACES.
001280     05 COD-6          PIC 9999  VALUE ZEROS.
001290     05 FILLER         PIC XX    VALUE SPACES.
001300     05 NOME-6         PIC X(30) VALUE SPACES.
001310     05 FILLER         PIC XXX   VALUE SPACES.
001320     05 CGC-6          PIC X(18) VALUE SPACES.
001330     05 FILLER         PIC XX    VALUE SPACES.
001340     05 INSCR-6        PIC 999.999999.9999 VALUE ZEROS.
001350 01  CAB7.
001360     05 FILLER         PIC X     VALUE SPACES.
001370     05 ENDER-6        PIC X(35) VALUE SPACES.
001380     05 FILLER         PIC X(06) VALUE SPACES.
001390     05 CEP-7          PIC 9(05) VALUE ZEROS.
001400     05 FILLER         PIC X(01) VALUE "-".
001410     05 CCEP-7         PIC 9(03) VALUE ZEROS.
001420     05 FILLER         PIC X(01) VALUE SPACES.
001430     05 CID-7          PIC X(20) VALUE SPACES.
001440     05 FILLER         PIC X(06) VALUE  SPACES.
001450     05 UF-7           PIC XX    VALUE SPACES.
001460     05 FILLER         PIC X(04) VALUE SPACES.
001470     05 FILLER         PIC X     VALUE "(".
001480     05 DDD-7          PIC ZZ VALUE ZEROS.
001490     05 FILLER         PIC X     VALUE ")".
001500     05 FILLER         PIC X(04) VALUE SPACES.
001510     05 PRETEL-7       PIC ZZZZ VALUE ZEROS.
001520     05 FILLER         PIC X(01) VALUE "-".
001530     05 SUFTEL-7       PIC ZZZZZ VALUE ZEROS.
001540     05 FILLER         PIC X(04) VALUE SPACES.
001550     05 RAM-7          PIC ZZZ VALUE ZEROS.
001560 COPY "/dados1/book/CPYPDCE".
001570 COPY "/dados1/book/CPYPDFS".
001580 R-0000.
001590 COPY "/dados1/book/PDIMP".
001600     OPEN I-O ACE07.
001610     IF FS NOT = "00"
001620        MOVE "MCE1401A" TO CODMENFS
001630        MOVE "ACE07"     TO ARQFS
001640        PERFORM TESTA-FS THRU SAI-TESTA-FS
001650        CLOSE ACE07 STOP RUN.
001660     OPEN OUTPUT REL.
001670     IF FS NOT = "00"
001680        MOVE "MCE1401B" TO CODMENFS
001690        MOVE "RELATO"      TO ARQFS
001700        PERFORM TESTA-FS THRU SAI-TESTA-FS
001710        CLOSE ACE07 REL STOP RUN.
001720 R-0100.
001730     MOVE "ATUALIZACAO DE FORNECEDORES" TO INFT.
001740     MOVE "TCE1401"                     TO TS.
001750     MOVE 70 TO CTL.
001760     MOVE 0  TO CTP.
001770 COPY "/dados1/book/CPYTPCE".
001780     DISPLAY (08, 69) "<L>ISTAGEM".
001790 COPY "/dados1/book/CPYTMCE".
001800     IF OPCAO = "L" GO TO ROT-L.
001810     GO TO R-8888.
001820 R-0200.
001830 COPY "/dados1/book/CPYTPCE".
001840     DISPLAY (06, 07)
001850     "REPRES..: .........................".
001860     DISPLAY (08, 07) "TELR1...: ..........".
001870     DISPLAY (08, 36) "TELR2: ..........".
001880     DISPLAY (08, 60) "FAXR.: ..........".
001890     DISPLAY (10, 07) "CODIGO..: .... ".
001900     DISPLAY (10, 24)
001910     "NOME....: ..............................".
001920     DISPLAY (12, 07)
001930     "ENDERECO: ...................................".
001940     DISPLAY (14, 07)
001950     "CIDADE..: ....................".
001960     DISPLAY (14, 41)
001970     "C.E.P.: .....-...      U F..: ..".
001980     DISPLAY (16, 07) "TELF1...: ..........".
001990     DISPLAY (16, 60) "FAXF.: ..........".
002000     DISPLAY (18, 07) "C.G.C/MF:                     ".
002010     DISPLAY (18, 41) "INSCR.: .............".
002020     DISPLAY (20, 07) "DESCONTO: ..,.. ".
002030     DISPLAY (20, 41)
002040     "FRETE.: ..,..          I P I: ..,..".
002050     DISPLAY (21, 07) "OBS.....:                     ".
002060 R-0300.
002070     MOVE ZEROS TO TEL-ED.
002080     MOVE SPACES TO TR-ED PO-ED.
002090     DISPLAY (06, 17) REP-07
002100     MOVE "-" TO TR-ED.
002110     MOVE "." TO PO-ED.
002120     MOVE DREP1-07   TO DDD-ED.
002130     MOVE PREP1-07   TO PREF-ED.
002140     MOVE FONREP1-07 TO FONE-ED.
002150     DISPLAY (08, 17) TEL-ED.
002160     MOVE "-" TO TR-ED.
002170     MOVE "." TO PO-ED.
002180     MOVE DREP2-07   TO DDD-ED.
002190     MOVE PREP2-07   TO PREF-ED.
002200     MOVE FONREP2-07 TO FONE-ED.
002210     DISPLAY (08, 43) TEL-ED.
002220     MOVE "-" TO TR-ED.
002230     MOVE "." TO PO-ED.
002240     MOVE DREP3-07   TO DDD-ED.
002250     MOVE PREP3-07   TO PREF-ED.
002260     MOVE FONREP3-07 TO FONE-ED.
002270     DISPLAY (08, 67) TEL-ED.
002280     DISPLAY (10, 34) NOMEFOR-07
002290     DISPLAY (12, 17) ENDFOR-07
002300     DISPLAY (14, 17) CIDFOR-07
002310     DISPLAY (14, 49) CEPFOR-07
002320     DISPLAY (14, 55) CCEPFOR-07
002330     DISPLAY (14, 71) UFFOR-07
002340     MOVE TELFOR-07 TO TEL-ANT.
002350     MOVE IDDFOR-07 TO DTEL1-W.
002360     MOVE T1-ANT TO PTEL1-W.
002370     MOVE T2-ANT TO FONTEL1-W.
002380     MOVE "-" TO TR-ED.
002390     MOVE "." TO PO-ED.
002400     MOVE DTEL1-W    TO DDD-ED.
002410     MOVE PTEL1-W    TO PREF-ED.
002420     MOVE FONTEL1-W  TO FONE-ED.
002430     DISPLAY (16, 17) TEL-ED.
002440     MOVE "-" TO TR-ED.
002450     MOVE "." TO PO-ED.
002460     MOVE DFOR1-07   TO DDD-ED.
002470     MOVE PFOR1-07   TO PREF-ED.
002480     MOVE FONFOR1-07 TO FONE-ED.
002490     DISPLAY (16, 67) TEL-ED.
002500     MOVE CGC-07 TO CGC-WS CGCCPF CPF-ED.
002510     IF DIF-CGC-07 = ZEROS
002520        MOVE CPF1-ED TO EDI-CPF1
002530        MOVE CPF2-ED TO EDI-CPF2
002540        DISPLAY (18, 17) EDI-CPF
002550     ELSE
002560        MOVE CGC1-ED TO EDI-CGC1
002570        MOVE CGC2-ED TO EDI-CGC2
002580        DISPLAY (18, 17) EDI-CGC.
002590     DISPLAY (18, 49) INSCR-07.
002600     MOVE DESC-07R  TO ED1 DISPLAY (20, 17) ED1.
002610     MOVE FRETE-07R TO ED1 DISPLAY (20, 49) ED1.
002620     MOVE TXIPI-07R TO ED1 DISPLAY (20, 71) ED1.
002630     DISPLAY (21, 17) OBS-07.
002640 ROT-I.
002650     MOVE "INCLUSAO DE FORNECEDORES" TO INFT.
002660     MOVE "TCE1401A"                 TO TS.
002670     PERFORM R-0200.
002680     MOVE ALL ZEROS TO REG-07.
002690     MOVE SPACES TO NOMEFOR-07 ENDFOR-07 CIDFOR-07 UFFOR-07.
002700 R-0400.
002710     ACCEPT (10, 17) CODFOR-W WITH UPDATE
002720        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002730     IF E = "01" GO TO R-0100.
002740     IF CODFOR-W = 0
002750        DISPLAY (22, 14) "CODIGO INVALIDO"
002760        ACCEPT (22, 53) CR WITH UPDATE
002770        DISPLAY (22, 14) EX-MENS
002780        GO TO R-0400.
002790     MOVE CODFOR-W TO CODFOR-07.
002800     READ ACE07 INVALID KEY
002810        GO TO R-0410.
002820     DISPLAY (22, 14) "FORNECEDOR JA CADASTRADO".
002830     ACCEPT (22, 39) CR WITH UPDATE.
002840     DISPLAY (22, 14) EX-MENS.
002850     GO TO ROT-I.
002860 R-0410.
002870     ACCEPT (06, 17) REP-07 WITH UPDATE
002880        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002890     IF E = "01" GO TO R-0400.
002900 R-0420.
002910     MOVE ZEROS TO TEL-ED.
002920     MOVE SPACES TO TR-ED PO-ED.
002930     ACCEPT (08, 17) TELREP1-07 WITH UPDATE
002940        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002950     IF E = "01" GO TO R-0410.
002960     MOVE "-" TO TR-ED.
002970     MOVE "." TO PO-ED.
002980     MOVE DREP1-07   TO DDD-ED.
002990     MOVE PREP1-07   TO PREF-ED.
003000     MOVE FONREP1-07 TO FONE-ED.
003010     DISPLAY (08, 17) TEL-ED.
003020 R-0430.
003030     ACCEPT (08, 43) TELREP2-07 WITH UPDATE
003040        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003050     IF E = "01" GO TO R-0420.
003060     MOVE "-" TO TR-ED.
003070     MOVE "." TO PO-ED.
003080     MOVE DREP2-07   TO DDD-ED.
003090     MOVE PREP2-07   TO PREF-ED.
003100     MOVE FONREP2-07 TO FONE-ED.
003110     DISPLAY (08, 43) TEL-ED.
003120 R-0440.
003130     ACCEPT (08, 67) FAXREP1-07 WITH UPDATE
003140        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003150     IF E = "01" GO TO R-0430.
003160     MOVE "-" TO TR-ED.
003170     MOVE "." TO PO-ED.
003180     MOVE DREP3-07   TO DDD-ED.
003190     MOVE PREP3-07   TO PREF-ED.
003200     MOVE FONREP3-07 TO FONE-ED.
003210     DISPLAY (08, 67) TEL-ED.
003220 R-0500.
003230     ACCEPT (10, 34) NOMEFOR-07 WITH UPDATE
003240        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003250     IF E = "01" GO TO R-0440.
003260 R-0600.
003270     ACCEPT (12, 17) ENDFOR-07 WITH UPDATE
003280        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003290     IF E = "01" GO TO R-0500.
003300 R-0700.
003310     ACCEPT (14, 17) CIDFOR-07 WITH UPDATE
003320        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003330     IF E = "01" GO TO R-0600.
003340 R-0800.
003350     ACCEPT (14, 49) CEPFOR-07 WITH UPDATE
003360        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003370     IF E = "01" GO TO R-0700.
003380 R-0810.
003390     ACCEPT (14, 55) CCEPFOR-07 WITH UPDATE
003400        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003410     IF E = "01" GO TO R-0800.
003420 R-0900.
003430     ACCEPT (14, 71) UFFOR-07 WITH UPDATE
003440        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003450     IF E = "01" GO TO R-0800.
003460     MOVE 0 TO IND1-W.
003470 R-0910.
003480     ADD 1 TO IND1-W.
003490     IF UFFOR-07 = WS-UF(IND1-W) GO TO R-1000.
003500     IF IND1-W > 27
003510        NEXT SENTENCE
003520     ELSE
003530        GO TO R-0910.
003540     DISPLAY (22, 14) "UNIDADE FEDERATIVA INVALIDA < >"
003550     ACCEPT (22, 78) CR WITH UPDATE
003560     DISPLAY (22, 14) EX-MENS GO TO R-0900.
003570 R-1000.
003580     ACCEPT (16, 17) TELFOR1-W WITH UPDATE
003590        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003600     IF TELFOR1-W  = "!" GO TO R-0900.
003610     MOVE DTEL1-W   TO IDDFOR-07 DDD-ED.
003620     MOVE PTEL1-W   TO T1-ANT PREF-ED.
003630     MOVE FONTEL1-W TO T2-ANT FONE-ED.
003640     MOVE TEL-ANT TO TELFOR-07.
003650     MOVE ZEROS   TO RAMFOR-07.
003660     MOVE "-" TO TR-ED.
003670     MOVE "." TO PO-ED.
003680     DISPLAY (16, 17) TEL-ED.
003690 R-1200.
003700     ACCEPT (16, 67) FAXFOR-W WITH UPDATE
003710        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003720     IF FAXFOR-W  = "!" GO TO R-1000.
003730     MOVE "-" TO TR-ED.
003740     MOVE "." TO PO-ED.
003750     MOVE DFOR1-W    TO DDD-ED.
003760     MOVE PFOR1-W    TO PREF-ED.
003770     MOVE FONFOR1-W  TO FONE-ED.
003780     MOVE FAXFOR-W TO FAXFOR-07.
003790     DISPLAY (16, 67) TEL-ED.
003800 R-1300.
003810     DISPLAY (18, 07) "C.G.C/MF:                     ".
003820     MOVE ZEROS TO CGC-WS1 CGC-WS2.
003830     ACCEPT (18, 17) CGC-WS1 WITH UPDATE
003840        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003850     IF E = "01"
003860        GO TO R-1000.
003870 R-1400.
003880     ACCEPT (18, 30) CGC-WS2 WITH UPDATE
003890        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003900     IF E = "01"
003910        GO TO R-1300.
003920     MOVE "J" TO WS-FISJUR.
003930     PERFORM TESTA-CGCCPF THRU TESTOU-CGCCPF.
003940     IF TDDIG-C NOT = TD-DIGITOS
003950        DISPLAY (22, 14) "CONTROLE VERIFICADOR INVALIDO"
003960        ACCEPT (22, 78) CR WITH UPDATE
003970        DISPLAY (22, 14) EX-MENS
003980        GO TO R-1400.
003990     IF TIPO-CGCCPF = 1
004000        DISPLAY (18, 17) EDI-CPF
004010     ELSE
004020        DISPLAY (18, 17) EDI-CGC.
004030     MOVE CGC-WS TO CGC-07.
004040 R-1500.
004050     ACCEPT (18, 49) INSCR-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004060     IF E = "01" GO TO R-1400.
004070 R-1520.
004080     ACCEPT (20, 17) DESC-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004090     IF E = "01" GO TO R-1500.
004100     MOVE DESC-07R  TO ED1 DISPLAY (20, 17) ED1.
004110 R-1540.
004120     ACCEPT (20, 49) FRETE-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004130     IF E = "01" GO TO R-1520.
004140     MOVE FRETE-07R TO ED1 DISPLAY (20, 49) ED1.
004150 R-1560.
004160     ACCEPT (20, 71) TXIPI-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004170     IF E = "01" GO TO R-1540.
004180     MOVE TXIPI-07R TO ED1 DISPLAY (20, 71) ED1.
004190 R-1561.
004200     ACCEPT (21, 17) OBS-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004210     IF E = "01" GO TO R-1560.
004220 R-1600.
004230     DISPLAY (22, 14) "CONFIRME (S/<N>) .".
004240     ACCEPT (22, 31) RESP WITH UPDATE  .
004250     DISPLAY (22, 14) EX-MENS
004260     IF RESP IS NOT = "S"
004270        GO TO ROT-I.
004280 R-1700.
004290     WRITE REG-07 INVALID KEY
004300        MOVE "MCE1401C" TO CODMENFS
004310         MOVE "ACE07"     TO ARQFS
004320        PERFORM TESTA-FS THRU SAI-TESTA-FS
004330        GO TO ROT-I.
004340     DISPLAY (22, 14) "INCLUSAO COM EXITO".
004350     ACCEPT (22, 33) CR WITH UPDATE.
004360     DISPLAY (22, 14) EX-MENS.
004370     GO TO ROT-I.
004380 ROT-A.
004390     MOVE "ALTERACAO DE FORNECEDORES" TO INFT.
004400     MOVE "TCE1401B"                 TO TS.
004410     PERFORM R-0200.
004420 R-1800.
004430     ACCEPT (10, 17) CODFOR-W WITH UPDATE
004440        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004450     IF E = "01" GO TO R-0100.
004460     IF CODFOR-W = 0   GO TO ROT-A.
004470     MOVE CODFOR-W TO CODFOR-07.
004480     READ ACE07 INVALID KEY
004490        DISPLAY (22, 14)
004500        "ERRO NA LEITURA DO FORNECEDOR===>" FS
004510        ACCEPT (22, 78) CR WITH UPDATE
004520        DISPLAY (22, 14) EX-MENS
004530        GO TO ROT-A.
004540     PERFORM R-0300.
004550 R-1810.
004560     ACCEPT (06, 17) REP-07 WITH UPDATE
004570        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004580     IF E = "01" GO TO R-1800.
004590 R-1830.
004600     MOVE ZEROS TO TEL-ED.
004610     MOVE SPACES TO TR-ED PO-ED.
004620     ACCEPT (08, 17) TELREP1-07 WITH UPDATE
004630        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004640     IF E = "01" GO TO R-1810.
004650     MOVE "-" TO TR-ED.
004660     MOVE "." TO PO-ED.
004670     MOVE DREP1-07   TO DDD-ED.
004680     MOVE PREP1-07   TO PREF-ED.
004690     MOVE FONREP1-07 TO FONE-ED.
004700     DISPLAY (08, 17) TEL-ED.
004710 R-1840.
004720     ACCEPT (08, 43) TELREP2-07 WITH UPDATE
004730        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004740     IF E = "01" GO TO R-1830.
004750     MOVE "-" TO TR-ED.
004760     MOVE "." TO PO-ED.
004770     MOVE DREP2-07   TO DDD-ED.
004780     MOVE PREP2-07   TO PREF-ED.
004790     MOVE FONREP2-07 TO FONE-ED.
004800     DISPLAY (08, 43) TEL-ED.
004810 R-1850.
004820     ACCEPT (08, 67) FAXREP1-07 WITH UPDATE
004830        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004840     IF E = "01" GO TO R-1840.
004850     MOVE "-" TO TR-ED.
004860     MOVE "." TO PO-ED.
004870     MOVE DREP3-07   TO DDD-ED.
004880     MOVE PREP3-07   TO PREF-ED.
004890     MOVE FONREP3-07 TO FONE-ED.
004900     DISPLAY (08, 67) TEL-ED.
004910 R-1900.
004920     ACCEPT (10, 34) NOMEFOR-07 WITH UPDATE
004930        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004940     IF E = "01" GO TO R-1850.
004950 R-2000.
004960     ACCEPT (12, 17) ENDFOR-07 WITH UPDATE
004970        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004980     IF E = "01" GO TO R-1900.
004990 R-2100.
005000     ACCEPT (14, 17) CIDFOR-07 WITH UPDATE
005010        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005020     IF E = "01" GO TO R-2000.
005030 R-2200.
005040     ACCEPT (14, 49) CEPFOR-07 WITH UPDATE
005050        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005060     IF E = "01" GO TO R-2100.
005070 R-2210.
005080     ACCEPT (14, 55) CCEPFOR-07 WITH UPDATE
005090        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005100     IF E = "01" GO TO R-2200.
005110 R-2300.
005120     ACCEPT (14, 71) UFFOR-07 WITH UPDATE
005130        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005140     IF E = "01" GO TO R-2200.
005150     MOVE 0 TO IND1-W.
005160 R-2310.
005170     ADD 1 TO IND1-W.
005180     IF UFFOR-07 = WS-UF(IND1-W) GO TO R-2400.
005190     IF IND1-W > 27
005200        NEXT SENTENCE
005210     ELSE
005220        GO TO R-2310.
005230     DISPLAY (22, 14) "UNIDADE FEDERATIVA INVALIDA < >"
005240     ACCEPT (22, 78) CR WITH UPDATE
005250     DISPLAY (22, 14) EX-MENS GO TO R-2300.
005260 R-2400.
005270     ACCEPT (16, 17) TELFOR1-W WITH UPDATE
005280        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005290     IF TELFOR1-W  = "!" GO TO R-2300.
005300     MOVE DTEL1-W   TO IDDFOR-07 DDD-ED.
005310     MOVE PTEL1-W   TO T1-ANT PREF-ED.
005320     MOVE FONTEL1-W TO T2-ANT FONE-ED.
005330     MOVE TEL-ANT TO TELFOR-07.
005340     MOVE ZEROS   TO RAMFOR-07.
005350     MOVE "-" TO TR-ED.
005360     MOVE "." TO PO-ED.
005370     DISPLAY (16, 17) TEL-ED.
005380 R-2600.
005390     ACCEPT (16, 67) FAXFOR-07 WITH UPDATE
005400        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005410     IF FAXFOR-07  = "!" GO TO R-2400.
005420     MOVE "-" TO TR-ED.
005430     MOVE "." TO PO-ED.
005440     MOVE DFOR1-07    TO DDD-ED.
005450     MOVE PFOR1-07    TO PREF-ED.
005460     MOVE FONFOR1-07  TO FONE-ED.
005470     DISPLAY (16, 67) TEL-ED.
005480 R-2700.
005490     DISPLAY (18, 07) "C.G.C/MF:                     ".
005500     MOVE CGC-07 TO CGC-WS.
005510     ACCEPT (18, 17) CGC-WS1 WITH UPDATE
005520        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005530     IF E = "01"
005540        GO TO R-2400.
005550 R-2800.
005560     ACCEPT (18, 30) CGC-WS2 WITH UPDATE
005570        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005580     IF E = "01"
005590        GO TO R-2700.
005600     PERFORM TESTA-CGCCPF THRU TESTOU-CGCCPF.
005610     IF TDDIG-C NOT = TD-DIGITOS
005620        DISPLAY (22, 14) "CONTROLE VERIFICADOR INVALIDO"
005630        ACCEPT (22, 78) CR WITH UPDATE
005640        DISPLAY (22, 14) EX-MENS
005650        GO TO R-2800.
005660     IF TIPO-CGCCPF = 1
005670        DISPLAY (18, 17) EDI-CPF
005680     ELSE
005690        DISPLAY (18, 17) EDI-CGC.
005700     MOVE CGC-WS TO CGC-07.
005710 R-2900.
005720     ACCEPT (18, 49) INSCR-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005730     IF E = "01" GO TO R-2800.
005740 R-2920.
005750     ACCEPT (20, 17) DESC-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005760     IF E = "01" GO TO R-2900.
005770     MOVE DESC-07R  TO ED1 DISPLAY (20, 17) ED1.
005780 R-2940.
005790     ACCEPT (20, 49) FRETE-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005800     IF E = "01" GO TO R-2920.
005810     MOVE FRETE-07R TO ED1 DISPLAY (20, 49) ED1.
005820 R-2960.
005830     ACCEPT (20, 71) TXIPI-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005840     IF E = "01" GO TO R-2940.
005850     MOVE TXIPI-07R TO ED1 DISPLAY (20, 71) ED1.
005860 R-2961.
005870     ACCEPT (21, 17) OBS-07 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005880     IF E = "01" GO TO R-2961.
005890 R-3000.
005900     DISPLAY (22, 14) "CONFIRME ALTERACAO (S/<N>):".
005910     ACCEPT (22, 42) RESP WITH UPDATE.
005920     DISPLAY (22, 14) EX-MENS
005930     IF RESP IS NOT = "S"
005940        GO TO ROT-A.
005950     REWRITE REG-07 INVALID KEY
005960        DISPLAY (22, 14)
005970        "ERRO NA GRAVACAO DO FORNECEDOR===>" FS
005980        ACCEPT (22, 78) CR WITH UPDATE
005990        DISPLAY (22, 14) EX-MENS
006000        GO TO ROT-A.
006010     DISPLAY (22, 14) "ALTERACAO COM EXITO".
006020     ACCEPT (22, 33) CR WITH UPDATE.
006030     DISPLAY (22, 14) EX-MENS.
006040     GO TO ROT-A.
006050 ROT-E.
006060     MOVE "EXCLUSAO DE FORNECEDORES" TO INFT.
006070     MOVE "TCE1401C"                 TO TS.
006080     PERFORM R-0200.
006090 R-3100.
006100     ACCEPT (10, 17) CODFOR-W WITH UPDATE
006110        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006120     IF E = "01" GO TO R-0100.
006130     IF CODFOR-W = ZEROS
006140        DISPLAY (22, 14) EX-MENS
006150        GO TO ROT-E.
006160     MOVE CODFOR-W TO CODFOR-07.
006170     READ ACE07 INVALID KEY
006180        DISPLAY (22, 14)
006190        "ERRO NA LEITURA DO FORNECEDOR===>" FS
006200        ACCEPT (22, 78) CR WITH UPDATE
006210        DISPLAY (22, 14) EX-MENS
006220        GO TO ROT-E.
006230     PERFORM R-0300.
006240 R-3200.
006250     DISPLAY (22, 14) "CONFIRME EXCLUSAO (S/<N>) .".
006260     ACCEPT (22, 40) RESP WITH UPDATE
006270     DISPLAY (22, 14) EX-MENS
006280     IF RESP IS NOT = "S"
006290     GO TO ROT-E.
006300     DELETE ACE07 INVALID KEY
006310        DISPLAY (22, 14)
006320        "ERRO NA EXCLUSAO DO FORNECEDOR==>" FS
006330        ACCEPT (22, 78) CR WITH UPDATE
006340        DISPLAY (22, 14) EX-MENS
006350        GO TO ROT-E.
006360     DISPLAY (22, 14) "EXCLUSAO COM EXITO"
006370     ACCEPT (22, 33) CR WITH UPDATE
006380     DISPLAY (22, 14) EX-MENS GO TO ROT-E.
006390 ROT-P.
006400     MOVE "PESQUISA DE FORNECEDORES" TO INFT.
006410     MOVE "TCE1401D"                 TO TS.
006420     PERFORM R-0200.
006430 R-3300.
006440     ACCEPT (10, 17) CODFOR-W WITH UPDATE
006450        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006460     IF E = "01" GO TO R-0100.
006470     IF CODFOR-W = ZEROS
006480        DISPLAY (22, 14) EX-MENS
006490        GO TO ROT-P.
006500     MOVE CODFOR-W TO CODFOR-07.
006510     READ ACE07 INVALID KEY
006520        DISPLAY (22, 14)
006530        "ERRO NA LEITURA DO FORNECEDOR===>" FS
006540        ACCEPT (22, 78) CR WITH UPDATE
006550        DISPLAY (22, 14) EX-MENS
006560        GO TO ROT-P.
006570     PERFORM R-0300.
006580     DISPLAY (22, 14) "DESEJA CONTINUAR (S/<N>) .".
006590     ACCEPT (22, 39) RESP WITH UPDATE
006600     DISPLAY (22, 14) EX-MENS
006610     IF RESP = "S"
006620         GO TO ROT-P.
006630     GO TO R-0100.
006640 ROT-L.
006650     MOVE "LISTAGEM DE FORNECEDORES" TO INFT.
006660     MOVE "TCE1401E"                 TO TS.
006670 COPY "/dados1/book/CPYTPCE".
006680     DISPLAY (08, 24)
006690     "DESEJA LISTAR CADASTRO DE FORNECEDOR (<S>/N):".
006700     ACCEPT (08, 70) RESP WITH UPDATE.
006710     IF RESP = "N"
006720        GO TO R-0100.
006730     DISPLAY (10, 24) "EM ORDEM ALFABETICA? (S/<N>) :==>.".
006740     ACCEPT (10, 57) RESP WITH UPDATE.
006750 R-3400.
006760     IF RESP = "S" GO TO R-3900.
006770     DISPLAY (08, 15) EX-MENS.
006780     DISPLAY (10, 24) "FORNECEDOR INICIAL ===> ".
006790     DISPLAY (12, 24) "FORNECEDOR FINAL======> ".
006800 R-3410.
006810     ACCEPT (10, 49) FORN-I WITH UPDATE.
006820 R-3420.
006830     ACCEPT (12, 49) FORN-F WITH UPDATE.
006840     MOVE ZEROS TO CTP W-CHAVE.
006850     IF FORN-I = FORN-F
006860        MOVE 1 TO W-CHAVE.
006870 R-3500.
006880     MOVE FORN-I TO CHAVE-07.
006890     START ACE07 KEY IS NOT < CHAVE-07 INVALID KEY
006900        DISPLAY (22, 14)
006910        "ERRO NO ARQUIVO DE FORNECEDOR ===>" FS
006920        ACCEPT (22, 78) CR WITH UPDATE
006930        DISPLAY (22, 14) EX-MENS
006940        GO TO R-3300.
006950 R-3600.
006960     READ ACE07 NEXT RECORD AT END
006970        GO TO R-3800.
006980     IF CODFOR-07 > FORN-F  GO TO R-3800.
006990 R-3700.
007000     MOVE CODFOR-07  TO  COD-6.
007010     MOVE NOMEFOR-07 TO  NOME-6.
007020     MOVE ENDFOR-07  TO  ENDER-6.
007030     MOVE CIDFOR-07  TO  CID-7.
007040     MOVE CEPFOR-07  TO  CEP-7.
007050     MOVE CCEPFOR-07 TO  CCEP-7.
007060     MOVE UFFOR-07   TO  UF-7.
007070     MOVE IDDFOR-07  TO  DDD-7.
007080     MOVE TELFOR-07  TO  WTEL-AUX.
007090     MOVE WPRE-AUX   TO  PRETEL-7.
007100     MOVE WUF-AUX    TO  SUFTEL-7.
007110     MOVE RAMFOR-07  TO  RAM-7.
007120     MOVE CGC-07 TO CGC-WS CGCCPF CPF-ED.
007130     IF DIF-CGC-07 = ZEROS
007140        MOVE CPF1-ED TO EDI-CPF1
007150        MOVE CPF2-ED TO EDI-CPF2
007160        MOVE EDI-CPF TO CGC-6
007170     ELSE
007180        MOVE CGC1-ED TO EDI-CGC1
007190        MOVE CGC2-ED TO EDI-CGC2
007200        MOVE EDI-CGC TO CGC-6.
007210     MOVE INSCR-07   TO  INSCR-6.
007220     IF CTL > 58
007230        ADD 1 TO CTP
007240        MOVE CTP TO  PAG-CAB1A
007250        WRITE REG-REL FROM CAB1A AFTER PAGE
007260        MOVE "RCE1401A" TO NOME-RELA
007270        WRITE REG-REL FROM CAB2A AFTER 1
007280        WRITE REG-REL FROM CAB132 AFTER 1
007290        MOVE "NUMERICA" TO TIPO-3
007300        WRITE REG-REL FROM CAB3 AFTER 1
007310        WRITE REG-REL FROM CAB132 AFTER 1
007320        WRITE REG-REL FROM CAB4 AFTER 2
007330        WRITE REG-REL FROM CAB5 AFTER 1
007340        WRITE REG-REL FROM CAB132 AFTER 1
007350        MOVE 9 TO CTL.
007360     WRITE REG-REL FROM CAB6 AFTER 1.
007370     WRITE REG-REL FROM CAB7 AFTER 1.
007380     WRITE REG-REL FROM CAB132 AFTER 1.
007390     ADD 3 TO CTL.
007400     IF W-CHAVE = 1
007410        NEXT SENTENCE
007420     ELSE
007430         GO TO R-3600.
007440 R-3800.
007450     GO TO R-0100.
007460 R-3900.
007470     OPEN OUTPUT ACEAUX.
007480     IF FS NOT = "00"
007490        MOVE "MCE1401D" TO CODMENFS
007500        MOVE "ACEAUX"      TO ARQFS
007510        PERFORM TESTA-FS THRU SAI-TESTA-FS
007520        CLOSE ACEAUX GO TO R-0100.
007530     MOVE LOW-VALUE TO CHAVE-07.
007540     START ACE07 KEY IS NOT < CHAVE-07 INVALID KEY MOVE 1 TO ST.
007550 R-4000.
007560     READ ACE07 NEXT RECORD AT END
007570        CLOSE ACEAUX OPEN INPUT ACEAUX
007580        MOVE 70 TO CTL
007590        MOVE 0 TO CTP
007600        GO TO R-4100.
007610     WRITE REG-AUX FROM REG-07 INVALID KEY
007620        DISPLAY (22, 14)
007630        "ERRO NA GRAVACAO DO AUXILIAR===>" FS
007640        ACCEPT (22, 78) CR WITH UPDATE
007650        DISPLAY (22, 14) EX-MENS
007660        CLOSE ACEAUX GO TO R-0100.
007670     GO TO R-4000.
007680 R-4100.
007690     MOVE SPACES TO  NOMEFOR-AUX.
007700     START ACEAUX KEY IS NOT < NOMEFOR-AUX INVALID KEY
007710        MOVE 1 TO ST.
007720 R-4200.
007730     READ ACEAUX NEXT RECORD AT END
007740         CLOSE ACEAUX
007750         GO TO R-0100.
007760     IF CTL > 58
007770         ADD 1 TO CTP
007780         MOVE CTP TO  PAG-CAB1A
007790         WRITE REG-REL FROM CAB1A AFTER PAGE
007800         MOVE "RCE1401B" TO NOME-RELA
007810         WRITE REG-REL FROM CAB2A AFTER 1
007820         WRITE REG-REL FROM CAB132 AFTER 1
007830         MOVE "ALFABETICA" TO TIPO-3
007840         WRITE REG-REL FROM CAB3 AFTER 1
007850         WRITE REG-REL FROM CAB132 AFTER 1
007860         WRITE REG-REL FROM CAB4 AFTER 2
007870         WRITE REG-REL FROM CAB5 AFTER 1
007880         WRITE REG-REL FROM CAB132 AFTER 1
007890         MOVE 9 TO CTL.
007900     MOVE REG-AUX    TO REG-07.
007910     MOVE CODFOR-07  TO COD-6.
007920     MOVE NOMEFOR-07 TO NOME-6.
007930     MOVE ENDFOR-07  TO ENDER-6.
007940     MOVE CIDFOR-07  TO CID-7.
007950     MOVE CEPFOR-07  TO CEP-7.
007960     MOVE CCEPFOR-07 TO CCEP-7.
007970     MOVE UFFOR-07   TO UF-7.
007980     MOVE IDDFOR-07  TO DDD-7.
007990     MOVE TELFOR-07  TO WTEL-AUX.
008000     MOVE WPRE-AUX   TO PRETEL-7.
008010     MOVE WUF-AUX    TO SUFTEL-7.
008020     MOVE RAMFOR-07  TO RAM-7.
008030     MOVE CGC-07 TO CGC-WS CGCCPF CPF-ED.
008040     IF DIF-CGC-07 = ZEROS
008050        MOVE CPF1-ED TO EDI-CPF1
008060        MOVE CPF2-ED TO EDI-CPF2
008070        MOVE EDI-CPF TO CGC-6
008080     ELSE
008090        MOVE CGC1-ED TO EDI-CGC1
008100        MOVE CGC2-ED TO EDI-CGC2
008110        MOVE EDI-CGC TO CGC-6.
008120     MOVE INSCR-07   TO INSCR-6.
008130     WRITE REG-REL FROM CAB6 AFTER 1.
008140     WRITE REG-REL FROM CAB7 AFTER 1.
008150     WRITE REG-REL FROM CAB132 AFTER 1.
008160     ADD 3 TO CTL.
008170     GO TO R-4200.
008180 COPY "/dados1/book/PCGCCPF".
008190 R-9999.
008200     CLOSE ACE07 REL.
008210     EXIT PROGRAM.
008220*===================F=I=M==================
