000010*******************************************************
000020* SCE1501-PROGRAMA DE MANUTENCAO NO CADASTRO DE JUROS COMP 20/08/05*
000030******************************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE1501.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-13".
000080     SELECT RELATO    ASSIGN TO PRINTER
000090                      FILE STATUS IS FS.
000100 COPY "/dados1/book/FDCE".
000110 COPY "/dados1/book/FD-13".
000120 COPY "/dados1/book/FDREL80".
000130 COPY "/dados1/book/TAB-W".
000140 01  CAMPOS.
000150     05 PRAZO-W       PIC 999.
000160     05 PRAZO-W1      PIC 999.
000170     05 JUROS-W       PIC 9V999999.
000180     05 JUROS-WR REDEFINES JUROS-W PIC 9(07).
000190     05 JUROS-W1      PIC 9V999999.
000200     05 ED            PIC Z,ZZZZ.
000210 01  SENHA            PIC 9(06) VALUE ZEROS.
000220 01  CAB2.
000230     05 FILLER        PIC X(30) VALUE SPACES.
000240     05 FILLER        PIC X(19) VALUE "CADASTRO  DE  JUROS".
000250 01  CAB3.
000260     05 FILLER        PIC X(17) VALUE SPACES.
000270     05 FILLER        PIC X(29) VALUE "PRAZO DA VENDA".
000280     05 FILLER        PIC X(20) VALUE "JUROS DE ACRESCIMOS".
000290 01  CAB4.
000300     05 FILLER        PIC X(21) VALUE SPACES.
000310     05 PRAZO-CAB4    PIC 999   VALUE ZEROS.
000320     05 FILLER        PIC X(26) VALUE SPACES.
000330     05 JUROS-CAB4    PIC 9,9999 VALUE ZEROS.
000340 COPY "/dados1/book/CPYPDCE".
000350 COPY "/dados1/book/CPYPDFS".
000360 COPY "/dados1/book/PDIMP".
000370 R-0000.
000380     OPEN I-O ACE13.
000390     IF FS NOT = "00"
000400        MOVE "MCE1501A" TO CODMENFS
000410        MOVE "ACE13" TO ARQFS
000420        PERFORM TESTA-FS THRU SAI-TESTA-FS
000430        CLOSE ACE13 STOP RUN.
000440     OPEN OUTPUT RELATO.
000450     IF FS NOT = "00"
000460        MOVE "MCE1501B" TO CODMENFS
000470        MOVE "RELATO" TO ARQFS
000480        PERFORM TESTA-FS THRU SAI-TESTA-FS
000490        CLOSE RELATO STOP RUN.
000500     MOVE "TCE1501" TO TS.
000510     MOVE "CADASTRAMENTO DE JUROS" TO INFT.
000520 R-0100.
000530     MOVE ZEROS TO PRAZO-W PRAZO-W1 JUROS-W JUROS-W1 CAMPOS.
000540 COPY "/dados1/book/CPYTPCE".
000550     MOVE ZEROS TO CTP CTL.
000560     DISPLAY (08, 69) "<L>ISTAGEM".
000570 COPY "/dados1/book/CPYTMCE".
000580     IF OPCAO = "L" GO TO ROT-L.
000590     GO TO R-8888.
000600 R-0200.
000610     DISPLAY (08, 25) "PRAZO:       ".
000620     DISPLAY (10, 25) "JUROS:         -INFORMAR SEM VIRGULA".
000630 ROT-I.
000640     MOVE SPACES TO RESP.
000650     MOVE ALL ZEROS TO REG-13.
000660     DISPLAY (08, 25) "INCLUIR GERAL (S/<N>) ".
000670     ACCEPT (08, 47) RESP WITH UPDATE.
000680     DISPLAY (08, 25) "                       ".
000690     IF RESP NOT = "S"
000700         NEXT SENTENCE
000710     ELSE
000720         GO TO R-0600.
000730 R-0300.
000740     MOVE SPACES TO RESP.
000750     DISPLAY (08, 25) "PRAZO:       ".
000760     DISPLAY (10, 25) "JUROS:         -INFORMAR SEM VIRGULA".
000770     ACCEPT (08, 32) PRAZO-13 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000780     IF E = "01" GO TO R-0100.
000790     READ ACE13 INVALID KEY GO TO R-0400.
000800     DISPLAY (22, 14) "PRAZO JA CADASTRADO < >".
000810     ACCEPT (22, 78) CR WITH UPDATE.
000820     DISPLAY (22, 14) EX-MENS.
000830     GO TO R-0300.
000840 R-0400.
000850     ACCEPT (10, 32) JUROS-13R WITH UPDATE.
000860 R-0500.
000870     DISPLAY (22, 14) "INCLUIR (S/<N>) .".
000880     ACCEPT (22, 30) RESP WITH UPDATE.
000890     DISPLAY (22, 14) EX-MENS.
000900     IF RESP NOT = "S" GO TO R-0300.
000910     WRITE REG-13 INVALID KEY
000920        MOVE "MCE1501B" TO CODMENFS
000930        MOVE "ACE13" TO ARQFS
000940        PERFORM TESTA-FS THRU SAI-TESTA-FS
000950        GO TO R-0300.
000960     DISPLAY (22, 14) "I N C L U I D O "
000970     ACCEPT (22, 78) CR WITH UPDATE
000980     DISPLAY (22, 14) EX-MENS GO TO R-0300.
000990 R-0600.
001000     DISPLAY (08, 25) "PRAZO INICIAL: ".
001010     DISPLAY (10, 25) "PRAZO FINAL..: ".
001020 R-0700.
001030     ACCEPT (08, 40) PRAZO-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001040     IF E = "01" GO TO R-0100.
001050 R-0800.
001060     ACCEPT (10, 40) PRAZO-W1 WITH UPDATE.
001070     IF PRAZO-W1 < PRAZO-W
001080        DISPLAY (22, 14) "PRAZO FINAL INVALIDO"
001090        ACCEPT (22, 35) CR WITH UPDATE
001100        DISPLAY (22, 14) EX-MENS
001110        MOVE ZEROS TO PRAZO-W PRAZO-W1
001120        GO TO R-0600.
001130 R-0900.
001140     MOVE PRAZO-W TO PRAZO-13.
001150     IF PRAZO-W > PRAZO-W1
001160         DISPLAY (22, 14) "INCLUIDO, ALTERAR JUROS GERAL !!!"
001170         ACCEPT (22, 78) CR WITH UPDATE
001180         DISPLAY (22, 14) EX-MENS
001190         GO TO R-0100.
001200     WRITE REG-13 INVALID KEY MOVE 1 TO ST.
001210     ADD 1 TO PRAZO-W.
001220     GO TO R-0900.
001230 ROT-A.
001240     DISPLAY (22, 14) "SENHA: ".
001250     ACCEPT (22, 21) SENHA WITH UPDATE.
001260     DISPLAY (22, 14) EX-MENS.
001270     IF SENHA NOT = DATA-W
001280         DISPLAY (22, 14) "USUARIO NAO AUTORIZADO!!!!"
001290         ACCEPT (22, 78) CR WITH UPDATE
001300         DISPLAY (22, 14) EX-MENS
001310         GO TO R-0100.
001320     MOVE SPACES TO RESP.
001330     MOVE LOW-VALUES TO REG-13.
001340     START ACE13 KEY IS NOT < CHAVE-13 INVALID KEY MOVE 1 TO ST.
001350     DISPLAY (08, 25) "ALTERACAO GERAL (S/<N>) .".
001360     ACCEPT (08, 49) RESP WITH UPDATE.
001370     IF RESP NOT = "S"
001380        DISPLAY (08, 25) "                         "
001390        MOVE SPACES TO RESP
001400        GO TO R-1300.
001410     DISPLAY (10, 25) "JUROS:         -INFORMAR SEM VIRGULA".
001420     ACCEPT (10, 32) JUROS-WR WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001430     IF E = "01" GO TO R-0100.
001440     MOVE JUROS-W TO JUROS-W1.
001450 R-1000.
001460     READ ACE13 NEXT RECORD AT END
001470        DISPLAY (22, 14) "A L T E R A D O"
001480        ACCEPT (22, 78) CR WITH UPDATE
001490        DISPLAY (22, 14) EX-MENS
001500        GO TO R-0100.
001510     IF PRAZO-13 = 999 OR 0 GO TO R-1200.
001520     IF PRAZO-13   = 1
001530         MOVE JUROS-W TO JUROS-13
001540         ADD 1 TO PRAZO-W
001550         GO TO R-1200.
001560 R-1100.
001570     MULTIPLY JUROS-W BY JUROS-W1 GIVING JUROS-W1.
001580     ADD 1 TO PRAZO-W.
001590     IF PRAZO-13 = PRAZO-W
001600        MOVE JUROS-W1 TO JUROS-13
001610        GO TO R-1200.
001620     GO TO R-1100.
001630 R-1200.
001640     REWRITE REG-13 INVALID KEY
001650        MOVE "MCE1501C" TO CODMENFS
001660        MOVE "ACE13" TO ARQFS
001670        PERFORM TESTA-FS THRU SAI-TESTA-FS
001680        GO TO R-0100.
001690     GO TO R-1000.
001700 R-1300.
001710     MOVE SPACES TO RESP.
001720     DISPLAY (08, 25) "PRAZO:       ".
001730     DISPLAY (10, 25) "JUROS:         -INFORMAR SEM VIRGULA".
001740     ACCEPT (08, 32) PRAZO-13 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001750     IF E = "01" GO TO R-0100.
001760     READ ACE13 INVALID KEY
001770         DISPLAY (22, 14) "PRAZO NAO CADASTRADO < >"
001780         ACCEPT (22, 78) CR WITH UPDATE
001790         DISPLAY (22, 14) EX-MENS
001800         GO TO R-1300.
001810     MOVE JUROS-13  TO ED.
001820     DISPLAY (10, 32) ED.
001830     PERFORM R-0400.
001840     DISPLAY (22, 14) "ALTERAR (S/<N>) .".
001850     ACCEPT (22, 30) RESP WITH UPDATE.
001860     DISPLAY (22, 14) EX-MENS.
001870     IF RESP NOT = "S" GO TO R-1300.
001880     REWRITE REG-13 INVALID KEY
001890         MOVE "MCE1501D" TO CODMENFS
001900         MOVE "ACE13" TO ARQFS
001910         PERFORM TESTA-FS THRU SAI-TESTA-FS
001920         GO TO R-1300.
001930 R-1400.
001940     DISPLAY (22, 14) "A L T E R A D O"
001950     ACCEPT (22, 78) CR WITH UPDATE
001960     DISPLAY (22, 14) EX-MENS GO TO R-1300.
001970 ROT-P.
001980     MOVE SPACES TO RESP.
001990     DISPLAY (08, 25) "PRAZO:       ".
002000     DISPLAY (10, 25) "JUROS:                              ".
002010     ACCEPT (08, 32) PRAZO-13 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002020     IF E = "01" GO TO R-0100.
002030     READ ACE13 INVALID KEY
002040         DISPLAY (22, 14) "PRAZO NAO CADASTRADO < >"
002050         ACCEPT (22, 78) CR WITH UPDATE
002060         DISPLAY (22, 14) EX-MENS
002070         GO TO ROT-P.
002080     MOVE JUROS-13 TO ED.
002090     DISPLAY (10, 32) ED.
002100     DISPLAY (22, 14) "CONTINUA PESQUISANDO (S/<N>) .".
002110     ACCEPT (22, 43) RESP WITH UPDATE.
002120     DISPLAY (22, 14) EX-MENS.
002130     IF RESP NOT = "S" GO TO R-0100.
002140     GO TO ROT-P.
002150 ROT-E.
002160     MOVE SPACES TO RESP.
002170     DISPLAY (08, 25) "PRAZO:       ".
002180     DISPLAY (10, 25) "JUROS:                              ".
002190     ACCEPT (08, 32) PRAZO-13 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002200     IF E = "01" GO TO R-0100.
002210     READ ACE13 INVALID KEY
002220         DISPLAY (22, 14) "PRAZO NAO CADASTRADO < >"
002230         ACCEPT (22, 78) CR WITH UPDATE
002240         DISPLAY (22, 14) EX-MENS
002250         GO TO ROT-E.
002260     MOVE JUROS-13 TO ED.
002270     DISPLAY (10, 32) ED.
002280     DISPLAY (22, 14) "EXCLUIR (S/<N>) .".
002290     ACCEPT (22, 30) RESP WITH UPDATE.
002300     DISPLAY (22, 14) EX-MENS.
002310     IF RESP NOT = "S" GO TO ROT-E.
002320     DELETE ACE13 INVALID KEY
002330         MOVE "MCE1501D" TO CODMENFS
002340         MOVE "ACE13" TO ARQFS
002350         PERFORM TESTA-FS THRU SAI-TESTA-FS
002360         GO TO ROT-E.
002370     DISPLAY (22, 14) "E X C L U I D O"
002380     ACCEPT (22, 78) CR WITH UPDATE
002390     DISPLAY (22, 14) EX-MENS GO TO ROT-E.
002400 ROT-L.
002410     MOVE SPACES TO RESP.
002420     DISPLAY (04, 24) "RELATORIO DO CADASTRO DE JUROS".
002430     DISPLAY (12, 24) "IMPRIMIR (S/<N>) .".
002440     ACCEPT (12, 41) RESP WITH UPDATE.
002450     IF RESP NOT = "S"
002460        GO TO R-0100.
002470 R-1500.
002480     MOVE LOW-VALUES TO CHAVE-13.
002490     START ACE13 KEY IS NOT < CHAVE-13 INVALID KEY MOVE 1 TO ST.
002500 R-1600.
002510     READ ACE13 NEXT RECORD AT END
002520         GO TO R-0100.
002530     IF CTL > 58
002540         ADD 1 TO CTP
002550         MOVE CTP TO PAG-CAB1B
002560         MOVE 7 TO CTL
002570         WRITE REG-RELATO FROM CAB1B AFTER PAGE
002580         MOVE "RCE1501" TO NOME-RELB
002590         WRITE REG-RELATO FROM CAB2B AFTER 1
002600         WRITE REG-RELATO FROM CAB80 AFTER 1
002610         WRITE REG-RELATO FROM CAB2 AFTER 1
002620         WRITE REG-RELATO FROM CAB80 AFTER 1
002630         WRITE REG-RELATO FROM CAB3 AFTER 2.
002640     MOVE PRAZO-13 TO PRAZO-CAB4.
002650     MOVE JUROS-13 TO JUROS-CAB4.
002660     WRITE REG-RELATO FROM CAB4 AFTER 1.
002670     MOVE SPACES TO CAB4.
002680     ADD 1 TO CTL.
002690     GO TO R-1600.
002700 R-9999.
002710     CLOSE ACE13 RELATO.
002720     EXIT PROGRAM.
002730*---------------F-I-M------------------
