000010*********************************************
000020* OCE1101-MANUTENCAO NO ARQUIVO DE LOJAS    *
000030*********************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE1101.
000060 COPY SELCE.
000070 COPY SELC-02.
000080 COPY SELC-05.
000090 COPY SELCC01.
000100     SELECT REL       ASSIGN TO PRINTER
000110                      FILE STATUS IS FS.
000120 COPY FDCE.
000130 COPY FD-02.
000140 FD  REL
000150     VALUE OF FILE-ID IS IMP-W.
000160 01  REG-REL          PIC X(220).
000170 COPY FD-05.
000180 COPY FDACC01.
000190 COPY TAB-W.
000200 COPY WCGCCPF.
000210 COPY COMPRIME.
000220 01  CAB2.
000230     05 FILLER        PIC X(51) VALUE SPACES.
000240     05 FILLER        PIC X(30) VALUE
000250     "RELATORIO DO CADASTRO DE LOJAS".
000260 01  CAB3.
000270     05 FILLER        PIC X(63) VALUE
000280     "LOJA CUSTO  R   A   Z   A   O    S   O   C   I   A   L".
000290     05 FILLER        PIC X(60) VALUE
000300     "E N D E R E C O  C O M E R C I A L    M U N I C I P I O".
000310     05 FILLER        PIC X(46) VALUE
000320     "UF        C G C / MF     INSCRICAO ESTADUAL".
000330     05 FILLER        PIC X(37) VALUE
000340     "INSCRICAO MUNICIPAL   PROTOCOlO LIVRO".
000350 01  CAB4.
000360     05 FILLER        PIC X(63) VALUE
000370     "---- -----  ------------------------------------------".
000380     05 FILLER        PIC X(60) VALUE
000390     "----------------------------------    -----------------".
000400     05 FILLER        PIC X(46) VALUE
000410     "--        ----------     ------------------".
000420     05 FILLER        PIC X(37) VALUE
000430     "-------------------   ---------------".
000440 01  CAB5.
000450     05 FILLER        PIC X(01) VALUE SPACES.
000460     05 LOJA-5        PIC 99 VALUE ZEROS.
000470     05 FILLER        PIC X(03) VALUE SPACES.
000480     05 CC-5          PIC XX  VALUE ZEROS.
000490     05 FILLER        PIC X(04) VALUE SPACES.
000500     05 RAZAO-5       PIC X(50) VALUE SPACES.
000510     05 FILLER        PIC X(01) VALUE SPACES.
000520     05 END-5         PIC X(34) VALUE SPACES.
000530     05 FILLER        PIC X(04) VALUE SPACES.
000540     05 MUN-5         PIC X(20) VALUE SPACES.
000550     05 FILLER        PIC X(02) VALUE SPACES.
000560     05 UF-5          PIC X(02) VALUE SPACES.
000570     05 FILLER        PIC X(05) VALUE SPACES.
000580     05 CGC-5         PIC X(18) VALUE SPACES.
000590     05 FILLER        PIC X(01) VALUE SPACES.
000600     05 INSCR-5       PIC 999.999999.9999 VALUE ZEROS.
000610     05 FILLER        PIC X(07) VALUE SPACES.
000620     05 INSMUN1-5     PIC 999.999 VALUE ZEROS.
000630     05 FILLER        PIC X(01) VALUE "/".
000640     05 INSMUN2-5     PIC 9(03) VALUE ZEROS.
000650     05 FILLER        PIC X(01) VALUE "-".
000660     05 DIGMUN-5      PIC X(02) VALUE SPACES.
000670     05 FILLER        PIC X(06) VALUE SPACES.
000680     05 TIPO-5        PIC 99 VALUE ZEROS.
000690     05 FILLER        PIC X(01) VALUE ".".
000700     05 NUME-5        PIC 9(06) VALUE ZEROS.
000710     05 FILLER        PIC X(01) VALUE "/".
000720     05 EXER-5        PIC 9(02) VALUE ZEROS.
000730     05 FILLER        PIC X(01) VALUE "-".
000740     05 DVNUM-5       PIC 9(02) VALUE ZEROS.
000750 COPY CPYPDCE.
000760 COPY CPYPDFS.
000770 R-0000.
000780 COPY PDIMP.
000790     OPEN I-O ACE05.
000800     IF FS NOT EQUAL "00"
000810        MOVE "MCE1101A" TO CODMENFS
000820        MOVE "ACE05" TO ARQFS
000830        PERFORM TESTA-FS THRU SAI-TESTA-FS
000840        CLOSE ACE05 STOP RUN.
000850     OPEN INPUT ACE02.
000860     IF FS NOT EQUAL "00"
000870        MOVE "MCE1101B" TO CODMENFS
000880        MOVE "ACE02" TO ARQFS
000890        PERFORM TESTA-FS THRU SAI-TESTA-FS
000900        CLOSE ACE02 ACE05 STOP RUN.
000910     OPEN OUTPUT REL.
000920     IF FS NOT EQUAL "00"
000930        MOVE "MCE1101C" TO CODMENFS
000940        MOVE "RELATO" TO ARQFS
000950        PERFORM TESTA-FS THRU SAI-TESTA-FS
000960        CLOSE ACE02 ACE05 REL STOP RUN.
000970 COPY REDUZREL.
000980     OPEN INPUT ACC01.
000990     IF FS NOT = "00"
001000        MOVE "MCE1101D" TO CODMENFS
001010        MOVE "ACC01" TO ARQFS
001020        PERFORM TESTA-FS THRU SAI-TESTA-FS
001030        CLOSE ACE02 ACE05 ACC01 REL STOP RUN.
001040     MOVE "TCE1101" TO TS.
001050     MOVE "RCE1101" TO NOME-RELA.
001060     MOVE "MANUTENCAO DE LOJAS" TO INFT.
001070     MOVE ALL ZEROS TO REG-05.
001080     MOVE SPACES TO LOJA-05.
001090 R-100.
001100     MOVE ZEROS TO IND1-W.
001110     MOVE 0 TO CTP.
001120     MOVE 70 TO CTL.
001130 COPY CPYTPCE.
001140     DISPLAY E X(08) X(69) "<L>ISTAGEM".
001150 COPY CPYTMCE.
001160     IF OPCAO = "L" GO TO ROT-L.
001170     GO TO R-8888.
001180 R-200.
001190     DISPLAY E X(07) X(02) "LOJA...........:  ".
001200     DISPLAY E X(08) X(02) "RAZAO SOCIAL...: ".
001210     DISPLAY E X(08) X(18)
001220     "                                            ".
001230     DISPLAY E X(09) X(02) "ENDERECO.......: ".
001240     DISPLAY E X(09) X(18) "                              ".
001250     DISPLAY E X(10) X(02) "MUNICIPIO......:                     "
001260     DISPLAY E X(10) X(40) "BAIRRO.: ".
001270     DISPLAY E X(11) X(02) "ESTADO.........:  ".
001280     DISPLAY E X(12) X(02) "CGC............:                  ".
001290     DISPLAY E X(13) X(02) "INSC. ESTADUAL.:                ".
001300     DISPLAY E X(14) X(02) "CENTRO DE CUSTO:    ".
001310     DISPLAY E X(15) X(02) "INSC. MUNICIPAL:      /    - ".
001320     DISPLAY E X(16) X(02) "PROTOCOLO LIVRO:  -      /  -  ".
001330     DISPLAY E X(17) X(02) "REGISTRO JUNTA.:             ".
001340     DISPLAY E X(18) X(02) "DATA REG.JUNTA.:  /  /  ".
001350     DISPLAY E X(20) X(02) "TELEFONE.......:...-....".
001360 ROT-I.
001370     MOVE SPACES TO REG-05 RESP.
001380     MOVE ZEROS TO CGC-05 INSCR-05.
001390     PERFORM R-200.
001400     DISPLAY E X(07) X(18) ACCEPT IND1-W FROM CONSOLE WITH
001410        AUTO-SKIP.
001420     IF IND1-W = "!" GO TO R-100.
001430     IF IND1-W = 99 OR IND1-W = 00
001440        DISPLAY E X(22) X(14) "LOJA NAO PODE SER <00 - 99> ."
001450        DISPLAY E X(22) X(42) ACCEPT CR FROM CONSOLE
001460        DISPLAY E X(22) X(14) EX-MENS
001470        GO TO ROT-I.
001480     MOVE IND1-W TO LOJA-05.
001490     READ ACE05 INVALID KEY GO TO R-300.
001500     DISPLAY E X(22) X(14) "LOJA JA CADASTRADA < >"
001510     DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
001520     DISPLAY E X(22) X(14) EX-MENS
001530     GO TO ROT-I.
001540 R-300.
001550     DISPLAY E X(08) X(18) ACCEPT RAZAO-05 FROM CONSOLE WITH
001560        AUTO-SKIP.
001570     IF RAZAO-05 = "!" GO TO ROT-I.
001580     IF RAZAO-05 = SPACES GO TO R-300.
001590 R-400.
001600     DISPLAY E X(09) X(18) ACCEPT END-05 FROM CONSOLE WITH
001610        AUTO-SKIP.
001620     IF END-05 = "!" GO TO R-300.
001630     IF END-05 = SPACES GO TO R-400.
001640 R-500.
001650     DISPLAY E X(10) X(18) ACCEPT MUN-05 FROM CONSOLE WITH
001660        AUTO-SKIP.
001670     IF MUN-05 = "!" GO TO R-400.
001680     IF MUN-05 = SPACES GO TO R-500.
001690 R-510.
001700     DISPLAY E X(10) X(49) ACCEPT BAIRRO-05 FROM CONSOLE WITH
001710        AUTO-SKIP.
001720     IF BAIRRO-05 = "!" GO TO R-500.
001730     IF BAIRRO-05 = SPACES GO TO R-510.
001740 R-600.
001750     MOVE ZEROS TO IND2-W.
001760     DISPLAY E X(11) X(18) ACCEPT UF-05 FROM CONSOLE WITH
001770        AUTO-SKIP.
001780     IF UF-05 = "!" GO TO R-510.
001790 R-601.
001800     ADD 1 TO IND2-W.
001810     IF IND2-W > 28
001820         DISPLAY E X(22) X(14) "ESTADO INVALIDO < >"
001830         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
001840         DISPLAY E X(22) X(14) EX-MENS
001850         GO TO R-600.
001860     IF UF-05 = WS-UF(IND2-W) GO TO R-700.
001870     GO TO R-601.
001880 R-700.
001890     MOVE ZEROS TO CGC-WS1 CGC-WS2.
001900     DISPLAY E X(12) X(18) ACCEPT CGC-WS1 FROM CONSOLE
001910         WITH AUTO-SKIP.
001920     IF CGC-WS1 = "!" GO TO R-600.
001930     DISPLAY E X(12) X(31) ACCEPT CGC-WS2 FROM CONSOLE
001940         WITH AUTO-SKIP.
001950     MOVE "J" TO WS-FISJUR.
001960     PERFORM TESTA-CGCCPF THRU TESTOU-CGCCPF.
001970     IF TDDIG-C NOT = TD-DIGITOS
001980         DISPLAY E X(22) X(14) "CGC. CPF. INVALIDO < >"
001990         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
002000         DISPLAY E X(22) X(14) EX-MENS
002010         GO TO R-700.
002020     IF TIPO-CGCCPF = 1
002030         DISPLAY E X(12) X(18) EDI-CPF
002040     ELSE
002050         DISPLAY E X(12) X(18) EDI-CGC.
002060     MOVE CGC-WS TO CGC-05.
002070 R-800.
002080     DISPLAY E X(13) X(18) ACCEPT INSCR-05 FROM CONSOLE WITH
002090        AUTO-SKIP.
002100     IF INSCR-05 = "!" GO TO R-700.
002110 R-900.
002120     IF CUSTO-EMPCE = "N"
002130        MOVE ZEROS TO CC-05
002140        GO TO R-910.
002150     DISPLAY E X(14) X(18) ACCEPT CC-05 FROM CONSOLE WITH
002160        AUTO-SKIP.
002170     IF CC-05 = "!" GO TO R-800.
002180     MOVE ZEROS TO CHVCC-01.
002190     MOVE CC-05 TO HISCC-01.
002200     READ ACC01 INVALID KEY
002210         DISPLAY E X(22) X(14) "CENTRO DE CUSTO NAO CADASTRADO "
002220         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
002230         DISPLAY E X(22) X(14) EX-MENS.
002240*        GO TO R-900.
002250 R-910.
002260     DISPLAY E X(15) X(18) ACCEPT INSMUN1-05 FROM CONSOLE WITH
002270        AUTO-SKIP.
002280     IF INSMUN1-05 = "!" GO TO R-800.
002290 R-920.
002300     DISPLAY E X(15) X(25) ACCEPT INSMUN2-05 FROM CONSOLE WITH
002310        AUTO-SKIP.
002320     IF INSMUN2-05 = "!" GO TO R-910.
002330 R-930.
002340     DISPLAY E X(15) X(30) ACCEPT DIGMUN-05 FROM CONSOLE WITH
002350        AUTO-SKIP.
002360     IF DIGMUN-05 = "!" GO TO R-920.
002370 R-940.
002380     DISPLAY E X(16) X(18) ACCEPT TIPO-05 FROM CONSOLE WITH
002390        AUTO-SKIP.
002400     IF TIPO-05 = "!" GO TO R-930.
002410 R-950.
002420     DISPLAY E X(16) X(21) ACCEPT NUME-05 FROM CONSOLE WITH
002430        AUTO-SKIP.
002440     IF NUME-05 = "!" GO TO R-940.
002450 R-960.
002460     DISPLAY E X(16) X(28) ACCEPT EXER-05 FROM CONSOLE WITH
002470        AUTO-SKIP.
002480     IF EXER-05 = "!" GO TO R-950.
002490 R-970.
002500     DISPLAY E X(16) X(31) ACCEPT DVNUM-05 FROM CONSOLE WITH
002510        AUTO-SKIP.
002520     IF DVNUM-05 = "!" GO TO R-960.
002530 R-980.
002540     DISPLAY E X(17) X(18) ACCEPT NUMRJC-05 FROM CONSOLE WITH
002550        AUTO-SKIP.
002560     IF NUMRJC-05 = "!" GO TO R-970.
002570 R-981.
002580     DISPLAY E X(18) X(18) ACCEPT DIARJC-05 FROM CONSOLE WITH
002590        AUTO-SKIP.
002600     IF DIARJC-05 = "!" GO TO R-980.
002610 R-982.
002620     DISPLAY E X(18) X(21) ACCEPT MESRJC-05 FROM CONSOLE WITH
002630        AUTO-SKIP.
002640     IF MESRJC-05 = "!" GO TO R-981.
002650 R-983.
002660     DISPLAY E X(18) X(24) ACCEPT ANORJC-05 FROM CONSOLE WITH
002670        AUTO-SKIP.
002680     IF ANORJC-05 = "!" GO TO R-982.
002690 R-984.
002700     DISPLAY E X(20) X(18) ACCEPT TELE-05 FROM CONSOLE WITH
002710        AUTO-SKIP.
002720     IF TELE-05 = "!" GO TO R-983.
002730 R-985.
002740     DISPLAY E X(20) X(22) ACCEPT FONE-05 FROM CONSOLE WITH
002750        AUTO-SKIP.
002760     IF FONE-05 = "!" GO TO R-984.
002770 R-1000.
002780     DISPLAY E X(22) X(14) "INCLUIR (S<N>)".
002790     DISPLAY E X(22) X(29) ACCEPT RESP FROM CONSOLE.
002800     DISPLAY E X(22) X(14) EX-MENS.
002810     IF RESP NOT = "S" GO TO ROT-I.
002820     WRITE REG-05 INVALID KEY
002830        MOVE "MCE1101D" TO CODMENFS
002840        MOVE "ACE05" TO ARQFS
002850        PERFORM TESTA-FS THRU SAI-TESTA-FS
002860        GO TO ROT-I.
002870     DISPLAY E X(22) X(14) "I N C L U I D O "
002880     DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
002890     DISPLAY E X(22) X(14) EX-MENS
002900     MOVE ALL ZEROS TO REG-05
002910     MOVE SPACES TO LOJA-05
002920     GO TO ROT-I.
002930 ROT-A.
002940     MOVE SPACES TO RESP.
002950     PERFORM R-200.
002960     DISPLAY E X(07) X(18) ACCEPT IND1-W FROM CONSOLE WITH
002970        AUTO-SKIP.
002980     IF IND1-W = "!" GO TO R-100.
002990     MOVE IND1-W TO LOJA-05.
003000     READ ACE05 INVALID KEY
003010         DISPLAY E X(22) X(14) "LOJA NAO CADASTRADA < >"
003020         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
003030         DISPLAY E X(22) X(14) EX-MENS
003040         GO TO ROT-A.
003050     PERFORM R-1800.
003060 R-1100.
003070     DISPLAY E X(08) X(18) ACCEPT RAZAO-05 FROM CONSOLE WITH
003080        AUTO-SKIP.
003090     IF RAZAO-05 = "!" GO TO ROT-A.
003100     IF RAZAO-05 = SPACES GO TO R-1100.
003110 R-1200.
003120     DISPLAY E X(09) X(18) ACCEPT END-05 FROM CONSOLE WITH
003130        AUTO-SKIP.
003140     IF END-05 = "!" GO TO R-1100.
003150     IF END-05 = SPACES GO TO R-1200.
003160 R-1300.
003170     DISPLAY E X(10) X(18) ACCEPT MUN-05 FROM CONSOLE WITH
003180        AUTO-SKIP.
003190     IF MUN-05 = "!" GO TO R-1200.
003200     IF MUN-05 = SPACES GO TO R-1300.
003210 R-1301.
003220     DISPLAY E X(10) X(49) ACCEPT BAIRRO-05 FROM CONSOLE WITH
003230        AUTO-SKIP.
003240     IF BAIRRO-05 = "!" GO TO R-1300.
003250     IF BAIRRO-05 = SPACES GO TO R-1301.
003260 R-1400.
003270     MOVE ZEROS TO IND2-W.
003280     DISPLAY E X(11) X(18) ACCEPT UF-05 FROM CONSOLE WITH
003290        AUTO-SKIP.
003300     IF UF-05 = "!" GO TO R-1300.
003310 R-1401.
003320     ADD 1 TO IND2-W.
003330     IF IND2-W > 27
003340         DISPLAY E X(22) X(14) "ESTADO INVALIDO < >"
003350         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
003360         DISPLAY E X(22) X(14) EX-MENS
003370         GO TO R-1400.
003380     IF UF-05 = WS-UF(IND2-W) GO TO R-1500.
003390     GO TO R-1401.
003400 R-1500.
003410     MOVE CGC-05 TO CGC-WS.
003420     DISPLAY E X(12) X(18) ACCEPT CGC-WS1 FROM CONSOLE WITH
003430        AUTO-SKIP.
003440     IF CGC-WS1 = "!" GO TO R-1400.
003450     DISPLAY E X(12) X(31) ACCEPT CGC-WS2 FROM CONSOLE
003460         WITH AUTO-SKIP.
003470     PERFORM TESTA-CGCCPF THRU TESTOU-CGCCPF.
003480     IF TDDIG-C NOT = TD-DIGITOS
003490         DISPLAY E X(22) X(14) "CGC. CPF. INVALIDO < >"
003500         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
003510         DISPLAY E X(22) X(14) EX-MENS
003520         GO TO R-1500.
003530     IF TIPO-CGCCPF = 1
003540         DISPLAY E X(12) X(18) EDI-CPF
003550     ELSE
003560         DISPLAY E X(12) X(18) EDI-CGC.
003570     MOVE CGC-WS TO CGC-05.
003580 R-1600.
003590     DISPLAY E X(13) X(18) ACCEPT INSCR-05 FROM CONSOLE WITH
003600        AUTO-SKIP.
003610     IF INSCR-05 = "!" GO TO R-1500.
003620 R-1700.
003630     IF CUSTO-EMPCE = "N"
003640        DISPLAY E X(14) X(18) "NAO "
003650        MOVE ZEROS TO CC-05
003660        GO TO R-1710.
003670     DISPLAY E X(14) X(18) ACCEPT CC-05 FROM CONSOLE WITH
003680        AUTO-SKIP.
003690     IF CC-05 = "!" GO TO R-1600.
003700     MOVE CC-05 TO CODICC-01.
003710     MOVE 02 TO HISCC-01.
003720     READ ACC01 INVALID KEY
003730         DISPLAY E X(22) X(14) "CENTRO DE CUSTO NAO CADASTRADO "
003740         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
003750         DISPLAY E X(22) X(14) EX-MENS
003760         GO TO R-1700.
003770 R-1710.
003780     DISPLAY E X(15) X(18) ACCEPT INSMUN1-05 FROM CONSOLE WITH
003790        AUTO-SKIP.
003800     IF INSMUN1-05 = "!" GO TO R-1600.
003810 R-1720.
003820     DISPLAY E X(15) X(25) ACCEPT INSMUN2-05 FROM CONSOLE WITH
003830        AUTO-SKIP.
003840     IF INSMUN2-05 = "!" GO TO R-1710.
003850 R-1730.
003860     DISPLAY E X(15) X(30) ACCEPT DIGMUN-05 FROM CONSOLE WITH
003870        AUTO-SKIP.
003880 R-1740.
003890     DISPLAY E X(16) X(18) ACCEPT TIPO-05 FROM CONSOLE WITH
003900        AUTO-SKIP.
003910     IF TIPO-05 = "!" GO TO R-1730.
003920 R-1750.
003930     DISPLAY E X(16) X(21) ACCEPT NUME-05 FROM CONSOLE WITH
003940        AUTO-SKIP.
003950     IF NUME-05 = "!" GO TO R-1740.
003960 R-1760.
003970     DISPLAY E X(16) X(28) ACCEPT EXER-05 FROM CONSOLE WITH
003980        AUTO-SKIP.
003990     IF EXER-05 = "!" GO TO R-1750.
004000 R-1770.
004010     DISPLAY E X(16) X(31) ACCEPT DVNUM-05 FROM CONSOLE WITH
004020        AUTO-SKIP.
004030     IF DVNUM-05 = "!" GO TO R-1760.
004040 R-1780.
004050     DISPLAY E X(17) X(18) ACCEPT NUMRJC-05 FROM CONSOLE WITH
004060        AUTO-SKIP.
004070     IF NUMRJC-05 = "!" GO TO R-1770.
004080 R-1781.
004090     DISPLAY E X(18) X(18) ACCEPT DIARJC-05 FROM CONSOLE WITH
004100        AUTO-SKIP.
004110     IF DIARJC-05 = "!" GO TO R-1780.
004120 R-1782.
004130     DISPLAY E X(18) X(21) ACCEPT MESRJC-05 FROM CONSOLE WITH
004140        AUTO-SKIP.
004150     IF MESRJC-05 = "!" GO TO R-1781.
004160 R-1783.
004170     DISPLAY E X(18) X(24) ACCEPT ANORJC-05 FROM CONSOLE WITH
004180        AUTO-SKIP.
004190     IF ANORJC-05 = "!" GO TO R-1782.
004200 R-1784.
004210     DISPLAY E X(20) X(18) ACCEPT TELE-05 FROM CONSOLE WITH
004220        AUTO-SKIP.
004230     IF TELE-05 = "!" GO TO R-1783.
004240 R-1785.
004250     DISPLAY E X(20) X(22) ACCEPT FONE-05 FROM CONSOLE WITH
004260        AUTO-SKIP.
004270     IF FONE-05 = "!" GO TO R-1784.
004280 R-1790.
004290     DISPLAY E X(22) X(14) "ALTERAR (S/<N>)".
004300     DISPLAY E X(22) X(30) ACCEPT RESP FROM CONSOLE.
004310     DISPLAY E X(22) X(14) EX-MENS.
004320     IF RESP NOT = "S" GO TO ROT-A.
004330     REWRITE REG-05 INVALID KEY
004340        MOVE "MCE1101E" TO CODMENFS
004350        MOVE "ACE05" TO ARQFS
004360        PERFORM TESTA-FS THRU SAI-TESTA-FS
004370        GO TO ROT-A.
004380     DISPLAY E X(22) X(14) "A L T E R A D O ".
004390     DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE.
004400     DISPLAY E X(22) X(14) EX-MENS.
004410     MOVE ALL ZEROS TO REG-05.
004420     MOVE SPACES TO LOJA-05.
004430     GO TO ROT-A.
004440 ROT-E.
004450     MOVE SPACES TO RESP.
004460     PERFORM R-200.
004470     DISPLAY E X(07) X(18) ACCEPT IND1-W FROM CONSOLE WITH
004480        AUTO-SKIP.
004490     IF IND1-W = "!" GO TO R-100.
004500     MOVE IND1-W TO LOJA-05.
004510     READ ACE05 INVALID KEY
004520         DISPLAY E X(22) X(14) "LOJA NAO CADASTRADA < > "
004530         DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
004540         DISPLAY E X(22) X(14) EX-MENS
004550         GO TO ROT-E.
004560 R-1800.
004570     DISPLAY E X(08) X(18) RAZAO-05.
004580     DISPLAY E X(09) X(18) END-05.
004590     DISPLAY E X(10) X(18) MUN-05.
004600     DISPLAY E X(10) X(49) BAIRRO-05.
004610     DISPLAY E X(11) X(18) UF-05.
004620     MOVE CGC-05   TO CGCCPF CPF-ED CGC-WS.
004630     IF TDNUM-C1 = ZEROS
004640        MOVE CPF1-ED TO EDI-CPF1
004650        MOVE CPF2-ED TO EDI-CPF2
004660        DISPLAY E X(12) X(18) EDI-CPF
004670     ELSE
004680        MOVE CGC1-ED TO EDI-CGC1
004690        MOVE CGC2-ED TO EDI-CGC2
004700        DISPLAY E X(12) X(18) EDI-CGC.
004710     DISPLAY E X(13) X(18) INSCR-05.
004720     IF CUSTO-EMPCE = "N"
004730        DISPLAY E X(14) X(18) "NAO "
004740     ELSE
004750        DISPLAY E X(14) X(18) CC-05.
004760     DISPLAY E X(15) X(18) INSMUN1-05.
004770     DISPLAY E X(15) X(25) INSMUN2-05.
004780     DISPLAY E X(15) X(30) DIGMUN-05.
004790     DISPLAY E X(16) X(18) TIPO-05.
004800     DISPLAY E X(16) X(21) NUME-05.
004810     DISPLAY E X(16) X(28) EXER-05.
004820     DISPLAY E X(16) X(31) DVNUM-05.
004830     DISPLAY E X(17) X(18) NUMRJC-05.
004840     DISPLAY E X(18) X(18) DIARJC-05.
004850     DISPLAY E X(18) X(21) MESRJC-05.
004860     DISPLAY E X(18) X(24) ANORJC-05.
004870     DISPLAY E X(20) X(18) TELE-05.
004880     DISPLAY E X(20) X(22) TELE-05.
004890 R-1900.
004900     MOVE LOJA-05 TO LOJA-02.
004910     MOVE ZEROS   TO COD-02.
004920     START ACE02 KEY IS = LOJA-02 INVALID KEY MOVE 1 TO ST.
004930     READ ACE02 INVALID KEY MOVE 1 TO ST.
004940     IF FS NOT = "23"
004950        DISPLAY E X(22) X(14)
004960        "LOJA NAO PODE SER EXCLUIDA, EXISTE PRODUTOS P/A LOJA < >"
004970        DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
004980        DISPLAY E X(22) X(14) EX-MENS
004990        GO TO ROT-E.
005000     DISPLAY E X(22) X(14) "EXCLUIR (S/<N>)".
005010     DISPLAY E X(22) X(30) ACCEPT RESP FROM CONSOLE .
005020     DISPLAY E X(22) X(14) EX-MENS.
005030     IF RESP NOT = "S" GO TO ROT-E.
005040     DELETE ACE05 INVALID KEY
005050        MOVE "MCE1101F" TO CODMENFS
005060        MOVE "ACE05" TO ARQFS
005070        PERFORM TESTA-FS THRU SAI-TESTA-FS
005080        GO TO ROT-E.
005090     DISPLAY E X(22) X(14) "E X C L U I D O ".
005100     DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE.
005110     DISPLAY E X(22) X(14) EX-MENS.
005120     GO TO ROT-E.
005130 ROT-P.
005140     MOVE SPACES TO RESP.
005150     PERFORM R-200.
005160     DISPLAY E X(07) X(18) ACCEPT IND1-W FROM CONSOLE WITH
005170        AUTO-SKIP.
005180     IF IND1-W = "!" GO TO R-100.
005190     MOVE IND1-W TO LOJA-05.
005200     READ ACE05 INVALID KEY
005210        DISPLAY E X(22) X(14) "LOJA NAO CADASTRADA < >"
005220        DISPLAY E X(22) X(78) ACCEPT CR FROM CONSOLE
005230        DISPLAY E X(22) X(14) EX-MENS
005240        GO TO ROT-P.
005250     PERFORM R-1800.
005260     DISPLAY E X(22) X(14) "CONTINUA PESQUISANDO (S<N>)".
005270     DISPLAY E X(22) X(42) ACCEPT RESP FROM CONSOLE.
005280     DISPLAY E X(22) X(14) EX-MENS.
005290     IF RESP NOT = "S" GO TO R-100.
005300     GO TO ROT-P.
005310 ROT-L.
005320     MOVE SPACES TO RESP.
005330     DISPLAY E X(04) X(23) "RELATORIO DO CADASTRO DE LOJAS".
005340     DISPLAY E X(10) X(30) "IMPRIMIR (S<N>)".
005350     DISPLAY E X(10) X(46) ACCEPT RESP FROM CONSOLE.
005360     IF RESP NOT = "S"
005370        GO TO R-100.
005380     DISPLAY E X(10) X(30) "I M P R I M I N D O".
005390     MOVE SPACES TO CHAVE-05.
005400     START ACE05 KEY IS NOT < CHAVE-05 INVALID KEY MOVE 1 TO ST.
005410 R-2000.
005420     READ ACE05 NEXT RECORD AT END
005430        GO TO R-100.
005440     IF CTL > 60
005450        ADD 1 TO CTP
005460        MOVE CTP TO PAG-CAB1A
005470        MOVE 8 TO CTL
005480        WRITE REG-REL FROM CAB1A AFTER PAGE
005490        WRITE REG-REL FROM CAB2A AFTER 1
005500        WRITE REG-REL FROM CAB132 AFTER 1
005510        WRITE REG-REL FROM CAB2 AFTER 1
005520        WRITE REG-REL FROM CAB132 AFTER 1
005530        WRITE REG-REL FROM CAB3 AFTER 2
005540        WRITE REG-REL FROM CAB4 AFTER 1.
005550     MOVE LOJA-05    TO LOJA-5.
005560     MOVE RAZAO-05   TO RAZAO-5.
005570     MOVE END-05     TO END-5.
005580     MOVE MUN-05     TO MUN-5.
005590     MOVE UF-05      TO UF-5.
005600     IF CUSTO-EMPCE = "N"
005610        MOVE ZEROS   TO CC-5
005620     ELSE
005630        MOVE CC-05   TO CC-5.
005640     MOVE CGC-05    TO CGCCPF CPF-ED.
005650     IF TDNUM-C1 = ZEROS
005660        MOVE CPF1-ED TO EDI-CPF1
005670        MOVE CPF2-ED TO EDI-CPF2
005680        MOVE EDI-CPF TO CGC-5
005690     ELSE
005700        MOVE CGC1-ED TO EDI-CGC1
005710        MOVE CGC2-ED TO EDI-CGC2
005720        MOVE EDI-CGC TO CGC-5.
005730     MOVE INSCR-05   TO INSCR-5.
005740     MOVE INSMUN1-05 TO INSMUN1-5.
005750     MOVE INSMUN2-05 TO INSMUN2-5.
005760     MOVE DIGMUN-05  TO DIGMUN-5.
005770     MOVE TIPO-05    TO TIPO-5.
005780     MOVE NUME-05    TO NUME-5.
005790     MOVE EXER-05    TO EXER-5.
005800     MOVE DVNUM-05   TO DVNUM-5.
005810     WRITE REG-REL FROM CAB5 AFTER 1.
005820     ADD 1 TO CTL.
005830     GO TO R-2000.
005840 COPY PCGCCPF.
005850 R-9999.
005860 COPY EXPANREL.
005870     CLOSE ACE02 ACE05 ACC01 REL.
005880     CALL "OCE0000".
005890*-------------F-I-M-----------------------
