000010*LANCAMENTO DE NOTA FISCAL MOVIMENTO DIRETO *
000020*********************************************
000020$set osvs ms(2) nowarning

000030 IDENTIFICATION DIVISION.
000040 PROGRAM-ID. OCE1701.
000050 COPY "/dados1/book/SELCE".
000060 COPY "/dados1/book/SELC-08".
000070*COPY "/dados1/book/SELSI01".
000080 COPY "/dados1/book/SELC-07".
000090 COPY "/dados1/book/SELCT52".
000100 COPY "/dados1/book/SELCC01".
000110 COPY "/dados1/book/SELBA03".
000120 COPY "/dados1/book/SELCA10".
000130 COPY "/dados1/book/SELCA04".
000140     SELECT REL       ASSIGN TO PRINTER
000150                      FILE STATUS IS FS.
000160 COPY "/dados1/book/FDCE".
000170 COPY "/dados1/book/FD-08".
000180*COPY "/dados1/book/FDSI01".
000190 COPY "/dados1/book/FD-07".
000200 COPY "/dados1/book/FDCT52".
000210 COPY "/dados1/book/FDACC01".
000220 COPY "/dados1/book/FDBA03".
000230 COPY "/dados1/book/FDCA10".
000240 COPY "/dados1/book/FDCA04".
000250 COPY "/dados1/book/FDREL132".
000260 COPY "/dados1/book/TAB-W".
000270 01  TIP-W            PIC X(01) VALUE SPACES.
000280 01  CAMPOS1.
000290     02 DATAC.
000300        05 DIAC      PIC 99 VALUE ZEROS.
000310        05 MESC      PIC 99 VALUE ZEROS.
000320        05 ANOC      PIC 99 VALUE ZEROS.
000330     02 ED           PIC ZZ.ZZZ.ZZZ.ZZ9,99.
000340     02 VALOR-W      PIC 9(10)V99 VALUE ZEROS.
000350     02 VALOR-WR REDEFINES VALOR-W PIC 9(12).
000360     02 WS-FAT       PIC 9(10)V99 VALUE ZEROS.
000370     02 WS-PRAZO     PIC 9(03) VALUE ZEROS.
000380     02 TOT-NOTA     PIC 9(11)V99 VALUE ZEROS.
000390     02 TOT-NOTAR REDEFINES TOT-NOTA PIC 9(13).
000400     02 NOTA-W       PIC 99 VALUE ZEROS.
000410     02 NOTA-C       PIC 99 VALUE ZEROS.
000420     02 DATAI.
000430        05 DIAI      PIC 99 VALUE ZEROS.
000440        05 MESI      PIC 99 VALUE ZEROS.
000450        05 ANOI      PIC 99 VALUE ZEROS.
000460     02 TOT-G        PIC 9(13)V99 VALUE ZEROS.
000470     02 TOTGERAL     PIC 9(12)V99 VALUE ZEROS.
000480     02 CONDANT-W    PIC X(06) VALUE SPACES.
000490     02 CONDANT-WR REDEFINES CONDANT-W PIC 9(06).
000500 01  NFMD-W          PIC 9(07) VALUE ZEROS.
000510 01  NOME-W          PIC X(11) VALUE SPACES.
000520 01  CAMPOS.
000530     02 REG-W OCCURS 20 TIMES.
000540        05 NFHED-W   PIC 9(07).
000550        05 DIFNFHED-W PIC 9(02).
000560        05 CHED-W    PIC X.
000570        05 ESP-W     PIC X(03).
000580        05 SER-W     PIC X(02).
000590        05 VRCONT-W  PIC 9(10)V99.
000600        05 DEMIS-W   PIC 9(06).
000610        05 DENTR-W   PIC 9(06).
000620        05 CODF-W    PIC 9(03).
000630        05 ALQ-W     PIC 9(02).
000640        05 FORN-W    PIC 9(06).
000650        05 BICM-W    PIC 9(10)V99.
000660        05 BICM-WR REDEFINES
000670           BICM-W    PIC 9(12).
000680        05 CC-W      PIC 9999.
000690        05 CONDHED-W PIC X.
000700        05 PRAZ-W    PIC 9(03).
000710        05 CLAS-W    PIC 99.
000720        05 NOMEFOR-W PIC X(20).
000730        05 PORT-W    PIC 9(02).
000740        05 LOJA-W    PIC 99.
000750        05 CONS-W    PIC X(01).
000760        05 HIST-W    PIC X(30).
000770        05 RESPON-W  PIC 9(06).
000780        05 CODDESP-W PIC 9(06).
000790        05 TB-DUP.
000800           07 FILLER OCCURS 10 TIMES.
000810              09 NFAT-52W    PIC 9(6).
000820              09 DIFFAT-52W  PIC 99.
000830              09 AE-52W      PIC 99.
000840              09 ME-52W      PIC 99.
000850              09 DE-52W      PIC 99.
000860              09 AV-52W      PIC 99.
000870              09 MV-52W      PIC 99.
000880              09 DV-52W      PIC 99.
000890              09 FAT-52W     PIC 9(10)V99.
000900              09 FATRED-52W REDEFINES
000910                 FAT-52W     PIC 9(12).
000920 01  CAB2.
000930     05 FILLER      PIC X(50) VALUE SPACES.
000940     05 FILLER      PIC X(10) VALUE "RELATORIO-".
000950     05 DESC-CAB2   PIC X(10) VALUE SPACES.
000960     05 FILLER      PIC X(18) VALUE " DE NOTAS FISCAIS".
000970 01  CAB3.
000980     05 FILLER      PIC X(57) VALUE
000990     "NOTA FISC.  ESP PRZ SER VALOR CONTABIL DT.EMIS. DT.PAGTO".
001000     05 FILLER      PIC X(57) VALUE
001010     "FIS AL  BASE CALCULO TP FORN NOME DO FORNECEDOR    CUSTO".
001020     05 FILLER      PIC X(18) VALUE "IN  CL  LJ DESPESA".
001030 01  CAB4.
001040     05 NFHED-4     PIC ZZZZ99 VALUE SPACES.
001050     05 FILLER      PIC X VALUE "/".
001060     05 DIFNFHED-4  PIC 9(02) VALUE ZEROS.
001070     05 FILLER      PIC X(03) VALUE SPACES.
001080     05 ESP-4       PIC X(03) VALUE SPACES.
001090     05 FILLER      PIC X(01) VALUE SPACES.
001100     05 PRAZ-4      PIC ZZ9 VALUE ZEROS.
001110     05 FILLER      PIC X(02) VALUE SPACES.
001120     05 SER-4       PIC X  VALUE SPACES.
001130     05 FILLER      PIC X(02) VALUE SPACES.
001140     05 VRCONT-4    PIC ZZZZ.ZZZ.ZZ9,99 VALUE ZEROS.
001150     05 FILLER      PIC X(01) VALUE SPACES.
001160     05 DD-4        PIC 99 VALUE ZEROS.
001170     05 FILLER      PIC X VALUE "/".
001180     05 MM-4        PIC 99 VALUE ZEROS.
001190     05 FILLER      PIC X VALUE "/".
001200     05 AA-4        PIC 99 VALUE ZEROS.
001210     05 FILLER      PIC X(01) VALUE SPACES.
001220     05 D-4         PIC 99 VALUE ZEROS.
001230     05 FILLER      PIC X VALUE "/".
001240     05 M-4         PIC 99 VALUE ZEROS.
001250     05 FILLER      PIC X VALUE "/".
001260     05 A-4         PIC 99 VALUE ZEROS.
001270     05 FILLER      PIC X VALUE SPACES.
001280     05 CODF-4      PIC ZZ9 VALUE ZEROS.
001290     05 FILLER      PIC X(01) VALUE SPACES.
001300     05 ALQ-4       PIC Z9 VALUE ZEROS.
001310     05 FILLER      PIC X(01) VALUE SPACES.
001320     05 BICM-4      PIC ZZ.ZZZ.ZZ9,99 VALUE ZEROS.
001330     05 FILLER      PIC X(01) VALUE SPACES.
001340     05 CONDHED-4   PIC X(02) VALUE SPACES.
001350     05 FILLER      PIC X(01) VALUE SPACES.
001360     05 FORN-4      PIC ZZZZ VALUE ZEROS.
001370     05 FILLER      PIC X VALUE SPACES.
001380     05 NOMEFOR-4   PIC X(22) VALUE SPACES.
001390     05 FILLER      PIC X(01) VALUE SPACES.
001400     05 CC-4        PIC 9999 VALUE ZEROS.
001410     05 FILLER      PIC X(01) VALUE SPACES.
001420     05 INCIDE-4    PIC X(02) VALUE SPACES.
001430     05 FILLER      PIC X(02) VALUE SPACES.
001440     05 CLAS-4      PIC 99 VALUE ZEROS.
001450     05 FILLER      PIC X(02) VALUE SPACES.
001460     05 LOJA-4      PIC 99 VALUE ZEROS.
001470     05 FILLER      PIC X(02) VALUE SPACES.
001480     05 CODDESP-4   PIC ZZZZZZ VALUE ZEROS.
001490 01  CAMPOAL        PIC 9V99 VALUE ZEROS.
001500 01  CAMPOALR REDEFINES CAMPOAL.
001510     05 CAM1        PIC 9.
001520     05 CAM2        PIC 99.
001530 01  CAB6.
001540     05 PAR-6       PIC Z9.
001550     05 FILLER      PIC X(10) VALUE "'PARCELA  ".
001560     05 FILLER      PIC X(05) VALUE "FAT: ".
001570     05 NUMFAT-6    PIC ZZZZZ9.
001580     05 FILLER      PIC X VALUE "/".
001590     05 DIFFAT-6    PIC 99 VALUE ZEROS.
001600     05 FILLER      PIC XX VALUE SPACES.
001610     05 FILLER      PIC X(12) VALUE "FORNECEDOR: ".
001620     05 FOR-6       PIC ZZ99.
001630     05 FILLER      PIC XX VALUE SPACES.
001640     05 FILLER      PIC X(12) VALUE "VALOR PAR.: ".
001650     05 FAT-6       PIC ZZZZ.ZZZ.ZZ9,99.
001660     05 FILLER      PIC X VALUE SPACES.
001670     05 FILLER      PIC X(10) VALUE "EMISSAO.: ".
001680     05 DE-6        PIC 99 VALUE ZEROS.
001690     05 B5-6        PIC X VALUE "/".
001700     05 ME-6        PIC 99 VALUE ZEROS.
001710     05 FILLER      PIC X VALUE "/".
001720     05 AE-6        PIC 99 VALUE ZEROS.
001730     05 FILLER      PIC XX VALUE SPACES.
001740     05 FILLER      PIC X(13) VALUE "VENCIMENTO.: ".
001750     05 DV-6        PIC 99 VALUE ZEROS.
001760     05 FILLER      PIC X VALUE "/".
001770     05 MV-6        PIC 99 VALUE ZEROS.
001780     05 FILLER      PIC X VALUE "/".
001790     05 AV-6        PIC 99 VALUE ZEROS.
001800 01  CAB7.
001810     05 FILLER      PIC X(19) VALUE "TOTAL DO LOTE: ".
001820     05 TOT-7       PIC ZZZ.ZZZ.ZZZ.ZZ9,99.
001830 COPY "/dados1/book/CPYPDCE".
001840 COPY "/dados1/book/CPYPDFS".
001850 COPY "/dados1/book/PDIMP".
001860 R-0000.
001870     OPEN I-O ACE08.
001880     IF FS NOT = "00"
001890        MOVE "MCE1701A" TO CODMENFS
001900        MOVE "ACE08" TO ARQFS
001910        PERFORM TESTA-FS THRU SAI-TESTA-FS
001920        CLOSE ACE08 STOP RUN.
001930     OPEN OUTPUT REL.
001940     IF FS NOT = "00"
001950        MOVE "MCE1701E" TO CODMENFS
001960        MOVE "RELATO" TO ARQFS
001970        PERFORM TESTA-FS THRU SAI-TESTA-FS
001980        CLOSE ACE08 REL STOP RUN.
001990     OPEN I-O ACT52.
002000     IF FS NOT = "00"
002010        MOVE "MCE1701B" TO CODMENFS
002020        MOVE "ACT52" TO ARQFS
002030        PERFORM TESTA-FS THRU SAI-TESTA-FS
002040        CLOSE ACE08 REL ACT52 STOP RUN.
002050 RH-1.
002060     OPEN INPUT ACE07.
002070     IF FS NOT = "00"
002080        MOVE "MCE1701C" TO CODMENFS
002090        MOVE "ACE07" TO ARQFS
002100        PERFORM TESTA-FS THRU SAI-TESTA-FS
002110        CLOSE ACE08 REL ACT52 ACE07 STOP RUN.
002120 RH-2.
002130     OPEN INPUT ACC01.
002140     IF FS NOT = "00"
002150        MOVE "MCE1701D" TO CODMENFS
002160        MOVE "ACC01" TO ARQFS
002170        PERFORM TESTA-FS THRU SAI-TESTA-FS
002180        CLOSE ACE08 REL ACT52 ACE07 ACC01 STOP RUN.
002190 RH-3.
002200     OPEN I-O ABA03.
002210     IF FS NOT = "00"
002220        MOVE "MCE1701G" TO CODMENFS
002230        MOVE "ABA03"    TO ARQFS
002240        PERFORM TESTA-FS THRU SAI-TESTA-FS
002250        CLOSE ACE08 REL ACT52 ACE07 ACC01 ABA03 STOP RUN.
002260 RH-4.
002270     OPEN INPUT ACA10.
002280     IF FS NOT = "00"
002290        MOVE "MCE1701H" TO CODMENFS
002300        MOVE "ACA10"    TO ARQFS
002310        PERFORM TESTA-FS THRU SAI-TESTA-FS
002320        CLOSE ACE08 REL ACT52 ACE07 ACC01 ABA03 ACA10 STOP RUN.
002330 RH-5.
002340     OPEN INPUT ACA04.
002350     IF FS NOT = "00"
002360        MOVE "MCE1701I" TO CODMENFS
002370        MOVE "ACA04"    TO ARQFS
002380        PERFORM TESTA-FS THRU SAI-TESTA-FS
002390        CLOSE ACE08 REL ACT52 ACE07 ACC01 ABA03 ACA10 ACA04
002400        STOP RUN.
002410 RH-6.
002420     MOVE ALL ZEROS TO IND1-W IND2-W REG-08 REG-CT52.
002430     MOVE ALL SPACES TO COD-08 NAT-08 FRETE-08 CODHED-08
002440         ESP-08 SER-08 INCIDE-08 NOMEFOR-08.
002450 R-020.
002460     MOVE "TCE1701" TO TS.
002470     MOVE "ENTRADA DE MERC.E DESPESAS" TO INFT.
002480     MOVE ARG-W TO COD-EMPCE COMP-00.
002490     OPEN INPUT EMPCE.
002500     IF FS NOT = "00"
002510         DISPLAY (22, 14) "ABERTURA DA EMPRESA FS " FS
002520         ACCEPT (22, 78) CR WITH UPDATE
002530         DISPLAY (22, 14) EX-MENS
002540         CLOSE EMPCE GO TO R-9999.
002550     READ EMPCE INVALID KEY
002560         CLOSE EMPCE.
002570     MOVE NFMD-EMPCE TO NFMD-W.
002580     CLOSE EMPCE.
002590 COPY "/dados1/book/CPYTPCE".
002600     MOVE 01 TO IND1-W.
002610     MOVE 70 TO CTL.
002620     MOVE SPACES TO RESP FLAG.
002630     MOVE ALL ZEROS TO CAMPOS CAMPOS1 CTP.
002640     DISPLAY (08, 26) "<1> LANCAMENTO DE NOTAS FISCAIS".
002650     DISPLAY (10, 26) "<2> EXCLUSAO DE NOTAS FISCAIS".
002660     DISPLAY (12, 26) "<3> LANCAMENTO DE NAO INCIDENCIAS".
002670     DISPLAY (14, 26) "<4> ALTERACAO DE NOTAS FISCAIS".
002680     DISPLAY (16, 26) "[ ] OPCAO DESEJADA".
002690 R-030.
002700     ACCEPT (16, 27) OPCAO-1 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002710     IF E = "01" GO TO R-9999.
002720     IF OPCAO-1 =  1  GO TO ROT-1.
002730     IF OPCAO-1 =  2  GO TO ROT-2.
002740     IF OPCAO-1 =  3  GO TO ROT-3.
002750     IF OPCAO-1 =  4  GO TO ROT-4.
002760     GO TO R-030.
002770 ROT-3.
002780     MOVE "TCE1701C" TO TS.
002790     MOVE "LANCAMENTO DE NAO INCIDENCIAS" TO INFT.
002800 COPY "/dados1/book/CPYTPCE".
002810     ADD 2 TO CTL.
002820     MOVE "INCIDENCIA" TO DESC-CAB2.
002830     MOVE ALL ZEROS TO CAMPOS CAMPOS1.
002840     MOVE 01 TO IND1-W.
002850     MOVE SPACES TO RESP.
002860     DISPLAY (08, 20) "1-NOTA FISCAL......: ......./..".
002870     DISPLAY (10, 20) "2-(N) NAO INCIDENCIA NO CUSTO".
002880     DISPLAY (11, 22) "(C) NAO INCIDENCIA NO CAIXA [ ]".
002890     ACCEPT (08, 41) NFHED-W(IND1-W) WITH UPDATE
002900         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002910     IF E = "01" GO TO R-020.
002920 R-035.
002930     ACCEPT (08, 49) DIFNFHED-W(IND1-W) WITH UPDATE
002940         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002950     IF E = "01" GO TO ROT-3.
002960 R-040.
002970     MOVE NFHED-W(IND1-W)    TO NFHED-08.
002980     MOVE DIFNFHED-W(IND1-W) TO DIFNFHED-08.
002990     READ ACE08 INVALID KEY
003000         DISPLAY (22, 14) "NOTA FISCAL NAO CADASTRADA < >"
003010         ACCEPT (22, 78) CR WITH UPDATE
003020         DISPLAY (22, 14) EX-MENS
003030         GO TO ROT-3.
003040 R-041.
003050     ACCEPT (11, 51) INCIDE-08 WITH UPDATE.
003060     DISPLAY (13, 20) "CONFIRME (S/<N>)...:".
003070     ACCEPT (13, 41) RESP WITH UPDATE.
003080     IF RESP NOT = "S"
003090        GO TO ROT-3.
003100     MOVE NFHED-08    TO NFHED-4.
003110     MOVE DIFNFHED-08 TO DIFNFHED-4.
003120     MOVE ESP-08      TO ESP-4.
003130     MOVE SER-08      TO SER-4.
003140     MOVE VRCONT-08   TO VRCONT-4.
003150     MOVE CLASSE-08   TO CLAS-4.
003160     MOVE EMIS-08     TO DATAI.
003170     MOVE DRECB-08    TO DATAC.
003180     MOVE DIAC        TO D-4.
003190     MOVE MESC        TO M-4.
003200     MOVE ANOC        TO A-4.
003210     MOVE DIAI        TO DD-4.
003220     MOVE MESI        TO MM-4.
003230     MOVE ANOI        TO AA-4.
003240     MOVE CODF-08     TO CODF-4.
003250     MOVE ALQ-08      TO ALQ-4.
003260     MOVE CONDHED-08  TO CONDHED-4.
003270     MOVE CONDPG-08   TO PRAZ-4.
003280     MOVE FORN-08     TO FORN-4.
003290     MOVE NOMEFOR-08 TO NOMEFOR-4.
003300     MOVE BICM-08     TO BICM-4.
003310     MOVE LOJA-08     TO LOJA-4.
003320     MOVE CODDESP-08  TO CODDESP-4.
003330     IF CUSTO-EMPCE = "N"
003340        MOVE ZEROS     TO CC-4
003350     ELSE
003360        MOVE CC-08    TO CC-4.
003370     MOVE INCIDE-08   TO INCIDE-4.
003380     REWRITE REG-08 INVALID KEY
003390        DISPLAY (22, 14) "ERRO NA REGRAVACAO -ACE08 FS=>" FS
003400        ACCEPT (22, 78) CR WITH UPDATE
003410        DISPLAY (22, 14) EX-MENS
003420        GO TO ROT-3.
003430     IF CTL > 54
003440        MOVE 5 TO CTL
003450        ADD 1 TO CTP MOVE CTP TO PAG-CAB1A
003460        WRITE REG-REL FROM CAB1A AFTER PAGE
003470        MOVE "RCE1701A" TO NOME-RELA
003480        WRITE REG-REL FROM CAB2A AFTER 1
003490        WRITE REG-REL FROM CAB132 AFTER 1
003500        WRITE REG-REL FROM CAB2 AFTER 1
003510        WRITE REG-REL FROM CAB132 AFTER 1
003520        WRITE REG-REL FROM CAB3 AFTER 2.
003530     WRITE REG-REL FROM CAB4 AFTER 1.
003540     ADD 1 TO CTL.
003550     IF INCIDE-08 = "C"
003560         NEXT SENTENCE
003570     ELSE
003580         GO TO ROT-3.
003590     MOVE NFHED-W(IND1-W)    TO DOC03.
003600     MOVE DIFNFHED-W(IND1-W) TO DIF03.
003610     READ ABA03 INVALID KEY
003620         DISPLAY (22, 14)
003630        "NAO EXISTE COPIA DE CHEQUE P/ESTA NOTA"
003640         ACCEPT (22, 78) CR WITH UPDATE
003650         DISPLAY (22, 14) EX-MENS
003660         GO TO ROT-3.
003670     MOVE 9 TO STATUS03.
003680     REWRITE REG-BA03 INVALID KEY
003690         DISPLAY (22, 14)
003700         "ERRO NA REGRAVACAO COPIA DE CHEQUE FS " FS
003710         ACCEPT (22, 78) CR WITH UPDATE
003720         DISPLAY (22, 14) EX-MENS.
003730     GO TO ROT-3.
003740 ROT-1.
003750     MOVE 01 TO IND1-W.
003760     MOVE SPACES TO RESP.
003770     MOVE "TCE1701A" TO TS.
003780     MOVE "LANCAMENTO DE NOTA FISCAL" TO INFT.
003790 COPY "/dados1/book/CPYTPCE".
003800     MOVE "  INCLUSAO" TO DESC-CAB2.
003810     MOVE 01 TO IND1-W.
003820 R-050.
003830     DISPLAY (08, 27) "NUMERO DE NOTAS..:".
003840     DISPLAY (10, 27) "TOTAL DAS NOTAS..:".
003850     DISPLAY (12, 27)
003860     "TIPO DE OPERACAO.: .  <E>NTRADA , <P>AGAMENTO".
003870     DISPLAY (14, 27) "CONFIRMA (S/<N>).:".
003880     ACCEPT (08, 46) NOTA-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003890     IF E = "01"
003900        GO TO R-020.
003910     IF NOTA-W = 0 GO TO R-050.
003920     IF NOTA-W > 20 GO TO R-050.
003930 R-060.
003940     ACCEPT (10, 46) TOT-NOTAR WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003950     IF E = "01"
003960        GO TO R-050.
003970     IF TOT-NOTAR = 0 GO TO R-060.
003980     MOVE TOT-NOTA TO ED DISPLAY (10, 46) ED.
003990 R-065.
004000     ACCEPT (12, 46) TIP-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004010     IF E = "01" GO TO R-060.
004020     IF TIP-W = "E" OR "P"
004030        NEXT SENTENCE
004040     ELSE
004050        GO TO R-065.
004060 R-070.
004070     ACCEPT (14, 46) RESP WITH UPDATE.
004080     IF RESP NOT = "S" GO TO ROT-1.
004090     DISPLAY (10, 14) EX-MENS.
004100     GO TO R-090.
004110 R-080.
004120     DISPLAY (05, 04) "01-CLASSE.................:   ".
004130     DISPLAY (06, 04) "02-NOTA FISCAL............:        /  ".
004140     DISPLAY (07, 04) "03-ESPECIE................:    ".
004150     DISPLAY (07, 45) "04-SERIE......:   ".
004160     DISPLAY (08, 04)
004170     "05-VALOR..................:                  ".
004180     DISPLAY (09, 04) "06-DATA DA EMISSAO DA NOTA:   /  /  ".
004190     DISPLAY (10, 04) "07-DATA ENTRADA DA NOTA...:   /  /  ".
004200     DISPLAY (11, 04) "08-NATUREZA DE OPERACAO...:    ".
004210     DISPLAY (11, 45) "<000 = N/GRAVA LIVRO ENTRADA>".
004220     DISPLAY (12, 04)
004230     "09-<B>ANCO <D>INH <A>CHQ <T>CART <F>PRZ".
004240     DISPLAY (12, 45) "PRAZO.........:   ".
004250     DISPLAY (13, 04)
004260     "10-FORNECEDOR.............:       -                       ".
004270     DISPLAY (14, 04)
004280     "11-CODIGO P/DESPESA.......:       -                       ".
004290     DISPLAY (15, 04) "12-ALIQUOTA ICM...........:   ".
004300     DISPLAY (15, 45) "13-RESPONSAVEL:       -             ".
004310     DISPLAY (16, 04)
004320     "14-CENTRO DE CUSTO........:     -                         ".
004330     DISPLAY (17, 04) "15-L O J A................:      ".
004340     DISPLAY (17, 45) "16-CONSUMO S/N:  ".
004350     DISPLAY (18, 04)
004360     "17-HISTORICO..............:                               ".
004370     DISPLAY (19, 04) "18-INCIDENCIA.............:  ".
004380     DISPLAY (19, 45) "19-PORTADOR...:  ".
004390 R-090.
004400     MOVE SPACES TO RESP.
004410     IF IND1-W > NOTA-W
004420        MOVE 00 TO IND1-W IND2-W GO TO R-400.
004430 COPY "/dados1/book/CPYTPCE".
004440     PERFORM R-080.
004450     IF IND1-W = NOTA-W
004460        DISPLAY (22, 14) "ESTA DEVERA SER A ULTIMA NOTA "
004470        ACCEPT (22, 78) CR WITH UPDATE
004480        DISPLAY (22, 14) EX-MENS.
004490 R-095.
004500     ACCEPT (05, 32) CLAS-W(IND1-W) WITH UPDATE
004510        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004520     IF E = "01"
004530        MOVE ALL ZEROS TO CAMPOS GO TO R-020.
004540     IF CLAS-W(IND1-W) = 0 GO TO R-095.
004550     IF CLAS-W(IND1-W) = 2 GO TO R-100.
004560     ADD 1 TO NFMD-W.
004570     MOVE NFMD-W TO NFHED-08 NFHED-W(IND1-W).
004580     MOVE ZEROS  TO DIFNFHED-08 DIFNFHED-W(IND1-W).
004590     MOVE SPACES TO CODHED-08 CHED-W(IND1-W).
004600     DISPLAY (06, 32) NFHED-W(IND1-W).
004610     DISPLAY (06, 40) DIFNFHED-W(IND1-W).
004620     GO TO R-110.
004630 R-100.
004640     ACCEPT (06, 32) NFHED-W(IND1-W) WITH UPDATE
004650        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004660     IF E = "01"
004670        GO TO R-095.
004680 R-105.
004690     ACCEPT (06, 40) DIFNFHED-W(IND1-W) WITH UPDATE
004700        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004710     IF E = "01"
004720        GO TO R-100.
004730     MOVE NFHED-W(IND1-W)    TO NFHED-08.
004740     MOVE DIFNFHED-W(IND1-W) TO DIFNFHED-08.
004750     MOVE SPACES TO CODHED-08 CHED-W(IND1-W).
004760 R-110.
004770     READ ACE08 INVALID KEY
004780        GO TO R-120.
004790     DISPLAY (22, 14)
004800     "NOTA JA CADASTRADA - ALTERANDO O CONTROLE"
004810     ACCEPT (22, 78) RESP WITH UPDATE
004820     DISPLAY (22, 14) EX-MENS
004830     ADD 1 TO DIFNFHED-W(IND1-W).
004840     ADD 1 TO DIFNFHED-08.
004850     DISPLAY (06, 40) DIFNFHED-W(IND1-W).
004860     GO TO R-110.
004870 R-120.
004880     MOVE SPACES TO ESP-W(IND1-W).
004890     ACCEPT (07, 32) ESP-W(IND1-W) WITH UPDATE
004900        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
004910     IF E = "01"
004920        IF CLAS-W(IND1-W) = 2
004930           GO TO R-100
004940        ELSE
004950           SUBTRACT 1 FROM NFMD-W
004960           GO TO R-095.
004970 R-130.
004980     MOVE SPACES TO SER-W(IND1-W).
004990     ACCEPT (07, 61) SER-W(IND1-W) WITH UPDATE
005000        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005010     IF E = "01" GO TO R-120.
005020 R-140.
005030     ACCEPT (08, 32) VALOR-WR WITH UPDATE
005040        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005050     IF E = "01" GO TO R-130.
005060     IF VALOR-WR = 0 GO TO R-140.
005070     MOVE VALOR-W TO ED.
005080     DISPLAY (08, 32) ED.
005090     ADD VALOR-W TO TOT-G.
005100     ADD VALOR-W TO TOTGERAL.
005110 R-150.
005120     ACCEPT (09, 32) DIAI WITH UPDATE
005130        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005140     IF E = "01"
005150        SUBTRACT VALOR-W FROM TOT-G
005160        SUBTRACT VALOR-W FROM TOTGERAL
005170        GO TO R-140.
005180     IF DIAI < 1 OR > 31  GO TO R-150.
005190 R-160.
005200     ACCEPT (09, 35) MESI WITH UPDATE
005210        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005220     IF E = "01"  GO TO R-150.
005230     IF MESI < 1 OR > 12  GO TO R-160.
005240 R-170.
005250     ACCEPT (09, 38) ANOI WITH UPDATE
005260        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005270     IF E = "01" GO TO R-160.
005280 R-180.
005290     ACCEPT (10, 32) DIAC WITH UPDATE
005300        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005310     IF E = "01"  GO TO R-170.
005320     IF DIAC  < 1 OR > 31  GO TO R-180.
005330 R-190.
005340     ACCEPT (10, 35) MESC WITH UPDATE
005350        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005360     IF E = "01"  GO TO R-180.
005370     IF MESC  < 1 OR > 12  GO TO R-190.
005380 R-200.
005390     ACCEPT (10, 38) ANOC WITH UPDATE
005400        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005410     IF E = "01" GO TO R-190.
005420 R-210.
005430     MOVE ZEROS TO CODF-W(IND1-W).
005440     ACCEPT (11, 32) CODF-W(IND1-W) WITH UPDATE
005450        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005460     IF E = "01" GO TO R-200.
005470 R-220.
005480     MOVE SPACES TO CONDHED-W(IND1-W).
005490     ACCEPT (12, 43) CONDHED-W(IND1-W) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005500     IF E = "01" GO TO R-210.
005510     IF CONDHED-W(IND1-W) = "A" OR "F" OR "D" OR "T" OR "B"
005520        NEXT SENTENCE
005530     ELSE
005540        GO TO R-220.
005550     IF CONDHED-W(IND1-W) = "A" OR "D" OR "T" OR "B"
005560        MOVE ZEROS TO PRAZ-W(IND1-W)
005570        GO TO R-240.
005580 R-230.
005590     ACCEPT (12, 61) PRAZ-W(IND1-W) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005600     IF E = "01" GO TO R-220.
005610     IF PRAZ-W(IND1-W) = 0 GO TO R-230.
005620 R-240.
005630     ACCEPT (13, 32) FORN-W(IND1-W) WITH UPDATE
005640         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005650     IF E = "01" GO TO R-230.
005660     IF FORN-W(IND1-W) = ZEROS
005670        MOVE SPACES TO NOMEFOR-W(IND1-W)
005680        GO TO R-245.
005690     MOVE FORN-W(IND1-W) TO CODFOR-07.
005700     READ ACE07 INVALID KEY
005710         GO TO R-245.
005720     MOVE NOMEFOR-07 TO NOMEFOR-W(IND1-W).
005730     DISPLAY (13, 40) NOMEFOR-W(IND1-W).
005740     GO TO R-250.
005750 R-245.
005760     MOVE SPACES TO NOMEFOR-W(IND1-W)
005770     ACCEPT (13, 40) NOMEFOR-W(IND1-W) WITH UPDATE
005780        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005790     IF E = "01"
005800        GO TO R-240.
005810 R-250.
005820     MOVE ZEROS TO CODDESP-W(IND1-W).
005830     ACCEPT (14, 32) CODDESP-W(IND1-W) WITH UPDATE.
005840     IF CODDESP-W(IND1-W) = ZEROS GO TO R-270.
005850     MOVE CODDESP-W(IND1-W) TO CODCA-10.
005860     READ ACA10 INVALID KEY
005870        GO TO R-250.
005880     DISPLAY (14, 40) DESCA-10.
005890 R-270.
005900     ACCEPT (15, 32) ALQ-W(IND1-W) WITH UPDATE
005910        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
005920     IF E = "01"
005930        GO TO R-240.
005940     MOVE 0 TO CAM1 MOVE ALQ-W(IND1-W) TO CAM2.
005950     MULTIPLY CAMPOAL BY VALOR-WR GIVING BICM-WR(IND1-W).
005960 R-271.
005970     IF CONDHED-W(IND1-W) = "F" GO TO R-280.
005980     ACCEPT (15, 61) RESPON-W(IND1-W) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005990     IF E = "01" GO TO R-270.
006000     MOVE RESPON-W(IND1-W) TO CODIGO-04.
006010     READ ACA04 INVALID KEY
006020        DISPLAY (22, 14) "RESPONSAVEL NAO CADASTRADO"
006030        ACCEPT (22, 78) CR WITH UPDATE
006040        DISPLAY (22, 14) EX-MENS
006050        GO TO R-271.
006060     MOVE NOME-04 TO NOME-W.
006070     DISPLAY (15, 68) NOME-W.
006080 R-280.
006090     ACCEPT (16, 32) CC-W(IND1-W) WITH UPDATE
006100        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006110     IF E = "01"
006120        IF CONDHED-W(IND1-W) = "F"
006130           GO TO R-270
006140        ELSE
006150           GO TO R-271.
006160     IF CUSTO-EMPCE = "N"
006170        MOVE ZEROS TO CC-W(IND1-W)
006180        DISPLAY (15, 32) "    "
006190        GO TO R-300.
006200     IF CC-W(IND1-W) = 0 GO TO R-280.
006210     MOVE CC-W(IND1-W) TO CODICC-01.
006220     MOVE ZEROS TO HISCC-01.
006230     READ ACC01 INVALID KEY
006240        DISPLAY (22, 14) "CENTRO DE CUSTO NAO CADASTRADO"
006250        ACCEPT (22, 78) CR WITH UPDATE
006260        DISPLAY (22, 14) EX-MENS
006270        GO TO R-280.
006280     DISPLAY (16, 49) NOMECC-01.
006290 R-300.
006300     ACCEPT (17, 32) LOJA-W(IND1-W) WITH UPDATE
006310         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006320     IF E = "01" GO TO R-280.
006330 R-305.
006340     MOVE SPACES TO HIST-W(IND1-W).
006350     MOVE "N" TO CONS-W(IND1-W).
006360     DISPLAY (17, 61) CONS-W(IND1-W).
006370     ACCEPT (17, 61) CONS-W(IND1-W) WITH UPDATE
006380        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006390     IF E = "01" GO TO R-300.
006400     IF CONDHED-W(IND1-W) = "A" OR "D" OR "T" OR "B"
006410        ACCEPT (18, 32) HIST-W(IND1-W) WITH UPDATE
           ACCEPT E FROM ESCAPE KEY.
006420        IF E = "01"
006430           GO TO R-305.
006440 R-306.
006450     ACCEPT (19, 61) PORT-W(IND1-W) WITH UPDATE
006460        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006470     IF E = "01" GO TO R-305.
006480 R-310.
006490     MOVE SPACES TO RESP.
006500     DISPLAY (22, 14) "CONFIRME ESTA NOTA (S/<N>):".
006510     ACCEPT (22, 42) RESP WITH UPDATE.
006520     DISPLAY (22, 14) EX-MENS.
006530     IF RESP IS NOT = "S"
006540        IF CLAS-W(IND1-W) = 2
006550           SUBTRACT VALOR-W FROM TOT-G TOTGERAL
006560           GO TO R-090
006570        ELSE
006580           SUBTRACT VALOR-W FROM TOT-G TOTGERAL
006590           SUBTRACT 1 FROM NFMD-W
006600           GO TO R-090.
006610 R-320.
006620     IF CONDHED-W(IND1-W) = "A" OR "D" OR "T" OR "B"
006630        GO TO R-390.
006640 R-330.
006650     MOVE 0 TO IND2-W WS-FAT.
006660 R-340.
006670     ADD 1 TO IND2-W.
006680     IF IND2-W > 10
006690        GO TO R-330.
006700     DISPLAY (20, 17)
006710     "VENCIMENTO [  ] PARCELA: ../../.. VALOR.:"
006720     DISPLAY (20, 29) IND2-W.
006730 R-350.
006740     ACCEPT (20, 42) DV-52W(IND1-W IND2-W) WITH UPDATE
006750          AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006760     IF E = "01"  GO TO  R-230.
006770     IF DV-52W(IND1-W IND2-W) > 31 GO TO R-350.
006780     IF DV-52W(IND1-W IND2-W) = 00
006790        DISPLAY (20, 17) EX-MENS
006800        IF WS-FAT = VALOR-W
006810           GO TO R-390
006820        ELSE
006830           DISPLAY (22, 14) EX-MENS
006840           DISPLAY (22, 14) "VALOR NAO CONFERE ==>"
006850           ACCEPT CR DISPLAY (22, 14) EX-MENS
006860           GO TO R-330.
006870 R-360.
006880     ACCEPT (20, 45) MV-52W(IND1-W IND2-W) WITH UPDATE
006890          AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006900     IF E = "01" GO TO R-350.
006910     IF MV-52W(IND1-W IND2-W) = 0 OR > 12 GO TO R-360.
006920 R-370.
006930     ACCEPT (20, 48) AV-52W(IND1-W IND2-W) WITH UPDATE
006940          AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
006950     IF E = "01" GO TO R-360.
006960 R-380.
006970     ACCEPT (20, 58) FATRED-52W(IND1-W IND2-W) WITH UPDATE
006980          AUTO-SKIP.
006990     IF FATRED-52W(IND1-W IND2-W) = ZEROS
007000        GO TO R-380.
007010     ADD FAT-52W(IND1-W IND2-W) TO WS-FAT.
007020     MOVE NFHED-W(IND1-W) TO NFAT-52W(IND1-W IND2-W).
007030     MOVE DIAI       TO DE-52W(IND1-W IND2-W).
007040     MOVE MESI       TO ME-52W(IND1-W IND2-W).
007050     MOVE ANOI       TO AE-52W(IND1-W IND2-W).
007060     SUBTRACT 1 FROM IND2-W GIVING DIFFAT-52W(IND1-W IND2-W).
007070     GO TO R-340.
007080 R-390.
007090     MOVE VALOR-W TO VRCONT-W(IND1-W).
007100     MOVE DATAI   TO DEMIS-W(IND1-W).
007110     MOVE DATAC   TO DENTR-W(IND1-W).
007120     ADD 1        TO IND1-W NOTA-C.
007130     MOVE ALL ZEROS TO VALOR-W DATAI DATAC.
007140     GO TO R-090.
007150 R-400.
007160     MOVE SPACES TO RESP.
007170     DISPLAY (22, 14) "CONFIRME ESTE LOTE (S/<N>):".
007180     ACCEPT (22, 42) RESP WITH UPDATE.
007190     DISPLAY (22, 14) EX-MENS.
007200     IF RESP IS NOT EQUAL "S"
007210        GO TO R-020.
007220     IF TOT-G NOT = TOT-NOTA OR NOTA-W NOT = NOTA-C
007230        GO TO R-440.
007240 R-410.
007250     ADD 1 TO IND1-W.
007260     IF IND1-W > NOTA-W
007270        MOVE TOTGERAL TO TOT-7
007280        WRITE REG-REL FROM CAB7 AFTER 2
007290        PERFORM R-900
007300        DISPLAY (22, 14) "LOTE INCLUIDO COM EXITO  < >"
007310        ACCEPT (22, 78) CR WITH UPDATE
007320        DISPLAY (22, 14) EX-MENS
007330        MOVE ALL ZEROS TO CAMPOS TOT-G NOTA-C TOTGERAL
007340        GO TO R-020.
007350 R-420.
007360     MOVE NFHED-W(IND1-W)    TO NFHED-08 NFHED-4.
007370     MOVE DIFNFHED-W(IND1-W) TO DIFNFHED-08 DIFNFHED-4.
007380     MOVE SPACES TO CODHED-08.
007390     MOVE ESP-W(IND1-W)      TO ESP-08 ESP-4.
007400     MOVE SER-W(IND1-W)      TO SER-08 SER-4.
007410     MOVE CLAS-W(IND1-W)     TO CLASSE-08 CLAS-4.
007420     MOVE VRCONT-W(IND1-W)   TO VRCONT-08 VRCONT-4.
007430     MOVE DATA-W             TO DATLAN-08.
007440     MOVE DEMIS-W(IND1-W)    TO EMIS-08 DATAI.
007450     MOVE DENTR-W(IND1-W)    TO DRECB-08 DATAC.
007460     MOVE DIAI               TO DD-4.
007470     MOVE MESI               TO MM-4.
007480     MOVE ANOI               TO AA-4.
007490     MOVE ANOC               TO A-4.
007500     MOVE MESC               TO M-4.
007510     MOVE DIAC               TO D-4.
007520     MOVE CODF-W(IND1-W)     TO CODF-08 CODF-4.
007530     MOVE ALQ-W(IND1-W)      TO ALQ-08 ALQ-4.
007540     IF CONDHED-W(IND1-W) = "D" OR "T" OR "B"
007550         MOVE "A" TO CONDHED-08
007560     ELSE
007570         MOVE CONDHED-W(IND1-W) TO CONDHED-08.
007580     MOVE CONDHED-W(IND1-W)  TO CONDHED-4.
007590     MOVE PRAZ-W(IND1-W)     TO CONDPG-08 PRAZ-4.
007600     MOVE FORN-W(IND1-W)     TO FORN-08 FORN-4.
007610     MOVE NOMEFOR-W(IND1-W)  TO NOMEFOR-08 NOMEFOR-4.
007620     MOVE BICM-W(IND1-W)     TO BICM-08 BICM-4.
007630     MOVE CC-W(IND1-W)       TO CC-08 CC-4.
007640     MOVE SPACES             TO INCIDE-08.
007650     MOVE SPACES             TO CODHED-08.
007660     MOVE LOJA-W(IND1-W)     TO LOJA-08 LOJA-4.
007670     MOVE CODDESP-W(IND1-W)  TO CODDESP-08 CODDESP-4.
007680     MOVE CONS-W(IND1-W)     TO CONSUMO-08.
007690     MOVE PORT-W(IND1-W)     TO PORT-08.
007700     WRITE REG-08 INVALID KEY
007710        DISPLAY (22, 14) "ERRO NA GRAVACAO -ACE08 FS=>" FS
007720        ACCEPT (22, 78) CR WITH UPDATE
007730        DISPLAY (22, 14) EX-MENS
007740        GO TO R-410.
007750     IF CTL > 54
007760        MOVE 8 TO CTL
007770        ADD 1 TO CTP
007780        MOVE CTP TO PAG-CAB1A
007790        WRITE REG-REL FROM CAB1A AFTER PAGE
007800        MOVE "RCE1701A" TO NOME-RELA
007810        WRITE REG-REL FROM CAB2A AFTER 1
007820        WRITE REG-REL FROM CAB132 AFTER 1
007830        WRITE REG-REL FROM CAB2 AFTER 1
007840        WRITE REG-REL FROM CAB132 AFTER 1
007850        WRITE REG-REL FROM CAB3 AFTER 2.
007860     WRITE REG-REL FROM CAB4 AFTER 1.
007870     ADD 1 TO CTL.
007880     MOVE ZEROS  TO NFHED-4 PRAZ-4 VRCONT-4
007890                    DD-4 MM-4 AA-4 CODF-4
007900                    ALQ-4 BICM-4 FORN-4 CC-4
007910                    CLAS-4 D-4 M-4 A-4.
007920     MOVE SPACES TO ESP-4 CONDHED-4 INCIDE-4 SER-4.
007930     IF CONDHED-W(IND1-W) = "A" OR "D" OR "T" OR "B" GO TO R-431.
007940     MOVE 0 TO IND2-W.
007950 R-430.
007960     ADD 1 TO IND2-W.
007970     IF NFAT-52W(IND1-W IND2-W) = ZEROS GO TO R-410.
007980 R-430A.
007990     MOVE NFAT-52W(IND1-W IND2-W)   TO NFAT-52 NF-52 NUMFAT-6.
008000     MOVE DIFFAT-52W(IND1-W IND2-W) TO DIFFAT-52 DIFFAT-6.
008010     IF TIP-W = "E" GO TO R-430AA.
008020     MOVE NFAT-52   TO DOC03.
008030     MOVE DIFFAT-52 TO DIF03.
008040     READ ABA03 INVALID KEY
008050        GO TO R-430AA.
008060     ADD 1 TO DIFFAT-52W(IND1-W IND2-W).
008070     GO TO R-430A.
008080 R-430AA.
008090     READ ACT52 INVALID KEY
008100        GO TO R-430B.
008110     ADD 1 TO DIFFAT-52W(IND1-W IND2-W).
008120     GO TO R-430A.
008130 R-430B.
008140     MOVE FORN-W(IND1-W)            TO FOR-52 FOR-6.
008150     MOVE AE-52W(IND1-W IND2-W)     TO AE-52 AE-6.
008160     MOVE ME-52W(IND1-W IND2-W)     TO ME-52 ME-6.
008170     MOVE DE-52W(IND1-W IND2-W)     TO DE-52 DE-6.
008180     MOVE AV-52W(IND1-W IND2-W)     TO AV-52 AV-6.
008190     MOVE MV-52W(IND1-W IND2-W)     TO MV-52 MV-6.
008200     MOVE DV-52W(IND1-W IND2-W)     TO DV-52 DV-6.
008210     MOVE FAT-52W(IND1-W IND2-W)    TO FAT-52 FAT-6.
008220     MOVE SPACES                    TO STATUS-52 SIT-52 CARTA-52
008230     MOVE IND2-W                    TO PAR-6.
008240     MOVE CC-W(IND1-W)              TO CC-52.
008250     MOVE CLAS-W(IND1-W)            TO CLASSE-52.
008260     MOVE CODDESP-W(IND1-W)         TO CODDEP-52.
008270     WRITE REG-CT52 INVALID KEY
008280        DISPLAY (22, 14) "ERRO NA GRAVACAO DO ACT52 FS=>" FS
008290        ACCEPT (22, 78) CR WITH UPDATE
008300        DISPLAY (22, 14) EX-MENS
008310        GO TO R-430.
008320     IF CTL > 60
008330        MOVE 8 TO CTL
008340        ADD 1 TO CTP MOVE CTP TO PAG-CAB1A
008350        WRITE REG-REL FROM CAB1A AFTER PAGE
008360        MOVE "RCE1701B" TO NOME-RELA
008370        WRITE REG-REL FROM CAB2A AFTER 1
008380        WRITE REG-REL FROM CAB132 AFTER 1
008390        WRITE REG-REL FROM CAB2 AFTER 1
008400        WRITE REG-REL FROM CAB132 AFTER 1
008410        WRITE REG-REL FROM CAB3 AFTER 2.
008420     WRITE REG-REL FROM CAB6 AFTER 1.
008430     WRITE REG-REL FROM CAB132 AFTER 1.
008440     ADD 2 TO CTL.
008450     MOVE ALL ZEROS TO REG-CT52.
008460     MOVE SPACES TO SIT-52.
008470     GO TO R-430.
008480 R-431.
008490     MOVE NFHED-W(IND1-W) TO DOC03.
008500     MOVE DIFNFHED-W(IND1-W) TO DIF03.
008510 R-431A.
008520     MOVE DOC03 TO NFAT-52.
008530     MOVE DIF03 TO DIFFAT-52.
008540     READ ACT52 INVALID KEY
008550         GO TO R-431B.
008560     ADD 1 TO DIF03
008570     GO TO R-431A.
008580 R-431B.
008590     IF TIP-W = "E" GO TO R-433.
008600     READ ABA03 INVALID KEY
008610         GO TO R-432.
008620     DISPLAY (22, 14)
008630     "COPIA DE CHEQUE JA CADASTRADA " DOC03 " " DIF03
008640     ACCEPT (22, 78) CR WITH UPDATE
008650     DISPLAY (22, 14) EX-MENS
008660     GO TO R-433.
008670 R-432.
008680     MOVE ZEROS TO REG-BA03.
008690     MOVE NFHED-W(IND1-W)    TO DOC03.
008700     MOVE DIFNFHED-W(IND1-W) TO DIF03.
008710     MOVE NOMEFOR-W(IND1-W)  TO NOMEFOR03.
008720     MOVE RESPON-W(IND1-W)   TO RESPONSAVEL03.
008730     MOVE VRCONT-W(IND1-W)   TO VALOR03R.
008740     MOVE HIST-W(IND1-W)     TO HIST03.
008750     MOVE DENTR-W(IND1-W)    TO DATAC.
008760     MOVE ANOC TO ANO03.
008770     MOVE MESC TO MES03.
008780     MOVE DIAC TO DIA03.
008790     IF CONDHED-W(IND1-W) = "A"
008800        MOVE "C" TO TIPO03
008810     ELSE
008820        MOVE CONDHED-W(IND1-W) TO TIPO03.
008830     WRITE REG-BA03 INVALID KEY
008840        DISPLAY (22, 14)
008850        "ERRO NO WRITE COPIA DE CHEQUE FS " FS
008860         ACCEPT (22, 78) CR WITH UPDATE
008870         DISPLAY (22, 14) EX-MENS.
008880 R-433.
008890     IF CODDESP-W(IND1-W) = ZEROS GO TO R-410.
008900     MOVE CODDESP-W(IND1-W) TO CODCA-10.
008910     READ ACA10 INVALID KEY
008920        DISPLAY (22, 14)
008930        "CODIGO P/DESPESA NAO CADASTRADO " CODCA-10
008940        ACCEPT (22, 78) CR WITH UPDATE
008950        DISPLAY (22, 14) EX-MENS
008960        GO TO R-410.
008970     GO TO R-410.
008980 R-440.
008990     MOVE "TCE1701D" TO TS.
009000     MOVE "LOTE NAO SERA GRAVADO" TO INFT.
009010 COPY "/dados1/book/CPYTPCE".
009020     DISPLAY (06, 20) "NUMERO DE NOTAS INFORMADO: " NOTA-W
009030     DISPLAY (07, 20) "NUMERO DE NOTAS CALCULADO: " NOTA-C
009040     MOVE TOT-NOTA TO ED
009050     DISPLAY (08, 20) "TOTAL INFORMADO..........: " ED
009060     MOVE TOT-G TO ED
009070     DISPLAY (09, 20) "TOTAL CALCULADO..........: " ED
009080     ACCEPT (22, 78) CR WITH UPDATE.
009090     MOVE ALL ZEROS TO CAMPOS TOT-G NOTA-C.
009100     SUBTRACT TOT-G FROM TOTGERAL.
009110     GO TO R-020.
009120*========================================*
009130*    ROTINA DE EXCLUSAO DE NOTAS FISCAIS *
009140*========================================*
009150 ROT-2.
009160     MOVE 01 TO IND1-W.
009170     MOVE "TCE1701B" TO TS.
009180     MOVE "EXCLUSAO DE NOTA FISCAL" TO INFT.
009190 COPY "/dados1/book/CPYTPCE".
009200     MOVE "  EXCLUSAO" TO DESC-CAB2.
009210     MOVE 0 TO IND2-W.
009220     PERFORM R-080.
009230 R-450.
009240     ACCEPT (06, 32) NFHED-08 WITH UPDATE
009250        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
009260     IF E = "01" GO TO R-020.
009270 R-465.
009280     ACCEPT (06, 40) DIFNFHED-08 WITH UPDATE
009290        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
009300     IF E = "01" GO TO R-450.
009310     MOVE SPACES TO CODHED-08 RESP.
009320     MOVE "0" TO FLAG.
009330     READ ACE08 INVALID KEY
009340        DISPLAY (22, 14) "NOTA FISCAL NAO ENCONTRADA < >"
009350        ACCEPT (22, 78) CR WITH UPDATE
009360        DISPLAY (22, 14) EX-MENS
009370        MOVE "1" TO FLAG
009380        DISPLAY (22, 14) "QUER PESQUISAR (S/<N>)"
009390        ACCEPT (22, 36) RESP WITH UPDATE.
009400     IF FLAG = "1"
009410        IF RESP = "S"
009420           GO TO R-460
009430        ELSE
009440           GO TO ROT-2.
009450 R-460.
009460     MOVE SPACES TO CODHED-08
009470     START ACE08 KEY NOT < CHAVE-08 INVALID KEY MOVE 1 TO ST.
009480 R-470.
009490     READ ACE08 NEXT RECORD AT END
009500        DISPLAY (22, 14) "NOTA FISCAL NAO ENCONTRADA < >"
009510        ACCEPT (22, 78) CR WITH UPDATE
009520        DISPLAY (22, 14) EX-MENS
009530        GO TO ROT-2.
009540     MOVE NFHED-08    TO DOC03.
009550     MOVE DIFNFHED-08 TO DIF03.
009560     READ ABA03 INVALID KEY
009570        MOVE "SEM COPIA DE CHEQUE" TO NOME-W
009580        GO TO R-480.
009590     MOVE RESPONSAVEL03 TO CODIGO-04.
009600     READ ACA04 INVALID KEY
009610        MOVE "SEM RESPONSAVEL" TO NOME-W
009620        GO TO R-480.
009630     MOVE NOME-04 TO NOME-W.
009640 R-480.
009650     MOVE NFHED-08    TO NFHED-4
009660     MOVE DIFNFHED-08 TO DIFNFHED-4.
009670     MOVE ESP-08      TO ESP-4
009680     MOVE CONDPG-08   TO PRAZ-4
009690     MOVE SER-08      TO SER-4
009700     MOVE VRCONT-08   TO VRCONT-4
009710     MOVE EMIS-08     TO DATAI
009720     MOVE DIAI        TO DD-4
009730     MOVE MESI        TO MM-4
009740     MOVE ANOI        TO AA-4
009750     MOVE DRECB-08    TO DATAC
009760     MOVE DIAC        TO D-4
009770     MOVE MESC        TO M-4
009780     MOVE ANOC        TO A-4
009790     MOVE CODF-08     TO CODF-4
009800     MOVE ALQ-08      TO ALQ-4
009810     MOVE BICM-08     TO BICM-4
009820     MOVE CONDHED-08  TO CONDHED-4
009830     MOVE FORN-08     TO FORN-4
009840     MOVE NOMEFOR-08  TO NOMEFOR-4.
009850     IF CUSTO-EMPCE = "N"
009860        MOVE ZEROS    TO CC-4
009870     ELSE
009880        MOVE CC-08    TO CC-4.
009890     MOVE INCIDE-08   TO INCIDE-4.
009900     MOVE CLASSE-08   TO CLAS-4.
009910     MOVE LOJA-08     TO LOJA-4.
009920     MOVE CODDESP-08  TO CODDESP-4.
009930     DISPLAY (05, 32) CLASSE-08.
009940     DISPLAY (06, 32) NFHED-08.
009950     DISPLAY (06, 40) DIFNFHED-08.
009960     DISPLAY (07, 32) ESP-08
009970     DISPLAY (07, 61) SER-08
009980     MOVE VRCONT-08  TO ED
009990     DISPLAY (08, 32) ED
010000     DISPLAY (09, 32) DIAI
010010     DISPLAY (09, 35) MESI
010020     DISPLAY (09, 38) ANOI
010030     DISPLAY (10, 32) DIAC.
010040     DISPLAY (10, 35) MESC.
010050     DISPLAY (10, 38) ANOC.
010060     DISPLAY (11, 32) CODF-08
010070     DISPLAY (12, 43) CONDHED-08
010080     DISPLAY (12, 61) CONDPG-08
010090     DISPLAY (13, 32) FORN-08
010100     DISPLAY (13, 40) NOMEFOR-08.
010110     DISPLAY (14, 32) CODDESP-08.
010120     IF CODDESP-08 = ZEROS
010130        GO TO R-485.
010140     MOVE CODDESP-08 TO CODCA-10.
010150     READ ACA10 INVALID KEY
010160        MOVE "SEM CODIGO DE DESPESAS" TO DESCA-10.
010170     DISPLAY (14, 40) DESCA-10.
010180 R-485.
010190     DISPLAY (15, 32) ALQ-08
010200     DISPLAY (15, 68) NOME-W.
010210     DISPLAY (17, 32) LOJA-08.
010220     DISPLAY (18, 32) HIST03.
010230     DISPLAY (17, 61) CONSUMO-08.
010240     DISPLAY (19, 61) PORT-08.
010250 R-490.
010260     EXIT.
010270 R-500.
010280     IF CUSTO-EMPCE = "N"
010290        DISPLAY (16, 32) "NAO "
010300        GO TO R-510
010310     ELSE
010320        DISPLAY (16, 32) CC-08.
010330     MOVE CC-08 TO CODICC-01.
010340     MOVE ZEROS TO HISCC-01.
010350     READ ACC01 INVALID KEY
010360         MOVE "CENTRO DE CUSTO NAO CADASTRADO" TO NOMECC-01.
010370     DISPLAY (16, 49) NOMECC-01.
010380 R-510.
010390     MOVE SPACES TO RESP.
010400     DISPLAY (22, 14) "CONFIRMA EXCLUSAO (S/<N>):".
010410     ACCEPT (22, 41) RESP WITH UPDATE.
010420     DISPLAY (22, 14) EX-MENS.
010430     IF RESP NOT = "S"
010440        MOVE SPACES TO RESP
010450        DISPLAY (22, 14) "CONTINUA PROCURANDO (S/<N>):"
010460        ACCEPT (22, 43) RESP WITH UPDATE
010470        DISPLAY (22, 14) EX-MENS
010480        IF RESP = "S"
010490           GO TO R-470
010500        ELSE
010510           GO TO ROT-2.
010520     DELETE ACE08 INVALID KEY
010530        DISPLAY (22, 14) "ERRO NA EXCLUSAO -ACE08 FS=>" FS
010540        ACCEPT (22, 78) CR WITH UPDATE
010550        DISPLAY (22, 14) EX-MENS
010560        GO TO ROT-2.
010570     IF CONDHED-08 = "F" GO TO R-520.
010580     MOVE ZEROS TO IND4-W.
010590 R-515.
010600     MOVE NFHED-08   TO DOC03.
010610     MOVE IND4-W     TO DIF03.
010620     IF IND4-W = 99 GO TO R-531.
010630     READ ABA03 INVALID KEY
010640        ADD 1 TO IND4-W
010650        GO TO R-515.
010660     IF VRCONT-08 = VALOR03R AND DREC-08 = DIA03 AND
010670        MREC-08 = MES03 AND AREC-08 = ANO03
010680        NEXT SENTENCE
010690     ELSE
010700        ADD 1 TO IND4-W
010710        GO TO R-515.
010720     DELETE ABA03 INVALID KEY
010730        DISPLAY (22, 14)
010740        "ERRO NA EXCLUSAO COPIA DE CHEQUE FS " FS
010750        ACCEPT (22, 78) CR WITH UPDATE
010760        DISPLAY (22, 14) EX-MENS.
010770     GO TO R-531.
010780 R-520.
010790     IF IND2-W = 99
010800        GO TO R-531.
010810     MOVE NFHED-08  TO NFAT-52.
010820     MOVE IND2-W    TO DIFFAT-52.
010830     READ ACT52 INVALID KEY
010840        ADD 1 TO IND2-W
010850        GO TO R-520.
010860     IF FOR-52 = FORN-08
010870        NEXT SENTENCE
010880     ELSE
010890        ADD 1 TO IND2-W
010900        GO TO R-520.
010910     DELETE ACT52 INVALID KEY
010920        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACT52 FS=>" FS
010930        ACCEPT (22, 78) CR WITH UPDATE
010940        DISPLAY (22, 14) EX-MENS.
010950     MOVE NFAT-52   TO DOC03.
010960     MOVE DIFFAT-52 TO DIF03.
010970     READ ABA03 INVALID KEY
010980        ADD 1 TO IND2-W
010990        GO TO R-520.
011000     DELETE ABA03 INVALID KEY
011010        MOVE 1 TO ST.
011020     ADD 1 TO IND2-W.
011030     GO TO R-520.
011040 R-531.
011050     DISPLAY (22, 14) "EXCLUSAO COM EXITO".
011060     ACCEPT (22, 78) CR WITH UPDATE.
011070     DISPLAY (22, 14) EX-MENS.
011080     IF CTL > 54
011090        MOVE 5 TO CTL
011100        ADD 1 TO CTP
011110        MOVE CTP TO PAG-CAB1A
011120        WRITE REG-REL FROM CAB1A AFTER PAGE
011130        MOVE "RCE1701C" TO NOME-RELA
011140        WRITE REG-REL FROM CAB2A AFTER 1
011150        WRITE REG-REL FROM CAB132 AFTER 1
011160        WRITE REG-REL FROM CAB2 AFTER 1
011170        WRITE REG-REL FROM CAB132 AFTER 1
011180        WRITE REG-REL FROM CAB3 AFTER 2.
011190     WRITE REG-REL FROM CAB4 AFTER 1.
011200     ADD 1 TO CTL.
011210     MOVE ZEROS TO NFHED-4 DIFNFHED-4 PRAZ-4 VRCONT-4 D-4
011220                   MM-4 AA-4 D-4 M-4 CODF-4 ALQ-4 BICM-4
011230                   FORN-4 CC-4 CLAS-4 A-4.
011240     MOVE SPACES TO ESP-4 CONDHED-4 INCIDE-4 SER-4.
011250     GO TO ROT-2.
011260 ROT-4.
011270     MOVE 01 TO IND1-W.
011280     MOVE "TCE1701C" TO TS.
011290     MOVE "ALTERACAO DE NOTA FISCAL" TO INFT.
011300 COPY "/dados1/book/CPYTPCE".
011310     MOVE " ALTERACAO" TO DESC-CAB2.
011320     MOVE 0 TO IND2-W.
011330     PERFORM R-080.
011340 R-540.
011350     ACCEPT (06, 32) NFHED-08 WITH UPDATE
011360         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
011370     IF E = "01" GO TO R-020.
011380 R-545.
011390     ACCEPT (06, 40) DIFNFHED-08 WITH UPDATE
011400         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
011410     IF E = "01" GO TO R-540.
011420     MOVE SPACES TO CODHED-08 RESP.
011430     MOVE "0" TO FLAG.
011440     READ ACE08 INVALID KEY
011450        DISPLAY (22, 14) "NOTA FISCAL NAO ENCONTRADA < >"
011460        ACCEPT (22, 78) CR WITH UPDATE
011470        DISPLAY (22, 14) EX-MENS
011480        MOVE "1" TO FLAG
011490        DISPLAY (22, 14) "QUER PESQUISAR (S/<N>)"
011500        ACCEPT (22, 36) RESP WITH UPDATE.
011510     IF FLAG = "1"
011520        IF RESP = "S"
011530           GO TO R-550
011540        ELSE
011550           GO TO ROT-4.
011560 R-550.
011570     MOVE SPACES TO CODHED-08
011580     START ACE08 KEY NOT < CHAVE-08 INVALID KEY MOVE 1 TO ST.
011590 R-560.
011600     READ ACE08 NEXT RECORD AT END
011610         DISPLAY (22, 14) "NOTA FISCAL NAO ENCONTRADA < >"
011620         ACCEPT (22, 78) CR WITH UPDATE
011630         DISPLAY (22, 14) EX-MENS
011640         GO TO ROT-4.
011650     MOVE NFHED-08 TO DOC03.
011660     MOVE DIFNFHED-08 TO DIF03.
011670     READ ABA03 INVALID KEY
011680         MOVE "SEM COPIA DE CHEQUE" TO NOME-W
011690         GO TO R-570.
011700 R-561.
011710     MOVE RESPONSAVEL03 TO CODIGO-04.
011720     READ ACA04 INVALID KEY
011730         MOVE "SEM RESPONSAVEL" TO NOME-W
011740         GO TO R-570.
011750     MOVE NOME-04 TO NOME-W.
011760 R-570.
011770     PERFORM R-480 THRU R-490.
011780 R-580.
011790     IF CUSTO-EMPCE = "N"
011800        DISPLAY (16, 32) "NAO "
011810        GO TO R-590
011820     ELSE
011830        DISPLAY (16, 32) CC-08.
011840     MOVE CC-08 TO CODICC-01.
011850     MOVE ZEROS TO HISCC-01.
011860     READ ACC01 INVALID KEY
011870         MOVE "CENTRO DE CUSTO NAO CADASTRADO" TO NOMECC-01.
011880     DISPLAY (16, 49) NOMECC-01.
011890 R-585.
011900     ACCEPT (05, 32) CLASSE-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
011910     IF E = "01" GO TO R-540.
011920 R-590.
011930     ACCEPT (07, 32) ESP-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
011940     IF E = "01" GO TO R-585.
011950 R-600.
011960     ACCEPT (07, 61) SER-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
011970     IF E = "01" GO TO R-590.
011980 R-610.
011990     MOVE VRCONT-08 TO VALOR-W.
012000     ACCEPT (08, 32) VALOR-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012010     IF E = "01" GO TO R-600.
012020     MOVE VALOR-W TO ED DISPLAY (08, 32) ED.
012030 R-620.
012040     ACCEPT (09, 32) DIAI WITH UPDATE
012050         	AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
012060     IF E = "01" GO TO R-610.
012070     IF DIAI = 0 OR > 31 GO TO R-620.
012080 R-630.
012090     ACCEPT (09, 35) MESI WITH UPDATE
012100         	AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
012110     IF E = "01" GO TO R-620.
012120     IF MESI = 0 OR > 12 GO TO R-630.
012130 R-640.
012140     ACCEPT (09, 38) ANOI WITH UPDATE.
012150     IF ANOI = 0 GO TO R-640.
           ACCEPT E FROM ESCAPE KEY.
012160     IF E = "01" GO TO R-630.
012170     MOVE DATAI TO EMIS-08.
012180 R-650.
012190     ACCEPT (10, 32) DIAC WITH UPDATE
012200         	AUTO-SKIP.
012210     IF DIAC = 0 OR > 31 GO TO R-650.
           ACCEPT E FROM ESCAPE KEY.
012220     IF E = "01" GO TO R-640.
012230 R-660.
012240     ACCEPT (10, 35) MESC WITH UPDATE
012250         	AUTO-SKIP.
012260     IF MESC = 0 OR > 12 GO TO R-660.
           ACCEPT E FROM ESCAPE KEY.
012270     IF E = "01" GO TO R-650.
012280 R-670.
012290     ACCEPT (10, 38) ANOC WITH UPDATE.
012300     IF ANOC = 0 GO TO R-670.
           ACCEPT E FROM ESCAPE KEY.
012310     IF E = "01" GO TO R-660.
012320     MOVE DATAC TO DRECB-08.
012330 R-680.
012340     ACCEPT (11, 32) CODF-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012350     IF E = "01" GO TO R-670.
012360 R-690.
012370     MOVE CONDHED-08 TO CONDANT-W.
012380     ACCEPT (12, 43) CONDHED-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012390     IF E = "01" GO TO R-680.
012400     IF CONDHED-08 = "A" OR "F" OR "D" OR "T" OR "B"
012410        NEXT SENTENCE
012420     ELSE
012430        GO TO R-690.
012440     IF CONDHED-08 = "A" OR "D" OR "T" OR "B"
012450        MOVE ZEROS TO CONDPG-08 GO TO R-710.
012460 R-700.
012470     MOVE ZEROS TO IND1-W IND2-W.
012480     MOVE CONDPG-08 TO WS-PRAZO.
012490     ACCEPT (12, 61) CONDPG-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012500     IF E = "01" GO TO R-690.
012510     IF CONDPG-08 = 0 AND CONDHED-08 = "F" GO TO R-700.
012520 R-710.
012530     ACCEPT (13, 32) FORN-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012540     IF E = "01" GO TO R-690.
012550     IF FORN-08 = ZEROS
012560*       MOVE SPACES TO NOMEFOR-08
012570        GO TO R-711.
012580     MOVE FORN-08 TO CODFOR-07.
012590     MOVE 1 TO IND1-W.
012600     READ ACE07 INVALID KEY
012610         GO TO R-711.
012620     MOVE NOMEFOR-07 TO NOMEFOR-08.
012630     DISPLAY (13, 40) NOMEFOR-08.
012640     GO TO R-720.
012650 R-711.
012660     ACCEPT (13, 40) NOMEFOR-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012670     IF E = "01"
012680        GO TO R-700.
012690 R-720.
012700     ACCEPT (14, 32) CODDESP-08 WITH UPDATE.
012710     MOVE CODDESP-08 TO CODCA-10.
012720     IF CODDESP-08 = ZEROS GO TO R-740.
012730     READ ACA10 INVALID KEY
012740        GO TO R-720.
012750     DISPLAY (14, 40) DESCA-10.
012760 R-740.
012770     ACCEPT (15, 32) ALQ-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012780     IF E = "01"
012790        GO TO R-710.
012800     MOVE ZEROS  TO CAM1.
012810     MOVE ALQ-08 TO CAM2.
012820     MULTIPLY CAMPOAL BY VALOR-W GIVING BICM-08.
012830 R-741.
012840     IF CONDHED-08 = "F" GO TO R-750.
012850     ACCEPT (15, 61) CODIGO-04 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012860     IF E = "01" GO TO R-740.
012870     READ ACA04 INVALID KEY
012880        DISPLAY (22, 14) "RESPONSAVEL NAO CADASTRADO"
012890        ACCEPT (22, 78) CR WITH UPDATE
012900        DISPLAY (22, 14) EX-MENS
012910        GO TO R-741.
012920     MOVE NOME-04 TO NOME-W.
012930     DISPLAY (15, 68) NOME-W.
012940 R-750.
012950     ACCEPT (16, 32) CC-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
012960     IF E = "01"
012970         IF CONDHED-08 = "F"
012980             GO TO R-740
012990         ELSE
013000             GO TO R-741.
013010     MOVE CC-08 TO CODICC-01.
013020     MOVE ZEROS TO HISCC-01.
013030     READ ACC01 INVALID KEY
013040         DISPLAY (22, 14)
013050         "CENTRO DE CUSTO NAO CADASTRADO < >"
013060         ACCEPT (22, 78) CR WITH UPDATE
013070         DISPLAY (22, 14) EX-MENS
013080         GO TO R-750.
013090     DISPLAY (16, 49) NOMECC-01.
013100 R-770.
013110     ACCEPT (17, 32) LOJA-08 WITH UPDATE
013120        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
013130     IF E = "01"
013140        GO TO R-750.
013150 R-775.
013160     ACCEPT (17, 61) CONSUMO-08 WITH UPDATE
013170        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
013180     IF E = "01" GO TO R-300.
013190     MOVE HIST03 TO HIST-W(01).
013200 R-776.
013210     IF CONDHED-08 = "F"
013220        GO TO R-777.
013230     DISPLAY (18, 32) HIST03.
013240     ACCEPT (18, 32) HIST-W(01) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
013250     IF E = "01"
013260        GO TO R-775.
013270 R-777.
013280     DISPLAY (19, 32) INCIDE-08.
013290     ACCEPT (19, 32) INCIDE-08 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
013300     IF E = "01"
013310        GO TO R-776.
013320 R-778.
013330     ACCEPT (19, 61) PORT-08 WITH UPDATE
013340        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
013350     IF E = "01" GO TO R-777.
013360 R-780.
013370     MOVE SPACES TO RESP.
013380     DISPLAY (22, 14) "CONFIRMA ALTERACAO (S/<N>):".
013390     ACCEPT (22, 42) RESP WITH UPDATE.
013400     DISPLAY (22, 14) EX-MENS.
013410     IF RESP NOT = "S" GO TO ROT-4.
013420     IF VRCONT-08 = VALOR-W
013430        MOVE "1"    TO FLAG
013440     ELSE
013450        MOVE "0" TO FLAG.
013460     MOVE VALOR-W TO VRCONT-08.
013470     REWRITE REG-08 INVALID KEY
013480        DISPLAY (22, 14) "ERRO NA REGRAVACAO DO ACE08"
013490        ACCEPT (22, 78) CR WITH UPDATE
013500        DISPLAY (22, 14) EX-MENS
013510        GO TO ROT-4.
013520 R-781.
013530     IF CONDHED-08 = "F"
013540         GO TO R-788.
013550     MOVE NFHED-08    TO DOC03.
013560     MOVE DIFNFHED-08 TO DIF03.
013570     READ ABA03 INVALID KEY
013580        GO TO R-782.
013590     MOVE NOMEFOR-08  TO NOMEFOR03.
013600     MOVE CODIGO-04   TO RESPONSAVEL03.
013610     IF CONDHED-08 = "A"
013620        MOVE "C" TO TIPO03
013630     ELSE
013640        MOVE CONDHED-08 TO TIPO03.
013650     MOVE VRCONT-08   TO VALOR03R.
013660     MOVE DREC-08     TO DIA03.
013670     MOVE MREC-08     TO MES03.
013680     MOVE AREC-08     TO ANO03.
013690     MOVE HIST-W(01)  TO HIST03.
013700     REWRITE REG-BA03 INVALID KEY
013710         DISPLAY (22, 14) "ERRO REWRITE COPIA DE CHEQUE=" FS
013720         ACCEPT (22, 78) CR WITH UPDATE
013730         DISPLAY (22, 14) EX-MENS.
013740     GO TO R-788.
013750 R-782.
013760     MOVE ZEROS TO REG-BA03.
013770     MOVE HIST-W(01)  TO HIST03.
013780     MOVE NFHED-08    TO DOC03.
013790     MOVE DIFNFHED-08 TO DIF03.
013800     MOVE NOMEFOR-08  TO NOMEFOR03.
013810     MOVE VRCONT-08   TO VALOR03R.
013820     MOVE CODIGO-04   TO RESPONSAVEL03.
013830     IF CONDHED-08 = "A"
013840         MOVE "C" TO TIPO03
013850     ELSE
013860         MOVE CONDHED-08 TO TIPO03.
013870     MOVE DREC-08     TO DIA03.
013880     MOVE MREC-08     TO MES03.
013890     MOVE AREC-08     TO ANO03.
013900     WRITE REG-BA03 INVALID KEY
013910         DISPLAY (22, 14) "ERRO NO WRITE COPIA DE CHEQUE=" FS
013920         ACCEPT (22, 78) CR WITH UPDATE
013930         DISPLAY (22, 14) EX-MENS.
013940 R-788.
013950     IF CONDHED-08 = "A" OR "D" OR "T" OR "B"
013960        AND CONDANT-W = "A" OR "D" OR "B" OR "T"
013970        GO TO R-860.
013980     IF CONDHED-08 = "F" AND CONDANT-W = "F"
013990        IF FLAG = "1"  AND CONDPG-08 = WS-PRAZO
014000           GO TO R-860
014010        ELSE
014020           PERFORM R-870 THRU R-890
014030           GO TO R-790.
014040     IF CONDHED-08 = "A" OR "D" OR "B" OR "T" AND CONDANT-W = "F"
014050        PERFORM R-870 THRU R-890
014060        GO TO R-860.
014070 R-790.
014080     MOVE ZEROS TO IND2-W.
014090 R-800.
014100     MOVE ALL ZEROS TO REG-CT52.
014110     ADD 1 TO IND2-W.
014120     IF IND2-W > 10 GO TO R-860.
014130     MOVE NFHED-08 TO NFAT-52.
014140     MOVE IND1-W   TO DIFFAT-52.
014150     DISPLAY (20, 17)
014160     "VENCIMENTO [  ] PARCELA: ../../.. VALOR.:"
014170     DISPLAY (20, 29) IND2-W.
014180     DISPLAY (20, 42) DV-52.
014190     DISPLAY (20, 45) MV-52.
014200     DISPLAY (20, 48) AV-52.
014210     DISPLAY (20, 60) FATRED-52.
014220 R-810.
014230     ACCEPT (20, 42) DV-52 WITH UPDATE
014240         AUTO-SKIP.
014250     IF DV-52 = ZEROS GO TO R-860.
014260     IF DV-52 > 31 GO TO R-810.
014270 R-820.
014280     ACCEPT (20, 45) MV-52 WITH UPDATE
014290         AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
014300     IF E = "01" GO TO R-810.
014310     IF MV-52 < 1 OR > 12 GO TO R-820.
014320 R-830.
014330     ACCEPT (20, 48) AV-52 WITH UPDATE.
014340     IF AV-52 = 0 GO TO R-830.
           ACCEPT E FROM ESCAPE KEY.
014350     IF E = "01" GO TO R-820.
014360 R-840.
014370     ACCEPT (20, 60) FATRED-52 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
014380     IF E = "01" GO TO R-830.
014390     IF FATRED-52 = ZEROS GO TO R-840.
014400 R-850.
014410     MOVE DIA TO DE-52.
014420     MOVE MES TO ME-52.
014430     MOVE ANO TO AE-52.
014440     WRITE REG-CT52 INVALID KEY
014450        MOVE "MCE1701J" TO CODMENFS
014460        MOVE "ACT52" TO ARQFS
014470        PERFORM TESTA-FS THRU SAI-TESTA-FS
014480        GO TO R-9999.
014490     ADD 1 TO IND1-W.
014500     GO TO R-800.
014510 R-860.
014520     IF CTL > 54
014530        ADD 1 TO CTP
014540        MOVE 5 TO CTL
014550        MOVE CTP TO PAG-CAB1A
014560        WRITE REG-REL FROM CAB1A AFTER PAGE
014570        MOVE "RCE1701C" TO NOME-RELA
014580        WRITE REG-REL FROM CAB2A AFTER 1
014590        WRITE REG-REL FROM CAB132 AFTER 1
014600        WRITE REG-REL FROM CAB2 AFTER 1
014610        WRITE REG-REL FROM CAB132 AFTER 1
014620        WRITE REG-REL FROM CAB3 AFTER 2.
014630     WRITE REG-REL FROM CAB4 AFTER 1.
014640     PERFORM R-480 THRU R-490.
014650     WRITE REG-REL FROM CAB4 AFTER 1.
014660     ADD 2 TO CTL.
014670     GO TO ROT-4.
014680 R-870.
014690     MOVE ZEROS TO NUM-FAT-52 IND5-W.
014700 R-875.
014710     IF IND5-W = 99
014720        GO TO R-890.
014730     MOVE NFHED-08    TO NFAT-52.
014740     MOVE IND5-W      TO DIFFAT-52.
014750     READ ACT52 INVALID KEY
014760        ADD 1 TO IND5-W
014770        GO TO R-875.
014780     IF FOR-52 = FORN-08
014790        NEXT SENTENCE
014800     ELSE
014810        ADD 1 TO IND5-W
014820        GO TO R-875.
014830     DELETE ACT52 INVALID KEY
014840        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACT52"
014850        ACCEPT (22, 78) CR WITH UPDATE
014860        DISPLAY (22, 14) EX-MENS.
014870     MOVE NFAT-52   TO DOC03
014880     MOVE DIFFAT-52 TO DIF03.
014890     READ ABA03 INVALID KEY
014900         ADD 1 TO IND5-W
014910         GO TO R-875.
014920     DELETE ABA03 INVALID KEY
014930         MOVE 1 TO ST.
014940     ADD 1 TO IND5-W.
014950     GO TO R-875.
014960 R-890.
014970     EXIT.
014980 R-900.
014990     OPEN I-O EMPCE.
015000     IF FS NOT = "00"
015010        MOVE "MCE1701F" TO CODMENFS
015020        MOVE "EMPCE"    TO ARQFS
015030        PERFORM TESTA-FS THRU SAI-TESTA-FS
015040        CLOSE ACE08 REL EMPCE STOP RUN.
015050     MOVE NFMD-W TO NFMD-EMPCE.
015060     REWRITE REG-EMPCE INVALID KEY
015070        DISPLAY (22, 14) "ERRO NO REWRITE EMPCE FS " FS
015080        ACCEPT (22, 78) CR WITH UPDATE
015090        DISPLAY (22, 14) EX-MENS.
015100     CLOSE EMPCE.
015110 R-9999.
015120     CLOSE ACE08 ACE07 ACT52 ACC01 ABA03 ACA10 ACA04 REL.
015130     EXIT PROGRAM.
015140*-----------------F-I-M----------------
