000010**********************************************************
000020* SCE1901-MANUTENCAO DE GERAL DE ESTOQUE (LOJA E EMP COMP.19/08/05*
000030**********************************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE1901.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-01".
000080 COPY "/dados1/book/SELC-02".
000090 COPY "/dados1/book/SELC-05".
000100 COPY "/dados1/book/SELC-15".
000110 COPY "/dados1/book/SELC-16".
000120     SELECT RELATO ASSIGN TO PRINTER
000130                   FILE STATUS IS FS.
000140 COPY "/dados1/book/FDCE".
000150 COPY "/dados1/book/FD-01".
000160 COPY "/dados1/book/FD-02".
000170 COPY "/dados1/book/FD-05".
000180 COPY "/dados1/book/FD-15".
000190 COPY "/dados1/book/FD-16".
000200 COPY "/dados1/book/FDREL80".
000210 COPY "/dados1/book/TAB-W".
000220 01  CAMPOS.
000230     05 SENHA-01.
000240        07 SEN-01     PIC A     VALUE SPACES.
000250        07 SEN-02     PIC A     VALUE SPACES.
000260        07 SEN-03     PIC A     VALUE SPACES.
000270        07 SEN-04     PIC A     VALUE SPACES.
000290 01  CAMPOS1.
000300     05 SENHA-W1.
000310        07 SEN-W1     PIC 9     VALUE ZEROS.
000320        07 SEN-W2     PIC 9     VALUE ZEROS.
000330        07 SEN-W3     PIC 9     VALUE ZEROS.
000340        07 SEN-W4     PIC 9     VALUE ZEROS.
000350     05 COD-W         PIC 9(06) VALUE ZEROS.
000360     05 SOMA-EMP      PIC 9(07) VALUE ZEROS.
000370     05 SOMA-EMPR REDEFINES SOMA-EMP PIC 9(05)V99.
000380     05 SOMA-LOJ      PIC 9(07) VALUE ZEROS.
000390     05 SOMA-LOJR REDEFINES SOMA-LOJ PIC 9(05)V99.
000400     05 EXC-EMP       PIC 9(07) VALUE ZEROS.
000410     05 EXC-EMPR REDEFINES EXC-EMP PIC 9(05)V99.
000420     05 EXC-LOJ       PIC 9(07) VALUE ZEROS.
000430     05 EXC-LOJR REDEFINES EXC-LOJ PIC 9(05)V99.
000440     05 OPERA         PIC 9(02) VALUE ZEROS.
000450 01  CAB2.
000460     02 FILLER        PIC X(15) VALUE SPACES.
000470     02 FILLER        PIC X(35) VALUE
000480     "ALTERACAO NO ESTOQUE DEPOSITO/LOJA".
000490 01  CAB3.
000500     02 FILLER        PIC X(53) VALUE
000510     " T  L/D    CODIGO    QTDE ANTERIOR     QTDE APOS     ".
000520     02 FILLER        PIC X(21) VALUE "OPERACAO   QUANTIDADE".
000530 01  CAB4.
000540     02 FILLER        PIC X(01) VALUE SPACES.
000550     02 TIPO-4        PIC X(03) VALUE SPACES.
000560     02 FILLER        PIC X VALUE "-".
000570     02 LOJA-4        PIC ZZ VALUE ZEROS.
000580     02 FILLER        PIC X(04) VALUE SPACES.
000590     02 COD-4         PIC 9(06) VALUE ZEROS.
000600     02 FILLER        PIC X(06) VALUE SPACES.
000610     02 QTANT-4       PIC X(09) VALUE SPACES.
000620     02 FILLER        PIC X(07) VALUE SPACES.
000630     02 QTAPOS-4      PIC X(09) VALUE SPACES.
000640     02 FILLER        PIC X(05) VALUE SPACES.
000650     02 DESC-4        PIC X(08) VALUE SPACES.
000660     02 FILLER        PIC X(04) VALUE SPACES.
000670     02 QT-4          PIC X(09) VALUE SPACES.
000680 COPY "/dados1/book/CPYPDCE".
000690 COPY "/dados1/book/CPYPDFS".
000700 COPY "/dados1/book/PDIMP".
000710 R-0000.
000720     OPEN I-O ACE01.
000730     IF FS NOT EQUAL "00"
000740        MOVE "MCE1901A" TO CODMENFS
000750         MOVE "ACE01"     TO ARQFS
000760        PERFORM TESTA-FS THRU SAI-TESTA-FS
000770        CLOSE ACE01 STOP RUN.
000780     OPEN I-O ACE02.
000790     IF FS NOT EQUAL "00"
000800        MOVE "MCE1901B" TO CODMENFS
000810        MOVE "ACE02"     TO ARQFS
000820        PERFORM TESTA-FS THRU SAI-TESTA-FS
000830        CLOSE ACE01 ACE02 STOP RUN.
000840     OPEN I-O ACE16.
000850     IF FS NOT EQUAL "00"
000860        MOVE "MCE1901C" TO CODMENFS
000870         MOVE "ACE16"     TO ARQFS
000880        PERFORM TESTA-FS THRU SAI-TESTA-FS
000890        CLOSE ACE01 ACE02 ACE16 STOP RUN.
000900     OPEN INPUT ACE05.
000910     IF FS NOT EQUAL "00"
000920        MOVE "MCE1901D" TO CODMENFS
000930        MOVE "ACE05"     TO ARQFS
000940        PERFORM TESTA-FS THRU SAI-TESTA-FS
000950        CLOSE ACE01 ACE02 ACE16 ACE05 STOP RUN.
000960     OPEN INPUT ACE15.
000970     IF FS NOT EQUAL "00"
000980        MOVE "MCE1901E" TO CODMENFS
000990        MOVE "ACE15"     TO ARQFS
001000        PERFORM TESTA-FS THRU SAI-TESTA-FS
001010        CLOSE ACE01 ACE02 ACE16 ACE05 ACE15 STOP RUN.
001020     OPEN OUTPUT RELATO.
001030     IF FS NOT EQUAL "00"
001040        MOVE "MCE1901F" TO CODMENFS
001050        MOVE "RELATO"   TO ARQFS
001060        PERFORM TESTA-FS THRU SAI-TESTA-FS
001070        CLOSE ACE01 ACE02 ACE16 ACE05 ACE15 RELATO STOP RUN.
001080 R-0100.
001090     MOVE "TCE1901" TO TS.
001100     MOVE "RCE1901" TO NOME-RELB.
001110     MOVE "ALTERACAO DE ESTOQUE" TO INFT.
001120     MOVE ALL ZEROS TO REG-16.
001130 R-0200.
001140 COPY "/dados1/book/CPYTPCE".
001150     MOVE SPACES TO CAMPOS.
001160     MOVE ZEROS TO CAMPOS1.
001170     DISPLAY (07, 10) "01-SENHA..........: ....".
001180     DISPLAY (07, 40) "02-CODIGO OPERADOR: ..".
001190     DISPLAY (09, 10) "03-COD/LOJA.......: ..".
001200     DISPLAY (11, 10) "04-COD/PROD.......: ......".
001210     DISPLAY (13, 10) "05-SOMA/EST/LOJA..: .......".
001220     DISPLAY (13, 40) "06-SUB/EST/LOJA...: ....... ".
001230     DISPLAY (15, 10) "07-SOMA/EST/EMP...: ....... ".
001240     DISPLAY (15, 40) "08-SUB/EST/EMP....: ....... ".
001250 R-0300.
001260     ACCEPT (07, 30) SENHA-W WITH UPDATE
001270*       WITH NO-ECHO.
           ACCEPT E FROM ESCAPE KEY.
001280     IF E = "01" GO TO R-9999.
001290     ACCEPT (07, 60) OPERA WITH UPDATE.
001300     IF OPERA = 0
001310        GO TO R-0300.
001320     MOVE SENHA-W    TO  SENHA-01.
001330     IF SEN-01 = "A" MOVE 9 TO SEN-W1.
001340     IF SEN-02 = "A" MOVE 8 TO SEN-W2.
001350     IF SEN-03 = "A" MOVE 7 TO SEN-W3.
001360     IF SEN-04 = "A" MOVE 6 TO SEN-W4.
001370     IF SEN-01 = "E" MOVE 5 TO SEN-W1.
001380     IF SEN-02 = "E" MOVE 4 TO SEN-W2.
001390     IF SEN-03 = "E" MOVE 3 TO SEN-W3.
001400     IF SEN-04 = "E" MOVE 2 TO SEN-W4.
001410     IF SEN-01 = "I" MOVE 1 TO SEN-W1.
001420     IF SEN-02 = "I" MOVE 2 TO SEN-W2.
001430     IF SEN-03 = "I" MOVE 3 TO SEN-W3.
001440     IF SEN-04 = "I" MOVE 4 TO SEN-W4.
001450     IF SEN-01 = "O" MOVE 5 TO SEN-W1.
001460     IF SEN-02 = "O" MOVE 6 TO SEN-W2.
001470     IF SEN-03 = "O" MOVE 7 TO SEN-W3.
001480     IF SEN-04 = "O" MOVE 8 TO SEN-W4.
001490     IF SEN-01 = "U" MOVE 9 TO SEN-W1.
001500     IF SEN-02 = "U" MOVE 8 TO SEN-W2.
001510     IF SEN-03 = "U" MOVE 7 TO SEN-W3.
001520     IF SEN-04 = "U" MOVE 6 TO SEN-W4.
001530     MOVE SENHA-W1 TO SENHA-15.
001540     MOVE OPERA TO  CODSEN-15.
001550     READ ACE15 INVALID KEY
001560        DISPLAY (22, 14) "SENHA NAO AUTORIZADA < >"
001570        ACCEPT (22, 78) CR WITH UPDATE
001580        DISPLAY (22, 14) EX-MENS
001590        GO TO R-0300.
001600 R-0400.
001610     ACCEPT (09, 30) IND2-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001620     IF E = "01" GO TO R-0200.
001630     MOVE IND2-W TO LOJA-05.
001640     READ ACE05 INVALID KEY
001650        DISPLAY (22, 14) "LOJA NAO CADASTRADA ACE05 < >"
001660        ACCEPT (22, 78) CR WITH UPDATE
001670        DISPLAY (22, 14) EX-MENS
001680        GO TO R-0400.
001690     DISPLAY (09, 32) RAZAO-05.
001700 R-0500.
001710     ACCEPT (11, 30) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001720     IF E = "01" GO TO R-0400.
001730     MOVE COD-W TO COD-01.
001740     READ ACE01 INVALID KEY
001750        DISPLAY (22, 14) "CODIGO DE PRODUTO INEXISTENTE "
001760        ACCEPT (22, 78) CR WITH UPDATE
001770        DISPLAY (22, 14) EX-MENS
001780        GO TO R-0500.
001790     DISPLAY (11, 38) DESC-01.
001800 R-0550.
001810     IF DECIMAL-EMPCE = "S"
001820        MOVE EST-01R TO ED-DEC DISPLAY (15, 30) ED-DEC
001830        MOVE EST-01R TO ED-DEC DISPLAY (15, 63) ED-DEC
001840     ELSE
001850        MOVE EST-01 TO ED-INT DISPLAY (15, 30) ED-INT
001860        MOVE EST-01 TO ED-INT DISPLAY (15, 63) ED-INT.
001870     MOVE COD-01 TO COD-02.
001880     MOVE IND2-W TO LOJA-02.
001890     MOVE ZEROS  TO OPCAO-1.
001900     READ ACE02 INVALID KEY
001910        DISPLAY (22, 14) "PRODUTO NAO CADASTRADO NA LOJA"
001920        ACCEPT (22, 78) CR WITH UPDATE
001930        DISPLAY (22, 14) EX-MENS
001940        MOVE ZEROS TO QTLOJ-02R
001950        MOVE 1 TO OPCAO-1.
001960     IF DECIMAL-EMPCE = "S"
001970        MOVE QTLOJ-02R TO ED-DEC DISPLAY (13, 30) ED-DEC
001980        MOVE QTLOJ-02R TO ED-DEC DISPLAY (13, 63) ED-DEC
001990     ELSE
002000        MOVE QTLOJ-02 TO ED-INT DISPLAY (13, 30) ED-INT
002010        MOVE QTLOJ-02 TO ED-INT DISPLAY (13, 63) ED-INT.
002020     IF OPCAO-1 = 1 GO TO R-0511.
002030     MOVE QTLOJ-02 TO QTLOJ-16.
002040 R-0511.
002050     MOVE EST-01 TO EST-16.
002060 R-0600.
002070     DISPLAY (22, 14) "CAMPO A SER ALTERADO:--> ..".
002080     ACCEPT (22, 39) IND1-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002090     IF E = "01" GO TO R-0400.
002100     IF IND1-W =  0
002110        GO TO R-0600.
002120     IF IND1-W < 5 OR > 8 GO TO R-0600.
002130 R-0700.
002140     IF IND1-W = 05
002150        IF OPCAO-1 = 0
002160           PERFORM R-0800 GO TO R-1200
002170        ELSE
002180           GO TO R-0600.
002190     IF IND1-W = 06
002200        IF OPCAO-1 = 0
002210           PERFORM R-0900 GO TO R-1200
002220        ELSE
002230           GO TO R-0600.
002240     IF IND1-W = 07 PERFORM R-1000 GO TO R-1200.
002250     IF IND1-W = 08 PERFORM R-1100 GO TO R-1200.
002260 R-0800.
002270     ACCEPT (13, 30) SOMA-LOJ WITH UPDATE.
002280     MOVE SOMA-LOJ TO SOMEST-16.
002290     IF DECIMAL-EMPCE = "S"
002300        MOVE SOMA-LOJR TO ED-DEC DISPLAY (13, 30) ED-DEC
002310        MOVE ED-DEC    TO QT-4
002320     ELSE
002330        MOVE SOMA-LOJ  TO ED-INT DISPLAY (13, 30) ED-INT
002340        MOVE ED-INT    TO QT-4.
002350     IF DECIMAL-EMPCE = "S"
002360        MOVE QTLOJ-02R TO ED-DEC MOVE ED-DEC TO QTANT-4
002370     ELSE
002380        MOVE QTLOJ-02 TO ED-INT  MOVE ED-INT TO QTANT-4.
002390     ADD SOMA-LOJ      TO QTLOJ-02.
002400     IF DECIMAL-EMPCE = "S"
002410        MOVE QTLOJ-02R TO ED-DEC DISPLAY (13, 63) ED-DEC
002420        MOVE ED-DEC    TO QTAPOS-4
002430     ELSE
002440        MOVE QTLOJ-02  TO ED-INT DISPLAY (13, 63) ED-INT
002450        MOVE ED-INT    TO QTAPOS-4.
002460     MOVE "L"          TO TIPO-16 TIPO-4.
002470     MOVE LOJA-02      TO LOJA-4.
002480     MOVE "SOMOU"      TO DESC-4.
002490 R-0900.
002500     ACCEPT (13, 63) EXC-LOJ WITH UPDATE.
002510     MOVE EXC-LOJ     TO SUBEST-16.
002520     IF DECIMAL-EMPCE = "S"
002530        MOVE EXC-LOJR TO ED-DEC DISPLAY (13, 63) ED-DEC
002540        MOVE ED-DEC   TO QT-4
002550     ELSE
002560        MOVE EXC-LOJ  TO ED-INT DISPLAY (13, 63) ED-INT
002570        MOVE ED-INT   TO QT-4.
002580     IF DECIMAL-EMPCE = "S"
002590        MOVE QTLOJ-02R TO ED-DEC MOVE ED-DEC TO QTANT-4
002600     ELSE
002610        MOVE QTLOJ-02 TO ED-INT  MOVE ED-INT TO QTANT-4.
002620     SUBTRACT EXC-LOJ FROM QTLOJ-02.
002630     IF DECIMAL-EMPCE = "S"
002640        MOVE QTLOJ-02R TO ED-DEC DISPLAY (13, 30) ED-DEC
002650        MOVE ED-DEC    TO QTAPOS-4
002660     ELSE
002670        MOVE QTLOJ-02  TO ED-INT DISPLAY (13, 30) ED-INT
002680        MOVE ED-INT    TO QTAPOS-4.
002690     MOVE "L"          TO TIPO-16 TIPO-4.
002700     MOVE LOJA-02      TO LOJA-4.
002710     MOVE "SUBTRAIU"   TO DESC-4.
002720 R-1000.
002730     ACCEPT (15, 30) SOMA-EMP WITH UPDATE.
002740     IF DECIMAL-EMPCE = "S"
002750        MOVE SOMA-EMPR TO ED-DEC DISPLAY (15, 30) ED-DEC
002760        MOVE ED-DEC    TO QT-4
002770     ELSE
002780        MOVE SOMA-EMP  TO ED-INT DISPLAY (15, 30) ED-INT
002790        MOVE ED-INT    TO QT-4.
002800     MOVE SOMA-EMP     TO SOMEST-16.
002810     IF DECIMAL-EMPCE = "S"
002820        MOVE EST-01R TO ED-DEC MOVE ED-DEC TO QTANT-4
002830     ELSE
002840        MOVE EST-01 TO ED-INT  MOVE ED-INT TO QTANT-4.
002850     ADD SOMA-EMP TO EST-01.
002860     IF DECIMAL-EMPCE = "S"
002870        MOVE EST-01R TO ED-DEC DISPLAY (15, 63) ED-DEC
002880        MOVE ED-DEC  TO QTAPOS-4
002890     ELSE
002900        MOVE EST-01  TO ED-INT DISPLAY (15, 63) ED-INT
002910        MOVE ED-INT  TO QTAPOS-4.
002920     MOVE "D"        TO TIPO-16 TIPO-4.
002930     MOVE ZEROS      TO LOJA-4.
002940     MOVE "SOMOU"    TO DESC-4.
002950 R-1100.
002960     ACCEPT (15, 63) EXC-EMP WITH UPDATE.
002970     IF DECIMAL-EMPCE = "S"
002980        MOVE EXC-EMPR TO ED-DEC DISPLAY (15, 63) ED-DEC
002990        MOVE ED-DEC   TO QT-4
003000     ELSE
003010        MOVE EXC-EMP  TO ED-INT DISPLAY (15, 63) ED-INT
003020        MOVE ED-INT   TO QT-4.
003030     IF DECIMAL-EMPCE = "S"
003040        MOVE EST-01R TO ED-DEC MOVE ED-DEC TO QTANT-4
003050     ELSE
003060        MOVE EST-01 TO ED-INT  MOVE ED-INT TO QTANT-4.
003070     MOVE EXC-EMP     TO SUBEST-16.
003080     SUBTRACT EXC-EMP FROM EST-01.
003090     IF DECIMAL-EMPCE = "S"
003100        MOVE EST-01R TO ED-DEC DISPLAY (15, 30) ED-DEC
003110        MOVE ED-DEC  TO QTAPOS-4
003120     ELSE
003130        MOVE EST-01  TO ED-INT DISPLAY (15, 30) ED-INT
003140        MOVE ED-INT  TO QTAPOS-4.
003150     MOVE "D"        TO TIPO-16 TIPO-4.
003160     MOVE ZEROS      TO LOJA-4.
003170     MOVE "SUBTRAIU" TO DESC-4.
003180 R-1200.
003190     DISPLAY (22, 14) "CONFIRMA ALTERACAO (S/<N>):.".
003200     ACCEPT (22, 41) RESP WITH UPDATE.
003210     DISPLAY (22, 14) EX-MENS.
003220     IF RESP NOT = "S"
003230        GO TO R-0400.
003240     IF OPCAO-1 = 1 GO TO R-1210.
003250     REWRITE REG-02 INVALID KEY
003260        DISPLAY (22, 14) "ERRO NA REGRAVACAO ACE02 < >"
003270        ACCEPT (22, 78) CR WITH UPDATE
003280        DISPLAY (22, 14) EX-MENS
003290        GO TO R-0400.
003300 R-1210.
003310     MOVE "S" TO CONTOU-01.
003320     MOVE DATA-W TO DTCON-01.
003330     REWRITE REG-01 INVALID KEY
003340        DISPLAY (22, 14) "ERRO NA REGRAVACAO ACE01 < >"
003350        ACCEPT (22, 78) CR WITH UPDATE
003360        DISPLAY (22, 14) EX-MENS
003370        GO TO R-0400.
003380     MOVE COD-01 TO COD-4.
003390     IF CTL > 65
003400        ADD 1 TO CTP
003410        MOVE CTP TO PAG-CAB1B
003420        WRITE REG-RELATO FROM CAB1B AFTER PAGE
003430        WRITE REG-RELATO FROM CAB2B AFTER 1
003440        WRITE REG-RELATO FROM CAB80 AFTER 1
003450        WRITE REG-RELATO FROM CAB2  AFTER 1
003460        WRITE REG-RELATO FROM CAB80 AFTER 1
003470        WRITE REG-RELATO FROM CAB3  AFTER 2
003480        MOVE 7 TO CTL.
003490     WRITE REG-RELATO FROM CAB4 AFTER 1.
003500 R-1300.
003510     ACCEPT HORA-W FROM TIME.
003520     MOVE COD-01     TO COD-16.
003530     MOVE LOJA-02    TO LOJA-16.
003540     MOVE OPERA      TO CODOP-16.
003550     MOVE SENHA-W1   TO SENHA-16.
003560     MOVE D-W        TO DALT-16.
003570     MOVE M-W        TO MALT-16.
003580     MOVE A-W        TO AALT-16.
003590     MOVE HH-W       TO HH-16.
003600     MOVE MS-W       TO MH-16.
003610     MOVE SS-W       TO SH-16.
003620     WRITE REG-16 INVALID KEY
003630        DISPLAY (22, 14) "ERRO NA REGRAVACAO ACE16 " FS
003640        ACCEPT (22, 78) CR WITH UPDATE
003650        DISPLAY (22, 14) EX-MENS
003660        GO TO R-0400.
003670     DISPLAY (22, 14) "ALTERADO COM EXITO"
003680     ACCEPT (22, 78) CR WITH UPDATE.
003690     DISPLAY (22, 14) EX-MENS.
003700     GO TO R-0550.
003710 R-9999.
003720     CLOSE ACE01 ACE02 ACE05 ACE15 ACE16 RELATO.
003730     EXIT PROGRAM.
003740*============== F-I-M =========================
