000010*****************************************
000020* SCE2101-DIGITACAO DE LOTES PARA BAIXA *
000030*****************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID.  OCE2101.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELCP01".
000080 COPY "/dados1/book/SELC-01".
000090 COPY "/dados1/book/SELC-02".
000100 COPY "/dados1/book/SELC-04".
000110 COPY "/dados1/book/SELCF04".
000120 COPY "/dados1/book/SELC-05".
000130 COPY "/dados1/book/SELC-13".
000140 COPY "/dados1/book/SELC-22".
000150 COPY "/dados1/book/SELC-18".
000160 COPY "/dados1/book/SELCP10".
000170 COPY "/dados1/book/SELCC01".
000180     SELECT REL       ASSIGN TO PRINTER
000190                      FILE STATUS IS FS.
000200 COPY "/dados1/book/FDCE".
000210 COPY "/dados1/book/FD-01".
000220 COPY "/dados1/book/FD-02".
000230 COPY "/dados1/book/FD-04".
000240 COPY "/dados1/book/FD-05".
000250 COPY "/dados1/book/FD-13".
000260 COPY "/dados1/book/FD-18".
000270 COPY "/dados1/book/FDCP01".
000280 COPY "/dados1/book/FDCP10".
000290 COPY "/dados1/book/FDACC01".
000300 COPY "/dados1/book/FDCF-04".
000310 COPY "/dados1/book/FD-22".
000320 COPY "/dados1/book/FDREL132".
000330 COPY "/dados1/book/TAB-WW".
000340 77  LOTE-ANT         PIC 9(06) VALUE ZEROS.
000350 77  NOTA-ANT         PIC 9(06) VALUE ZEROS.
000360 77  CONT-NOTAS       PIC 99 VALUE ZEROS.
000370 77  W-CONTROLE       PIC 9(12) VALUE ZEROS.
000380 77  RESP-D           PIC X VALUE SPACES.
000390 77  ERRO-VAL         PIC 9 VALUE ZEROS.
000400 77  WS-ITEM          PIC X(06) VALUE SPACES.
000410 77  CALC-PERC        PIC S9(3)V999.
000420 77  CONT-ITENS       PIC 9999 VALUE ZEROS.
000430 01  CONT-QUANT       PIC 9(07) VALUE ZEROS.
000440 01  CONT-QUANTR REDEFINES
000450     CONT-QUANT       PIC 9(05)V99.
000460 01  CALC-TNOTA       PIC 9(11) VALUE ZEROS.
000470 01  CALC-TNOTAR REDEFINES
000480     CALC-TNOTA       PIC 9(09)V99.
000490 01  WS-SOMA          PIC 9(10) VALUE ZEROS.
000500 01  WS-SOMAR REDEFINES
000510     WS-SOMA          PIC 9(08)V99 .
000520 01  SOMA-FINAL       PIC 9(10) VALUE ZEROS.
000530 01  SOMA-FINALR REDEFINES
000540     SOMA-FINAL       PIC 9(08)V99.
000550 01  VR-22            PIC 9(14) VALUE ZEROS.
000560 01  VR-22R REDEFINES
000570     VR-22            PIC 9(12)V99.
000580 01  TOT-NF           PIC 9(14) VALUE ZEROS.
000590 01  TOT-NFR REDEFINES
000600     TOT-NF           PIC 9(12)V99 .
000610 01  TA-DADOS.
000620     05 TA-SERIE      PIC X VALUE SPACES.
000630     05 TA-CONSUMO    PIC X VALUE SPACES.
000640     05 TA-NAT        PIC 9(03) VALUE ZEROS.
000650     05 TA-NLOTE      PIC 9(05) VALUE ZEROS.
000660     05 TA-NLOJA      PIC 99 VALUE ZEROS.
000670     05 TA-TIPONF     PIC X VALUE SPACES.
000680     05 TA-ENTREGA    PIC X VALUE SPACES.
000690     05 TA-VRNOTA     PIC 9(10) VALUE ZEROS.
000700     05 TA-VRNOTAR REDEFINES
000710        TA-VRNOTA     PIC 9(08)V99.
000720     05 TA-TOTITENS   PIC 9(04) VALUE ZEROS.
000730     05 TA-TOTNOTAS   PIC 99 VALUE ZEROS.
000740     05 TG-QUANT      PIC 9(07) VALUE ZEROS.
000750     05 TG-QUANTR REDEFINES
000760        TG-QUANT      PIC 9(05)V99.
000770     05 TA-TIPOVENDA  PIC X VALUE SPACES.
000780     05 TA-CONTROLE   PIC 9(12) VALUE ZEROS.
000790 01  VALOR-AUX        PIC 9(10) VALUE ZEROS.
000800 01  VALOR-AUXR REDEFINES VALOR-AUX PIC 9(08)V99.
000810 01  DESC-NOTA        PIC 9(08) VALUE ZEROS.
000820 01  DESC-NOTAR REDEFINES DESC-NOTA PIC 9(06)V99.
000830 01  PER-CALC         PIC 9(02)V99999 VALUE ZEROS.
000840 01  SUB-DESC         PIC 9(08) VALUE ZEROS.
000850 01  SUB-DESCR REDEFINES SUB-DESC PIC 9(06)V99.
000860 01  DADOS-TELAB.
000870     05 TB-DADOS OCCURS 20 TIMES.
000880        10 TB-CODVEND    PIC 9(05).
000890        10 TB-CLIENTE    PIC 9(05).
000900        10 TB-VRCONT     PIC 9(10).
000910        10 TB-NNOTAF     PIC 9(06).
000920        10 TB-PRAZO      PIC 999.
000930        10 TB-VRNOTA     PIC 9(10).
000940        10 TB-VRNOTAR REDEFINES
000950           TB-VRNOTA     PIC 9(08)V99.
000960        10 ITENS OCCURS 20 TIMES.
000970           15 TB-COD     PIC 9(06).
000980           15 TB-CODR REDEFINES
000990              TB-COD     PIC X(06).
001000           15 TB-QT      PIC 9(07).
001010           15 TB-QTR REDEFINES
001020              TB-QT      PIC 9(05)V99.
001030           15 TB-VALOR   PIC 9(11).
001040           15 TB-VALORR REDEFINES
001050              TB-VALOR   PIC 9(09)V99.
001060           15 TB-FATOR   PIC 9V9999.
001070 01  DIF-PERC            PIC S9(03)V9.
001080 01  DIF-PERCR REDEFINES DIF-PERC.
001090     05 DIF-PERC1        PIC 9(03).
001100     05 DIF-PERC2        PIC 9.
001110 01  EDICOES.
001120     05 ED3           PIC ZZZ.ZZZ.ZZ9,99.
001130     05 ED4           PIC ZZ.ZZZ.ZZ9.999.
001140 01  IND2             PIC 99 VALUE ZEROS.
001150 01  IND3             PIC 99 VALUE ZEROS.
001160 01  IND4             PIC 99 VALUE ZEROS.
001170 01  IND5             PIC 99 VALUE ZEROS.
001180 01  IND6             PIC 99 VALUE ZEROS.
001190 01  FLAG-N           PIC 9(01) VALUE ZEROS.
001200 01  FLAG-W           PIC 9(01) VALUE ZEROS.
001210 01  W-TBNOTAS        PIC 9(06) VALUE ZEROS.
001220 01  W-TBCODVEND      PIC 9(04) VALUE ZEROS.
001230 01  W-CONT1          PIC 9(12) VALUE ZEROS.
001240 01  W-CONT2          PIC 9(12) VALUE ZEROS.
001250 01  CAB2.
001260     05 FILLER        PIC X(27) VALUE SPACES.
001270     05 FILLER        PIC X(13) VALUE "RELATORIO DE ".
001280     05 FILLER        PIC X(32) VALUE "LOTES".
001290 01  CAB3.
001300     05 FILLER        PIC X(08) VALUE "LOJA..:".
001310     05 LOJA-3        PIC Z9    VALUE ZEROS.
001320     05 FILLER        PIC X(11) VALUE "    LOTE: ".
001330     05 LOTE-3        PIC ZZZZZ9 VALUE ZEROS.
001340     05 FILLER        PIC X(03) VALUE SPACES.
001350     05 FILLER        PIC X(23) VALUE " NATUREZA DA OPERACAO: ".
001360     05 NAT-3         PIC 999   VALUE ZEROS.
001370     05 FILLER        PIC X(10) VALUE " DATA..:".
001380     05 DIA-3         PIC 99   VALUE ZEROS.
001390     05 FILLER        PIC X(01) VALUE "/".
001400     05 MES-3         PIC 99   VALUE ZEROS.
001410     05 FILLER        PIC X(01) VALUE "/".
001420     05 ANO-3         PIC 99    VALUE ZEROS.
001430 01  CAB4.
001440     05 FILLER        PIC X(40) VALUE
001450     "N.FISCAL   QUANT  CODIGO  DESCRICAO DO M".
001460     05 FILLER        PIC X(40) VALUE
001470     "ATERIAL                            VALOR".
001480 01  CAB5.
001490     05 NOTA-5        PIC ZZZZ9 VALUE ZEROS.
001500     05 FILLER        PIC X VALUE SPACES.
001510     05 QUANT-5       PIC X(09) VALUE ZEROS.
001520     05 FILLER        PIC X(02) VALUE SPACES.
001530     05 CODI-5        PIC X(06) VALUE SPACES.
001540     05 FILLER        PIC X(02) VALUE SPACES.
001550     05 DESC-5        PIC X(40) VALUE SPACES.
001560     05 VALOR-5       PIC ZZZ.ZZZ.ZZ9,99.
001570 01  CAB6.
001580     05 FILLER        PIC X(40) VALUE SPACES.
001590     05 FILLER        PIC X(23) VALUE "  TOTAL DA NOTA FISCAL:".
001600     05 TOTNF-6       PIC Z.ZZZ.ZZZ.ZZ9,99.
001610 01  CAB7.
001620     05 FILLER        PIC X(16) VALUE  " TOTAL DO LOTE:".
001630     05 TLOTE-7       PIC Z.ZZZ.ZZZ.ZZ9,99.
001640     05 FILLER        PIC X(49) VALUE SPACES.
001650 01  CAB8.
001660     05 FILLER        PIC X(17) VALUE " TOTAL DE ITENS:".
001670     05 TITEM-8       PIC ZZZ.ZZ9.
001680     05 FILLER        PIC X(56) VALUE SPACES.
001690 01  CAB9.
001700     05 FILLER        PIC X(17) VALUE " TOTAL DE QTDES:".
001710     05 QUANT-9       PIC X(09) VALUE SPACES.
001720     05 FILLER        PIC X(56) VALUE SPACES.
001730 01  CAB10.
001740     05 FILLER        PIC X(45) VALUE SPACES.
001750     05 FILLER        PIC X(29) VALUE "DIFERENCA DE VENDAS".
001760 01  CAB11.
001770     05 FILLER        PIC X(51) VALUE
001780     "LOJA  LOTE   T I P O NUM.NF CODIGO QUANTIDADE".
001790     05 FILLER        PIC X(51) VALUE
001800     "DESCRICAO DO PRODUTO       VR.UN.N/F   VR.UN.CAD VR".
001810     05 FILLER        PIC X(30) VALUE
001820     ".TOT.ITEM % DIF  VEND DT.LOTE".
001830 01  CAB12.
001840     05 FILLER        PIC X(01) VALUE SPACES.
001850     05 LOJA-12       PIC 99    VALUE ZEROS.
001860     05 FILLER        PIC X(02) VALUE SPACES.
001870     05 LOTE-12       PIC ZZZZZ9 VALUE ZEROS.
001880     05 FILLER        PIC X(01) VALUE SPACES.
001890     05 TIP-12        PIC X(08) VALUE SPACES.
001900     05 FILLER        PIC X(01) VALUE SPACES.
001910     05 NOTA-12       PIC ZZZZZ9 VALUE ZEROS.
001920     05 FILLER        PIC X VALUE SPACES.
001930     05 CODI-12       PIC X(06) VALUE SPACES.
001940     05 FILLER        PIC X VALUE SPACES.
001950     05 QUANT-12      PIC X(09) VALUE SPACES.
001960     05 FILLER        PIC X VALUE SPACES.
001970     05 DESC-12       PIC X(32) VALUE SPACES.
001980     05 FILLER        PIC X VALUE SPACES.
001990     05 VRUNF-12      PIC ZZZZ.ZZ9,99.
002000     05 FILLER        PIC X VALUE SPACES.
002010     05 VRUCAD-12     PIC ZZZZ.ZZ9,99.
002020     05 FILLER        PIC X(01) VALUE SPACES.
002030     05 VRITEM-12     PIC ZZZZ.ZZ9,99.
002040     05 FILLER        PIC X VALUE SPACES.
002050     05 DIFER-12      PIC ZZZ,9-.
002060     05 FILLER        PIC X(01) VALUE SPACES.
002070     05 NOME-12       PIC X(04) VALUE SPACES.
002080     05 FILLER        PIC X(01) VALUE SPACES.
002090     05 DIA-12        PIC 99    VALUE ZEROS.
002100     05 FILLER        PIC X(01) VALUE "/".
002110     05 MES-12        PIC 99    VALUE ZEROS.
002120     05 FILLER        PIC X(01) VALUE "/".
002130     05 ANO-12        PIC 99    VALUE ZEROS.
002140 COPY "/dados1/book/CPYPDCEW".
002150 COPY "/dados1/book/CPYPDFS".
002160 R-000.
002170     MOVE ZEROS TO TA-DADOS DADOS-TELAB.
002180 COPY "/dados1/book/PDIMP".
002190     OPEN INPUT ACE01
002200     IF FS NOT = "00"
002210        MOVE "MCE2101A" TO CODMENFS
002220        MOVE "ACE01" TO ARQFS
002230        PERFORM TESTA-FS THRU SAI-TESTA-FS
002240        CLOSE ACE01 STOP RUN.
002250     OPEN INPUT ACE02
002260     IF FS NOT = "00"
002270        MOVE "MCE2101B" TO CODMENFS
002280        MOVE "ACE02"  TO ARQFS
002290        PERFORM TESTA-FS THRU SAI-TESTA-FS
002300        CLOSE ACE01 ACE02 STOP RUN.
002310     OPEN I-O ACE04
002320     IF FS NOT = "00"
002330        MOVE "MCE2101C" TO CODMENFS
002340        MOVE "ACE04"  TO ARQFS
002350        PERFORM TESTA-FS THRU SAI-TESTA-FS
002360        CLOSE ACE01 ACE02 ACE04 STOP RUN.
002370     OPEN I-O ACP10
002380     IF FS NOT = "00"
002390        MOVE "MCE2101D" TO CODMENFS
002400        MOVE "ACP10" TO ARQFS
002410        PERFORM TESTA-FS THRU SAI-TESTA-FS
002420        CLOSE ACE01 ACE02 ACE04 ACP10 STOP RUN.
002430     OPEN I-O ACE22.
002440     IF FS NOT = "00"
002450        MOVE "MCE2101E" TO CODMENFS
002460        MOVE "ACE22" TO ARQFS
002470        PERFORM TESTA-FS THRU SAI-TESTA-FS
002480        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22 STOP RUN.
002490     OPEN OUTPUT REL.
002500     IF FS NOT = "00"
002510        MOVE "MCE2101F" TO CODMENFS
002520        MOVE "RELATO" TO ARQFS
002530        PERFORM TESTA-FS THRU SAI-TESTA-FS
002540        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22 REL STOP RUN.
002550     OPEN INPUT ACP01.
002560     IF FS NOT = "00"
002570        MOVE "MCE2101G" TO CODMENFS
002580        MOVE "ACP01" TO ARQFS
002590        PERFORM TESTA-FS THRU SAI-TESTA-FS
002600        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22 REL ACP01 STOP RUN.
002610     OPEN INPUT ACF04.
002620     IF FS NOT = "00"
002630        MOVE "MCE2101H" TO CODMENFS
002640        MOVE "ACF04" TO ARQFS
002650        PERFORM TESTA-FS THRU SAI-TESTA-FS
002660        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22
002670              REL ACP01 ACF04 STOP RUN.
002680     OPEN INPUT ACC01.
002690     IF FS NOT = "00"
002700        MOVE "MCE2101I" TO CODMENFS
002710        MOVE "ACC01" TO ARQFS
002720        PERFORM TESTA-FS THRU SAI-TESTA-FS
002730        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22
002740              REL ACP01 ACF04 ACC01 STOP RUN.
002750     OPEN INPUT ACE05.
002760     IF FS NOT = "00"
002770        MOVE "MCE2101J" TO CODMENFS
002780        MOVE "ACE05" TO ARQFS
002790        PERFORM TESTA-FS THRU SAI-TESTA-FS
002800        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22
002810              REL ACP01 ACF04 ACC01 ACE05 STOP RUN.
002820     OPEN INPUT ACE13.
002830     IF FS NOT = "00"
002840        MOVE "MCE2101K" TO CODMENFS
002850        MOVE "ACE13" TO ARQFS
002860        PERFORM TESTA-FS THRU SAI-TESTA-FS
002870        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22 REL
002880              ACP01 ACF04 ACC01 ACE05 ACE13 STOP RUN.
002890     OPEN INPUT ACE18.
002900     IF FS NOT = "00"
002910        MOVE "MCE2101L" TO CODMENFS
002920        MOVE "ACE18" TO ARQFS
002930        PERFORM TESTA-FS THRU SAI-TESTA-FS
002940        CLOSE ACE01 ACE02 ACE04 ACP10 ACE22 REL
002950              ACP01 ACF04 ACC01 ACE05 ACE13 ACE18 STOP RUN.
002960     MOVE "TCE2101" TO TS.
002970     MOVE "*** BAIXA DE MERCADORIAS ***" TO INFT.
002980     MOVE 70 TO CTL.
002990     MOVE 0 TO CTP FLAG-W.
003000     MOVE ZEROS TO LOTE-ANT.
003010 R-0100.
003020 COPY "/dados1/book/CPYTPCE".
003030     MOVE LOW-VALUES TO REG-04.
003040     MOVE ZEROS TO W-CONTROLE.
003050     MOVE SPACES TO RESP RESP-D.
003060     DISPLAY (08, 09) "NUMERO DO LOTE...:      ".
003070     DISPLAY (08, 40) "SERIE:  ".
003080     DISPLAY (08, 60) "CONSUMO <S/N>: .".
003090     DISPLAY (09, 09) "NUMERO DA LOJA...:   ".
003100     DISPLAY (09, 40) "DATA.:   /  /  ".
003110     DISPLAY (10, 09) "TIPO NOTA FISCAL.:  ".
003120     DISPLAY (10, 40)
003130     "<A> A VISTA, <F> FATURADO, <C> CARTAO)".
003140     DISPLAY (11, 09) "RESP.PELA ENTREGA:  ".
003150     DISPLAY (11, 40) "<L> LOJA, <D> DEPOSITO".
003160     DISPLAY (12, 09) "VALOR TOTAL NOTAS:               ".
003170     DISPLAY (13, 09) "TOTAL DE ITENS...:     ".
003180     DISPLAY (13, 40) "CONTROLE<VEND.+NF>.:             ".
003190     DISPLAY (14, 09) "TOTAL DE NOTAS...:   ".
003200     DISPLAY (15, 09) "TOTAL QUANTIDADES:        ".
003210     DISPLAY (15, 40) "CONTROLE...........:             ".
003220     DISPLAY (16, 09) "TIPO DE VENDA....:  ".
003230     DISPLAY (16, 40) "<A> ATACADO <B> BALCAO".
003240     DISPLAY (17, 09) "NATUREZA OPERACAO:    ".
003250 R-0200.
003260     ACCEPT (08, 28) TA-NLOTE WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003270     IF E = "01"
003280        GO TO R-4300.
003290     MOVE TA-NLOTE TO ALT-04 W-CONT1.
003300     START ACE04 KEY IS = ALT-04 INVALID KEY GO TO R-0300.
003310        DISPLAY (22, 14) "LOTE JA GRAVADO- CONFIRA"
003320        ACCEPT (22, 78) CR WITH UPDATE
003330        DISPLAY (22, 14) EX-MENS
003340        GO TO R-0200.
003350 R-0300.
003360     ACCEPT (08, 47) TA-SERIE WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003370     IF E = "01"
003380        SUBTRACT TA-NLOTE FROM W-CONT1
003390        GO TO R-0200.
003400     IF TA-SERIE = "D" OR "B" OR "R" OR "V" OR "A" OR "O"
003410        OR "P" OR "U" OR "C" OR SPACES
003420          NEXT SENTENCE
003430     ELSE
003440          GO TO R-0300.
003450 R-0350.
003460     ACCEPT (08, 75) TA-CONSUMO WITH UPDATE.
003470     IF TA-CONSUMO = "S" OR "N"
003480        NEXT SENTENCE
003490     ELSE
003500        GO TO R-0350.
003510 R-0400.
003520     ACCEPT (09, 28) TA-NLOJA WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003530     IF E = "01"
003540        GO TO R-0300.
003550     IF TA-NLOJA = 00 OR 99
003560        GO TO R-0400.
003570 R-0450.
003580     MOVE TA-NLOJA TO LOJA-05.
003590     READ ACE05 INVALID KEY
003600        DISPLAY (22, 14) "LOJA NAO CADASTRADA < > "
003610        ACCEPT (22, 78) CR WITH UPDATE
003620        DISPLAY (22, 14) EX-MENS
003630        GO TO R-0400.
003640     ADD TA-NLOJA TO W-CONT1.
003650     IF CUSTO-EMPCE = "N"
003660        GO TO R-0470.
003670     MOVE CC-05   TO CODICC-01.
003680     MOVE 02      TO HISCC-01.
003690 R-0460.
003700     READ ACC01 INVALID KEY
003710        DISPLAY (22, 14) "CENTRO DE CUSTO NAO CADASTRADO"
003720        ACCEPT (22, 78) CR WITH UPDATE
003730        DISPLAY (22, 14) EX-MENS
003740        GO TO R-0400.
003750 R-0470.
003760     MOVE LOJA-05    TO  LOJA-02.
003770 R-0500.
003780     ACCEPT (09, 47) DIA WITH UPDATE
003790        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003800     IF E = "01"
003810        SUBTRACT TA-NLOJA FROM W-CONT1
003820        GO TO R-0400.
003830 R-0520.
003840     ACCEPT (09, 50) MES WITH UPDATE
003850        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
003860     IF E = "01" GO TO R-0500.
003870 R-0530.
003880     ACCEPT (09, 53) ANO WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003890     IF E = "01" GO TO R-0520.
003900     IF MES = M-W AND ANO = A-W
003910        ADD DIA TO W-CONT1
003920        ADD MES TO W-CONT1
003930        ADD ANO TO W-CONT1
003940        GO TO R-0600.
003950     DISPLAY (22, 14) "MES/ANO DOS SISTEMA DIFERENTE < > "
003960     ACCEPT (22, 78) CR WITH UPDATE
003970     DISPLAY (22, 14) EX-MENS
003980     DISPLAY (09, 47) "../../..".
003990     GO TO R-0500.
004000 R-0600.
004010     ACCEPT (10, 28) TA-TIPONF WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004020     IF E = "01"
004030        SUBTRACT ANO FROM W-CONT1
004040        SUBTRACT MES FROM W-CONT1
004050        SUBTRACT DIA FROM W-CONT1
004060        GO TO R-0500.
004070     IF TA-TIPONF = "A" OR "F"  OR "P" OR "C"
004080        NEXT SENTENCE
004090     ELSE
004100        DISPLAY (22, 14) "TIPO INVALIDO - REDIGITE."
004110        ACCEPT (22, 78) CR WITH UPDATE
004120        DISPLAY (22, 14) EX-MENS
004130        GO TO R-0600.
004140 R-0700.
004150     ACCEPT (11, 28) TA-ENTREGA WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004160     IF E = "01" GO TO R-0600.
004170     IF TA-ENTREGA = "L" OR "D"
004180        NEXT SENTENCE
004190     ELSE
004200        DISPLAY (22, 14) "RESPONSAVEL INVALIDO "
004210        ACCEPT (22, 78) CR WITH UPDATE
004220        DISPLAY (22, 14) EX-MENS
004230        GO TO R-0700.
004240 R-0800.
004250     ACCEPT (12, 28) TA-VRNOTA WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004260     IF E = "01" GO TO R-0700.
004270     IF TA-VRNOTA > ZEROS
004280        NEXT SENTENCE
004290     ELSE
004300        DISPLAY (22, 14) "VALOR =  ZEROS"
004310        ACCEPT (22, 78) CR WITH UPDATE
004320        DISPLAY (22, 14) EX-MENS
004330        GO TO R-0800.
004340     MOVE TA-VRNOTAR TO ED3 DISPLAY (12, 28) ED3.
004350     ADD TA-VRNOTA TO W-CONT1.
004360 R-0900.
004370     ACCEPT (13, 28) TA-TOTITENS WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004380     IF E = "01"
004390        SUBTRACT TA-VRNOTA FROM W-CONT1
004400        GO TO R-0800.
004410     IF TA-TOTITENS > ZEROS
004420        NEXT SENTENCE
004430     ELSE
004440        DISPLAY (22, 14) "TOTAL DE ITENS INVALIDO"
004450        ACCEPT (22, 78) CR WITH UPDATE
004460        DISPLAY (22, 14) EX-MENS
004470        GO TO R-0900.
004480     ADD TA-TOTITENS TO W-CONT1.
004490     MOVE TA-TOTITENS TO ED-INT DISPLAY (13, 28) ED-INT.
004500 R-1000.
004510     ACCEPT (13, 60) TA-CONTROLE WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004520     IF E = "01"
004530        SUBTRACT TA-TOTITENS FROM W-CONT1
004540        GO TO R-0900.
004550     IF TA-CONTROLE > ZEROS
004560        NEXT SENTENCE
004570     ELSE
004580        DISPLAY (22, 14) "CONTROLE = VALOR VEND + NF"
004590        ACCEPT (22, 78) CR WITH UPDATE
004600        DISPLAY (22, 14) EX-MENS
004610        GO TO R-1000.
004620     ADD TA-CONTROLE TO W-CONT1.
004630     MOVE TA-CONTROLE TO ED4 DISPLAY (13, 60) ED4.
004640 R-1100.
004650     ACCEPT (14, 28) TA-TOTNOTAS WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
004660     IF E = "01"
004670        SUBTRACT TA-CONTROLE FROM W-CONT1
004680        GO TO R-1000.
004690     IF TA-TOTNOTAS > ZEROS
004700        NEXT SENTENCE
004710     ELSE
004720        DISPLAY (22, 14) "TOTAL DE NOTAS INVALIDO"
004730        ACCEPT (22, 78) CR WITH UPDATE
004740        DISPLAY (22, 14) EX-MENS
004750        GO TO R-1100.
004760     IF TA-TOTNOTAS < 21
004770        NEXT SENTENCE
004780     ELSE
004790        DISPLAY (22, 14) "MAXIMO DE NOTAS E 20"
004800        ACCEPT (22, 78) CR WITH UPDATE
004810        DISPLAY (22, 14) EX-MENS
004820        DISPLAY (12, 28) ".."
004830        GO TO R-1100.
004840     ADD TA-TOTNOTAS TO  W-CONT1.
004850 R-1200.
004860     ACCEPT (15, 28) TG-QUANT WITH UPDATE.
004870     IF DECIMAL-EMPCE = "S"
004880        MOVE TG-QUANTR TO ED-DEC DISPLAY (15, 28) ED-DEC
004890     ELSE
004900        MOVE TG-QUANT TO ED-INT DISPLAY (15, 28) ED-INT.
           ACCEPT E FROM ESCAPE KEY.
004910     IF E = "01"
004920        SUBTRACT TA-TOTNOTAS FROM W-CONT1
004930        GO TO R-1100.
004940     IF TG-QUANT > ZEROS
004950        NEXT SENTENCE
004960     ELSE
004970        DISPLAY (22, 14) "QUANTIDADE INVALIDA"
004980        ACCEPT (22, 78) CR WITH UPDATE
004990        DISPLAY (22, 14) EX-MENS
005000        DISPLAY (15, 28) "           "
005010        GO TO R-1200.
005020     ADD TG-QUANT TO W-CONT1.
005030     ACCEPT (15, 60) W-CONT2 WITH UPDATE.
005040 R-1300.
005050     ACCEPT (16, 28) TA-TIPOVENDA WITH UPDATE
           ACCEPT E FROM ESCAPE KEY.
005060     IF E = "01"
005070        SUBTRACT TG-QUANT FROM W-CONT1
005080        GO TO R-1200.
005090     IF TA-TIPOVENDA = "A" OR "B"
005100        NEXT SENTENCE
005110     ELSE
005120        DISPLAY (22, 14) "TIPO DE VENDA INCORRETO < >"
005130        ACCEPT (22, 78) CR WITH UPDATE
005140        DISPLAY (22, 14) EX-MENS
005150        GO TO R-1300.
005160 R-1310.
005170     ACCEPT (17, 28) TA-NAT WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
005180     IF E = "01" GO TO R-1300.
005190     IF TA-NAT < 499
005200        GO TO R-1310.
005210     IF TA-TIPONF = "A"
005220        MOVE 0 TO COND-04
005230     ELSE
005240        IF TA-TIPONF = "C"
005250            MOVE 1 TO COND-04
005260        ELSE
005270            MOVE 2 TO COND-04.
005280     DISPLAY (19, 09) "CONFIRMA <S/<N>>.: .".
005290     ACCEPT (19, 28) RESP-D WITH UPDATE.
005300     DISPLAY (19, 09) EX-MENS.
005310     IF RESP-D = "S"
005320        NEXT SENTENCE
005330     ELSE
005340        GO TO R-0200.
005350     IF W-CONT1 NOT = W-CONT2
005360        DISPLAY (22, 14) EX-MENS
005370        MOVE W-CONT2    TO  ED4
005380        DISPLAY (22, 14) "CONTROLE INFORMADO " ED4
005390        MOVE W-CONT1    TO  ED4
005400        DISPLAY (22, 53) "CALCULADO " ED4
005410        MOVE ZEROS TO W-CONT1 W-CONT2 GO TO R-0200.
005420     MOVE ZEROS TO CONT-NOTAS CONT-ITENS CONT-QUANT JUROS-13
005430                   CALC-TNOTA DADOS-TELAB PRAZO-13.
005440     MOVE  1    TO IND2 IND4 IND3.
005450 R-1400.
005460     MOVE "TCE2101B" TO TS.
005470     MOVE "DIGITACAO DE NOTAS FISCAIS" TO INFT.
005480 COPY "/dados1/book/CPYTPCE".
005490     MOVE SPACES TO RESP RESP-D.
005500     DISPLAY (07, 09) "NUMERO N/FISCAL..: ......".
005510     DISPLAY (07, 40) "VENDEDOR..: ...."
005520     DISPLAY (07, 60) "PRAZO..: ...".
005530     DISPLAY (08, 09) "CODIGO DO CLIENTE: ......".
005540     DISPLAY (10, 09) "CODIGO DO PRODUTO: ...... <  >".
005550     DISPLAY (10, 40) "(DIGITE 999999 P/ ENCERRAR A NOTA)".
005560     DISPLAY (12, 09) "QUANTIDADE.......: .......      ".
005570     DISPLAY (14, 09) "VALOR: ...........       ".
005580 R-1405.
005590     MOVE ZEROS TO TB-NNOTAF(IND2).
005600     ACCEPT (07, 28) TB-NNOTAF(IND2) WITH UPDATE.
005610     IF TB-NNOTAF(IND2) = 999999 AND IND2 = 1 GO TO R-0100.
005620     IF TB-NNOTAF(IND2) = ZEROS GO TO R-1400.
005630     IF TB-NNOTAF(IND2) = W-TBNOTAS
005640        GO TO R-1500.
005650     IF TB-NNOTAF(IND2) = 999999  AND IND2 > 1
005660        PERFORM R-3400 THRU R-3600
005670        GO TO R-0100.
005680 R-1470.
005690     ADD TB-NNOTAF(IND2) TO W-CONTROLE.
005700     MOVE TB-NNOTAF(IND2) TO W-TBNOTAS.
005710 R-1500.
005720     ACCEPT (07, 52) TB-CODVEND(IND2) WITH UPDATE
           ACCEPT E FROM ESCAPE KEY.
005730     IF E = "01"
005740        SUBTRACT TB-NNOTAF(IND2) FROM W-CONTROLE GIVING W-CONTROLE
005750        MOVE ZEROS TO W-TBNOTAS GO TO R-1400.
005760 R-1570.
005770     MOVE TB-CODVEND(IND2) TO CODVEND-04.
005780     READ ACF04 INVALID KEY
005790        DISPLAY (22, 14) "CODIGO DE VENDEDOR INVALIDO"
005800        ACCEPT (22, 78) CR WITH UPDATE
005810        DISPLAY (22, 14) EX-MENS
005820        GO TO R-1500.
005830     ADD TB-CODVEND(IND2) TO W-CONTROLE.
005840     MOVE TB-CODVEND(IND2) TO W-TBCODVEND.
005850     IF TA-TIPONF = "A" MOVE 0 TO PRAZO-13 GO TO R-1800.
005860     IF TA-TIPONF = "C" MOVE 30 TO PRAZO-13 GO TO R-1800.
005870 R-1600.
005880     ACCEPT (08, 28) TB-CLIENTE(IND2) WITH UPDATE.
005890     MOVE TB-CLIENTE(IND2) TO CLIENTE-01.
005900     READ ACP01 INVALID KEY
005910        DISPLAY (22, 14) "CLIENTE NAO CADASTRADO"
005920        ACCEPT (22, 78) CR WITH UPDATE
005930        DISPLAY (22, 14) EX-MENS
005940        GO TO R-1600.
005950 R-1700.
005960     ACCEPT (07, 69) TB-PRAZO(IND2) WITH UPDATE.
005970     IF TB-PRAZO(IND2) = ZEROS GO TO R-1500.
005980     MOVE TB-PRAZO(IND2) TO PRAZO-13.
005990 R-1800.
006000     READ ACE13 INVALID KEY
006010        DISPLAY (22, 14) "PRAZO INEXISTENTE"
006020        ACCEPT (22, 78) CR WITH UPDATE
006030        DISPLAY (22, 14) EX-MENS
006040        GO TO R-1700.
006050     ADD 1 TO CONT-NOTAS.
006060     IF CONT-NOTAS = TA-TOTNOTAS
006070        DISPLAY (22, 14) "ESTA DEVERA SER A ULTIMA NOTA"
006080        ACCEPT (22, 78) CR WITH UPDATE
006090        DISPLAY (22, 14) EX-MENS.
006100 R-1900.
006110     MOVE JUROS-13 TO TB-FATOR(IND2 IND4).
006120     MOVE PRAZO-13 TO TB-PRAZO(IND2).
006130     IF IND4 > 20
006140        IF FLAG-N = 1
006150           GO TO R-2750
006160        ELSE	
006170        GO TO R-2800.
006180  R-1950.
006190     DISPLAY (08, 09) "CODIGO DO CLIENTE: ......".
006200     DISPLAY (10, 09) "CODIGO DO PRODUTO: ......".
006210     DISPLAY (10, 40)
006220     "(DIGITE 999999 P/ ENCERRAR A NOTA)      ".
006230     DISPLAY (12, 09) "QUANTIDADE.......:              ".
006240     DISPLAY (14, 09) "VALOR DO ITEM....:                   ".
006250 R-1960.
006260     DISPLAY (10, 36) IND4.
006270     ACCEPT (10, 28) TB-COD(IND2 IND4) WITH UPDATE.
006280     IF TB-COD(IND2 IND4) = 999999
006290        IF FLAG-N = 1
006300           GO TO R-2750
006310        ELSE	
006320           GO TO R-2800.
006330     MOVE TB-CODR(IND2 IND4) TO COD-01 COD-02.
006340     READ ACE01 INVALID KEY
006350        DISPLAY (22, 14) "CODIGO DO PRODUTO INEXISTENTE"
006360        ACCEPT (22, 78) CR WITH UPDATE
006370        DISPLAY (22, 14) EX-MENS
006380        GO TO R-1900.
006390     DISPLAY (10, 40)
006400     "                                        ".
006410     DISPLAY (10, 40) DESC-01
006420     MOVE TA-NLOJA  TO LOJA-04 LOJA-18 LOJA-02.
006430     MOVE TB-CODR(IND2 IND4) TO COD-04  COD-18.
006440     MOVE TB-NNOTAF(IND2)    TO NF-04   NF-18.
006450     START ACE04 KEY IS = CHAVE-04 INVALID KEY GO TO R-2000.
006460        DISPLAY (22, 14) "O LOTE JA ESTA GRAVADO  ACE04"
006470        ACCEPT (22, 78) CR WITH UPDATE
006480        DISPLAY (22, 14) EX-MENS
006490        GO TO R-1900.
006500 R-2000.
006510     START ACE18 KEY IS = CHAVE-18 INVALID KEY
006520        GO TO R-2100.
006530     DISPLAY (22, 14) "LOTE JA GRAVADO NO ACE18"
006540     ACCEPT (22, 78) CR WITH UPDATE
006550     DISPLAY (22, 14) EX-MENS
006560     GO TO R-1900.
006570 R-2100.
006580     IF LOJA-04 = 88 GO TO R-2200.
006590     IF LOJA-02 > 49 GO TO R-2200.
006600     READ ACE02 INVALID KEY
006610        DISPLAY (22, 14) "PRODUTO NAO CADASTRADO NA LOJA"
006620        ACCEPT (22, 78) CR WITH UPDATE
006630        DISPLAY (22, 14) EX-MENS
006640        GO TO R-1900.
006650 R-2200.
006660     ADD 1 TO CONT-ITENS.
006670 R-2300.
006680     ACCEPT (12, 28) TB-QT(IND2 IND4) WITH UPDATE.
006690     IF DECIMAL-EMPCE = "S"
006700        MOVE TB-QTR(IND2 IND4) TO ED-DEC
006710        DISPLAY (12, 28) ED-DEC
006720     ELSE
006730        MOVE TB-QT(IND2 IND4) TO ED-INT
006740        DISPLAY (12, 28) ED-INT.
006750     IF TB-QT(IND2 IND4) = ZEROS
006760        DISPLAY (22, 14) "QUANTIDADE INVALIDA"
006770        ACCEPT (22, 78) CR WITH UPDATE
006780        DISPLAY (22, 14) EX-MENS
006790        GO TO R-2300.
006800     ADD TB-QT(IND2 IND4) TO CONT-QUANT.
006810 R-2400.
006820     ACCEPT (14, 28) TB-VALOR(IND2 IND4) WITH UPDATE.
006830     MOVE TB-VALORR(IND2 IND4) TO ED3 DISPLAY (14, 28) ED3.
           ACCEPT E FROM ESCAPE KEY.
006840     IF E = "01"
006850         SUBTRACT TB-QT(IND2 IND4) FROM CONT-QUANT
006860         GO TO R-2300.
006870     IF TB-VALOR(IND2 IND4) = ZEROS
006880        DISPLAY (22, 14) "VALOR = 0 CONFIRMA (S/<N>):."
006890        ACCEPT (22, 42) OPCAO WITH UPDATE
006900        IF OPCAO   = "S"
006910           NEXT SENTENCE
006920        ELSE
006930           DISPLAY (22, 14) EX-MENS
006940           GO TO R-2400.
006950 R-2450.
006960     MOVE 0 TO ERRO-VAL.
006970     IF COD-EMPCE = 01 OR 02
006980        MOVE ZEROS TO VALOR-AUX
006990        IF TB-VALOR(IND2 IND4) = ZEROS
007000           GO TO R-2600
007010        ELSE
007020        DISPLAY (16, 09) "DESCONTO DO ITEM.:                "
007030        ACCEPT (16, 28) VALOR-AUX WITH UPDATE
007040        MOVE VALOR-AUXR TO ED3 DISPLAY (16, 28) ED3
007050        IF VALOR-AUX < TB-VALOR(IND2 IND4)
007060           SUBTRACT VALOR-AUX FROM TB-VALOR(IND2 IND4) GIVING
007070           TB-VALOR(IND2 IND4)
007080           DISPLAY (20, 14) EX-MENS
007090           GO TO R-2600
007100        ELSE
007110           DISPLAY (22, 14)
007120           "DESCONTO MAIOR QUE VALOR DO ITEM"
007130           ACCEPT (22, 78) CR WITH UPDATE
007140           DISPLAY (22, 14) EX-MENS
007150           GO TO R-2450.
007160     IF TA-TIPOVENDA = "B"
007170        GO TO R-2500.
007180     IF PRATAC-01 = 99999999 GO TO R-2700.
007190     IF PRATAC-01 = ZEROS
007200        MOVE PRVAR-01 TO PRATAC-01.
007210     IF TA-TIPONF = "F"  OR "P"
007220        MULTIPLY JUROS-13 BY PRATAC-01 GIVING VALOR-AUX
007230        IF VALOR-AUX = TB-VALOR(IND2 IND4)
007240           GO TO R-2700
007250        ELSE
007260           DISPLAY (22, 14)
007270           "VALOR DIGITADO C/JUROS NAO CONFERE REDIGITAR (S<N>):"
007280           ACCEPT (22, 66) RESP-D WITH UPDATE
007290           DISPLAY (22, 14) EX-MENS
007300           IF RESP-D NOT = "S"
007310              MOVE 1 TO ERRO-VAL
007320              GO TO R-2700
007330           ELSE
007340              GO TO R-2400.
007350     IF TB-VALOR(IND2 IND4) = PRATAC-01
007360        GO TO R-2700
007370     ELSE
007380        DISPLAY (22, 14)
007390        "VALOR DIGITADO NAO CONFERE QUER REDIGITAR (S<N>)"
007400        ACCEPT (22, 61) RESP-D WITH UPDATE
007410        DISPLAY (22, 14) EX-MENS
007420        IF RESP-D NOT = "S"
007430           MOVE 1 TO ERRO-VAL
007440           GO TO  R-2700
007450        ELSE
007460           GO TO R-2400.
007470 R-2500.
007480     IF PRVAR-01 = 99999999 GO TO R-2700.
007490     IF TA-TIPONF = "F"  OR "P"
007500        MULTIPLY JUROS-13 BY PRVAR-01 GIVING VALOR-AUX
007510        IF VALOR-AUX = TB-VALOR(IND2 IND4)
007520           GO TO R-2700
007530        ELSE
007540         DISPLAY (22, 14)
007550         "VALOR DIGITADO NAO CONFERE QUER REDIGITAR (S<N>):"
007560         ACCEPT (22, 62) RESP-D WITH UPDATE
007570         IF RESP-D NOT = "S"
007580            MOVE 1 TO ERRO-VAL
007590            GO TO R-2700
007600         ELSE
007610            GO TO R-2400.
007620     IF TB-VALOR(IND2 IND4) = PRVAR-01
007630        GO TO R-2700
007640     ELSE
007650         DISPLAY (22, 14)
007660         "VALOR DIGITADO NAO CONFERE QUER REDIGITAR (S<N>):"
007670         ACCEPT (22, 62) RESP-D WITH UPDATE
007680         DISPLAY (22, 14) EX-MENS
007690         IF RESP-D NOT = "S"
007700            MOVE 1 TO ERRO-VAL
007710            GO TO R-2700
007720         ELSE
007730            GO TO R-2400.
007740 R-2600.
007750     IF TB-VALOR(IND2 IND4) NOT = PRVAR-01
007760        DISPLAY (22, 14)
007770        "VALOR DIGITADO NAO CONFERE QUER REDIGITAR (S/<N>)"
007780        ACCEPT (22, 63) RESP-D WITH UPDATE
007790        DISPLAY (22, 14) EX-MENS
007800        IF RESP-D NOT = "S"
007810           MOVE 1 TO ERRO-VAL
007820           GO TO R-2700
007830        ELSE
007840           GO TO R-2400.
007850 R-2700.
007860     MOVE TB-VALORR(IND2 IND4) TO ED3 DISPLAY (14, 28) ED3.
007870     IF DECIMAL-EMPCE = "S"
007880        MULTIPLY TB-VALORR(IND2 IND4) BY TB-QTR(IND2 IND4)
007890        GIVING WS-SOMAR
007900     ELSE
007910        MULTIPLY TB-VALOR(IND2 IND4) BY TB-QT(IND2 IND4)
007920        GIVING WS-SOMA.
007930     ADD WS-SOMA TO TB-VRCONT(IND2).
007940     IF ERRO-VAL > 0
007950        PERFORM R-3700 THRU R-3800.
007960     IF FLAG-N = 1
007970        GO TO R-2750.
007980     ADD 1 TO IND4 GO TO R-1900.
007990 R-2750.
008000     EXIT.
008010 R-2800.
008020     MOVE ZEROS TO DESC-NOTA.
008030     DISPLAY (16, 09)
008040     "DESCONTO DA NOTA.:                   ".
008050     ACCEPT (16, 28) DESC-NOTA WITH UPDATE
008060     MOVE DESC-NOTAR TO ED3 DISPLAY (16, 28) ED3.
008070     IF DESC-NOTA = ZEROS
008080        GO TO R-2809.
008090     IF DESC-NOTA > TB-VRCONT(IND2)
008100        DISPLAY (22, 14) "DESCONTO MAIOR QUE VALOR DA NOTA"
008110        ACCEPT (22, 78) CR WITH UPDATE
008120        DISPLAY (22, 14) EX-MENS
008130        GO TO R-2800.
008140     MOVE "N" TO CR.
008150     DISPLAY (22, 14) EX-MENS.
008160     DISPLAY (22, 14) "CONFIRMA DESCONTO ACIMA <S/<N>..:".
008170     ACCEPT (22, 47) CR WITH UPDATE.
008180     IF CR = "S"
008190        NEXT SENTENCE
008200     ELSE
008210        GO TO R-2809.
008220     DIVIDE DESC-NOTA BY TB-VRCONT(IND2) GIVING PER-CALC.
008230     SUBTRACT DESC-NOTA FROM TB-VRCONT(IND2)
008240              GIVING TB-VRCONT(IND2).
008250     MOVE ZEROS TO SUB-DESC IND5.
008260 R-2801.
008270     MOVE ZEROS TO SUB-DESC.
008280     ADD 1 TO IND5.
008290     IF IND5 > 20
008300        SUBTRACT 1 FROM IND5 GIVING IND5
008310        GO TO R-2809.
008320     IF TB-COD(IND2 IND5) = 999999
008330        SUBTRACT 1 FROM IND5 GIVING IND5
008340        GO TO R-2809.
008350     MULTIPLY TB-VALORR(IND2 IND5) BY PER-CALC GIVING SUB-DESCR.
008360     SUBTRACT SUB-DESC FROM TB-VALOR(IND2 IND5)
008370              GIVING TB-VALOR(IND2 IND5).
008380*    SUBTRACT SUB-DESC FROM DESC-NOTA GIVING DESC-NOTA.
008390     GO TO R-2801.
008400 R-2808.
008410     IF DESC-NOTA = ZEROS GO TO R-2809.
008420     SUBTRACT DESC-NOTA FROM TB-VALOR(IND2 IND5)
008430              GIVING TB-VALOR(IND2 IND5).
008440 R-2809.
008450     DISPLAY (18, 09)
008460     "TOTAL DA N/FISCAL:                   ".
008470     ACCEPT (18, 28) TB-VRNOTA(IND2) WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
008480     IF E = "01"
008490        GO TO R-2800.
008500     MOVE TB-VRNOTAR(IND2) TO ED3 DISPLAY (18, 28) ED3.
008510     IF TB-VRNOTA(IND2) = TB-VRCONT(IND2) GO TO R-3300.
008520 R-2810.
008530     DISPLAY (22, 14)
008540     "VALOR DIGITADO N/FISCAL NAO CONFERE QUER REDIGITAR (S<N>):".
008550     ACCEPT (22, 72) RESP-D WITH UPDATE.
008560     DISPLAY (22, 14) EX-MENS.
008570     IF RESP-D = "S"
008580        GO TO R-2809.
008590 R-2820.
008600     DISPLAY (22, 14) "QUER REDIGITAR ALGUM ITEM (S<N>)".
008610     ACCEPT (22, 47) RESP-D WITH UPDATE.
008620     DISPLAY (22, 14) EX-MENS.
008630     IF RESP-D = "S"
008640        GO TO R-3100.
008650 R-2830.
008660     DISPLAY (22, 14) "QUER INSERIR ALGUM ITEM (S<N>)".
008670     ACCEPT (22, 45) RESP-D WITH UPDATE.
008680     DISPLAY (22, 14) EX-MENS.
008690     IF RESP-D = "S" ADD 1 TO IND4 GO TO R-1900.
008700 R-2850.
008710     DISPLAY (22, 14) "RETIRAR NOTA FISCAL (S/<N>:".
008720     ACCEPT (22, 41) RESP WITH UPDATE.
008730     DISPLAY (22, 14) EX-MENS.
008740     IF RESP NOT = "S"
008750        GO TO R-1400.
008760 R-2860.
008770     MOVE LOW-VALUE         TO CHAVE-22.
008780     MOVE TA-NLOTE          TO LOTE-22
008790     MOVE TB-NNOTAF(IND2)   TO NOTA-22.
008800     START ACE22 KEY IS NOT < CHAVE-22 INVALID KEY
008810        DISPLAY (22, 14) "NOTA FISCAL==> " NOTA-22
008820        "  NAO ENCONTRADA NO ACE22==>"
008830        ACCEPT (22, 78) CR WITH UPDATE
008840        DISPLAY (22, 14) EX-MENS
008850        GO TO R-2880.
008860 R-2870.
008870     READ ACE22 NEXT RECORD AT END
008880        DISPLAY (22, 14) "NOTA FISCAL==> " NOTA-22
008890        "  RETIRADA DO ACE22==>"
008900        ACCEPT (22, 78) CR WITH UPDATE
008910        DISPLAY (22, 14) EX-MENS
008920        GO TO R-2880.
008930     IF LOTE-22 NOT = TA-NLOTE
008940        GO TO R-2870.
008950     IF NOTA-22 NOT = TB-NNOTAF(IND2)
008960        GO TO R-2870.
008970     DELETE ACE22 INVALID KEY
008980        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACE22 LOTE==>"
008990        LOTE-22 "   NOTA FISCAL==>" NOTA-22
009000        ACCEPT (22, 78) CR WITH UPDATE
009010        DISPLAY (22, 14) EX-MENS.
009020     GO TO R-2870.
009030 R-2880.
009040     MOVE 0 TO IND3.
009050     PERFORM R-2900 THRU R-3000.
009060     MOVE 1 TO IND4 SUBTRACT 1 FROM CONT-NOTAS.
009070     DISPLAY (22, 14) "NOTA FISCAL RETIRADA"
009080     ACCEPT (22, 78) CR WITH UPDATE
009090     DISPLAY (22, 14) EX-MENS.
009100     GO TO R-1400.
009110 R-2900.
009120     ADD 1 TO IND3.
009130     IF IND3 = IND4
009140        MOVE ZEROS TO TB-NNOTAF(IND2) TB-VRCONT(IND2)
009150        GO TO R-3000.
009160     SUBTRACT TB-QT(IND2 IND3) FROM CONT-QUANT.
009170     SUBTRACT 1 FROM CONT-ITENS.
009180     SUBTRACT W-TBNOTAS FROM W-CONTROLE GIVING W-CONTROLE.
009190     SUBTRACT W-TBCODVEND FROM W-CONTROLE GIVING W-CONTROLE.
009200     MOVE ZEROS TO TB-QT(IND2 IND3)  TB-VALOR(IND2 IND3)
009210                   TB-COD(IND2 IND3) TB-FATOR(IND2 IND3)
009220                   W-TBCODVEND       W-TBNOTAS
009230                   GO TO R-2900.
009240 R-3000.
009250     EXIT.
009260 R-3100.
009270     DISPLAY (22, 14) EX-MENS.
009280     DISPLAY (22, 14) "DIGITE O CODIGO DO ITEM: ".
009290     ACCEPT (22, 38) WS-ITEM WITH UPDATE.
009300     IF WS-ITEM = 999999 GO TO R-3100.
009310     MOVE 0 TO IND3 FLAG-N.
009320 R-3200.
009330     ADD 1 TO IND3.
009340     IF IND3 > 20
009350        DISPLAY (22, 14) "ITEM NAO ENCONTRADO < >"
009360        ACCEPT (22, 78) CR WITH UPDATE
009370        DISPLAY (22, 14) EX-MENS
009380        GO TO R-3100.
009390     IF WS-ITEM NOT = TB-CODR(IND2 IND3)
009400        GO TO R-3200.
009410     DISPLAY (10, 28) TB-COD(IND2 IND3).
009420     IF DECIMAL-EMPCE = "S"
009430        MOVE TB-QTR(IND2 IND3) TO ED-DEC
009440        DISPLAY (12, 28) ED-DEC
009450     ELSE
009460        MOVE TB-QT(IND2 IND3) TO ED-INT
009470        DISPLAY (12, 28) ED-INT.
009480     MOVE TB-VALOR(IND2 IND3) TO ED3 DISPLAY (14, 28) ED3.
009490     SUBTRACT TB-QT(IND2 IND3) FROM CONT-QUANT.
009500     IF DECIMAL-EMPCE = "S"
009510        MULTIPLY TB-VALORR(IND2 IND4) BY TB-QTR(IND2 IND4)
009520        GIVING WS-SOMAR
009530     ELSE
009540        MULTIPLY TB-VALOR(IND2 IND4) BY TB-QT(IND2 IND4)
009550        GIVING WS-SOMA.
009560     SUBTRACT WS-SOMA FROM TB-VRCONT(IND2).
009570     SUBTRACT 1 FROM CONT-ITENS.
009580     MOVE IND3 TO IND4.
009590     MOVE 1 TO FLAG-N.
009600     PERFORM R-1900 THRU R-2750.
009610     MOVE 0 TO FLAG-N.
009620     GO TO R-2809.
009630 R-3300.
009640     ADD TB-VRCONT(IND2) TO CALC-TNOTA.
009650     IF CONT-NOTAS = TA-TOTNOTAS
009660        NEXT SENTENCE
009670     ELSE
009680        ADD  1   TO  IND2
009690        MOVE 1   TO  IND4
009700        GO TO R-1400.
009710     IF TA-VRNOTA = CALC-TNOTA AND
009720        TA-TOTITENS = CONT-ITENS AND
009730        TA-TOTNOTAS = CONT-NOTAS AND
009740        TG-QUANT = CONT-QUANT AND
009750        TA-CONTROLE = W-CONTROLE
009760        PERFORM R-3400 THRU R-3600
009770        GO TO R-3900.
009780     MOVE "TCE2101C" TO TS.
009790 COPY "/dados1/book/CPYTPCE".
009800     MOVE SPACES TO RESP RESP-D.
009810     DISPLAY (06, 30) "LOTE: " TA-NLOTE.
009820     DISPLAY (07, 21) "VALORES INFORMADOS".
009830     DISPLAY (08, 21) "------- ----------".
009840     DISPLAY (07, 45) "VALORES CALCULADOS".
009850     DISPLAY (08, 45) "------- ----------".
009860     MOVE TA-VRNOTAR  TO  ED3.
009870     DISPLAY (10, 01) "VALOR TOTAL DAS NOTAS:.." ED3.
009880     MOVE CALC-TNOTAR TO ED3 DISPLAY (10, 40) ED3.
009890     MOVE TA-TOTITENS    TO  ED-INT
009900     DISPLAY (11, 01) "TOTAL DE ITENS:........." ED-INT
009910     MOVE CONT-ITENS TO ED-INT DISPLAY (11, 40) ED-INT
009920     MOVE TA-TOTNOTAS    TO  ED-INT
009930     DISPLAY (12, 01) "TOTAL DE NOTAS:........." ED-INT
009940     MOVE CONT-NOTAS TO  ED-INT DISPLAY (12, 40) ED-INT.
009950     IF DECIMAL-EMPCE = "S"
009960        MOVE TG-QUANTR TO ED-DEC
009970        DISPLAY (13, 01) "TOTAL DE QUANTIDADES:..." ED-DEC
009980        MOVE CONT-QUANTR TO ED-DEC DISPLAY (13, 40) ED-DEC
009990     ELSE
010000        MOVE TG-QUANT TO ED-INT
010010        DISPLAY (13, 01) "TOTAL DE QUANTIDADES:..." ED-INT
010020        MOVE CONT-QUANT TO ED-INT DISPLAY (13, 40) ED-INT.
010030     MOVE TA-CONTROLE    TO  ED4.
010040     DISPLAY (14, 01) "CONTROLE NF+VEND....:..." ED4
010050     MOVE W-CONTROLE TO  ED4 DISPLAY (14, 40) ED4.
010060     DISPLAY (22, 14) "LOTE NAO FECHOU < >"
010070     ACCEPT (22, 78) CR WITH UPDATE.
010080     DISPLAY (22, 14) EX-MENS.
010090     GO TO R-0100.
010100 R-3400.
010110     MOVE TA-NLOTE TO LOTE-3.
010120     MOVE TA-NLOJA TO LOJA-3.
010130     MOVE TA-NAT   TO NAT-3.
010140     MOVE DIA   TO DIA-3.
010150     MOVE MES   TO MES-3.
010160     MOVE ANO   TO ANO-3.
010170     MOVE 1        TO IND2 IND4.
010180     IF LOTE-ANT = ZEROS
010190        MOVE ZEROS    TO TOT-NF
010200        MOVE TA-NLOTE TO LOTE-ANT
010210        MOVE TB-NNOTAF(IND2) TO NOTA-ANT.
010220 R-3500.
010230     IF CTL > 50
010240        ADD 1 TO CTP
010250        MOVE CTP TO PAG-CAB1A
010260        WRITE REG-REL FROM CAB1A AFTER PAGE
010270        MOVE "RCE2101A" TO NOME-RELA
010280        WRITE REG-REL FROM CAB2A AFTER 1
010290        WRITE REG-REL FROM CAB132 AFTER 1
010300        WRITE REG-REL FROM CAB2 AFTER 1
010310        WRITE REG-REL FROM CAB132 AFTER 1
010320        WRITE REG-REL FROM CAB3 AFTER 2
010330        WRITE REG-REL FROM CAB4 AFTER 2
010340        MOVE 10 TO CTL
010350        MOVE 1 TO IND1-W
010360     ELSE
010370        IF LOTE-ANT = TA-NLOTE
010380           NEXT SENTENCE
010390        ELSE
010400           WRITE REG-REL FROM CAB3 AFTER 2
010410           WRITE REG-REL FROM CAB4 AFTER 2
010420           MOVE TA-NLOTE TO LOTE-ANT
010430           MOVE ZEROS TO TOT-NF
010440           ADD 4 TO CTL.
010450     IF IND4 > 20 OR TB-COD(IND2 IND4) = 999999
010460        ADD 1 TO IND2
010470        MOVE 1 TO IND4
010480        GO TO R-3500.
010490     IF IND2 > TA-TOTNOTAS
010500        MOVE TOT-NFR TO TOTNF-6
010510        WRITE REG-REL FROM CAB6 AFTER 2
010520        ADD 2 TO CTL
010530        GO TO R-3600.
010540     IF TB-NNOTAF(IND2) NOT = NOTA-ANT
010550        MOVE TOT-NFR TO TOTNF-6
010560        WRITE REG-REL FROM CAB6 AFTER 2
010570        ADD 2 TO CTL MOVE ZEROS TO TOT-NF
010580        MOVE TB-NNOTAF(IND2) TO NOTA-ANT.
010590 R-3550.
010600     MOVE TB-NNOTAF(IND2)   TO NOTA-5.
010610     IF DECIMAL-EMPCE = "S"
010620        MOVE TB-QTR(IND2 IND4) TO ED-DEC
010630        MOVE ED-DEC TO QUANT-5
010640     ELSE
010650        MOVE TB-QT(IND2 IND4)  TO ED-INT
010660        MOVE ED-INT TO QUANT-5.
010670     IF DECIMAL-EMPCE = "S"
010680        MULTIPLY TB-VALORR(IND2 IND4) BY TB-QTR(IND2 IND4)
010690        GIVING VR-22R
010700     ELSE
010710        MULTIPLY TB-VALOR(IND2 IND4) BY TB-QT(IND2 IND4)
010720        GIVING VR-22.
010730     MOVE VR-22R TO VALOR-5.
010740     ADD VR-22   TO TOT-NF.
010750     MOVE TB-CODR(IND2 IND4) TO CODI-5 COD-01.
010760     READ ACE01 INVALID KEY
010770        MOVE ALL "*"  TO DESC-01.
010780     MOVE DESC-01     TO DESC-5.
010790     WRITE REG-REL FROM CAB5 AFTER 1.
010800     ADD 1 TO CTL, IND4.
010810     GO TO R-3500.
010820 R-3600.
010830     MOVE TA-VRNOTAR  TO TLOTE-7.
010840     MOVE TA-TOTITENS TO TITEM-8.
010850     IF DECIMAL-EMPCE = "S"
010860        MOVE TG-QUANTR TO ED-DEC
010870        MOVE ED-DEC TO QUANT-9
010880     ELSE
010890        MOVE TG-QUANT  TO ED-INT
010900        MOVE ED-INT TO QUANT-9.
010910     WRITE REG-REL FROM CAB7 AFTER 2.
010920     WRITE REG-REL FROM CAB8 AFTER 1.
010930     WRITE REG-REL FROM CAB9 AFTER 1.
010940     WRITE REG-REL FROM CAB132 AFTER 1.
010950     ADD 5 TO CTL.
010960 R-3700.
010970     MOVE ZEROS TO ERRO-VAL.
010980     IF TA-TIPONF = "C"
010990        MOVE "CARTAO"          TO TIP-22.
011000     IF TA-TIPONF = "F"
011010        MOVE "FATURADO"        TO TIP-22.
011020     IF TA-TIPONF = "A"
011030        MOVE "A VISTA"         TO TIP-22.
011040     MOVE TA-NLOTE             TO LOTE-22
011050     MOVE TB-COD(IND2 IND4)    TO CODI-22.
011060     MOVE TB-NNOTAF(IND2)      TO NOTA-22.
011070     MOVE TA-NLOJA             TO LOJA-22.
011080     MOVE DIA                  TO DIA-22.
011090     MOVE MES                  TO MES-22.
011100     MOVE ANO                  TO ANO-22.
011110     MOVE TB-QT(IND2 IND4)     TO QUANT-22.
011120     MOVE DESC-01              TO DESC-22.
011130     MOVE TB-VALORR(IND2 IND4) TO VRUNF-22.
011140     MOVE TB-CODVEND(IND2)     TO CODVEND-04.
011150     READ ACF04 INVALID KEY
011160        MOVE ALL "*" TO NOMEVEND-04.
011170     MOVE NOMEVEND-04  TO NOME-22.
011180     MOVE ZEROS TO VALOR-AUX.
011190     IF DECIMAL-EMPCE = "S"
011200        MULTIPLY TB-VALORR(IND2 IND4) BY TB-QTR(IND2 IND4)
011210        GIVING VALOR-AUXR
011220     ELSE
011230        MULTIPLY TB-VALOR(IND2 IND4) BY TB-QT(IND2 IND4)
011240        GIVING VALOR-AUX.
011250        IF PRVAR-01 = ZEROS
011260            MOVE 100 TO PRVAR-01.
011270        IF PRATAC-01 = ZEROS
011280            MOVE 100 TO PRATAC-01.
011290     IF TA-TIPOVENDA = "B"
011300        DIVIDE TB-VALORR(IND2 IND4) BY PRVAR-01R GIVING CALC-PERC
011310        SUBTRACT CALC-PERC FROM 1 GIVING CALC-PERC
011320        MULTIPLY CALC-PERC BY 100 GIVING DIF-PERC
011330        MOVE PRVAR-01R TO VRUCAD-22
011340        MOVE VALOR-AUX TO VRITEM-22
011350        MOVE DIF-PERC  TO DIFER-22
011360     ELSE
011370        DIVIDE TB-VALORR(IND2 IND4) BY PRATAC-01R GIVING CALC-PERC
011380        SUBTRACT CALC-PERC FROM 1 GIVING CALC-PERC
011390        MULTIPLY CALC-PERC BY 100 GIVING DIF-PERC
011400        MOVE PRATAC-01R TO VRUCAD-22
011410        MOVE VALOR-AUX  TO VRITEM-22
011420        MOVE DIF-PERC   TO DIFER-22.
011430     IF DIF-PERC1 > DIF-EMPCE
011440        NEXT SENTENCE
011450     ELSE
011460        GO TO R-3800.
011470     READ ACE22 INVALID KEY
011480        GO TO R-3750.
011490     DISPLAY (22, 14) "DIFERENCA JA' GRAVADA NO ACE22 =>" FS
011500     ACCEPT (22, 78) CR WITH UPDATE
011510     DISPLAY (22, 14) EX-MENS
011520     GO TO R-3800.
011530 R-3750.
011540     WRITE REG-ACE22 INVALID KEY
011550        DISPLAY (22, 14) "ERRO NO WRITE ACE22 FS " FS
011560        ACCEPT (22, 78) CR WITH UPDATE
011570        DISPLAY (22, 14) EX-MENS.
011580 R-3800.
011590     EXIT.
011600 R-3900.
011610     MOVE TA-NLOTE   TO LOTE-04.
011620     MOVE TA-NLOJA   TO LOJA-04.
011630     MOVE TA-NAT     TO NAT-04.
011640     MOVE TA-SERIE   TO SERIE-04.
011650     MOVE TA-CONSUMO TO CONSUMO-04.
011660     IF CUSTO-EMPCE = "N"
011670        MOVE ZEROS   TO CC-04
011680     ELSE
011690        MOVE CC-05   TO CC-04.
011700     MOVE 0          TO IND4.
011710     MOVE 1          TO IND2.
011720 R-4000.
011730     IF IND2 > 20
011740        DISPLAY (22, 14) "INCLUSAO NO ACE04 - OK < >"
011750        ACCEPT (22, 78) CR WITH UPDATE
011760        GO TO R-0100.
011770     IF TB-NNOTAF(IND2) = 0
011780        DISPLAY (22, 14) "INCLUSAO NO ACE04 - OK < >"
011790        ACCEPT (22, 78) CR WITH UPDATE
011800        GO TO R-0100.
011810     ADD 1 TO IND4.
011820     IF TB-COD(IND2 IND4) = 999999 OR IND4 > 20
011830        MOVE 0 TO IND4
011840        ADD 1 TO IND2
011850        GO TO R-4000.
011860     MOVE 2                TO TIPO-10.
011870     MOVE TB-CLIENTE(IND2) TO CLIENTE-10.
011880     MOVE TB-NNOTAF(IND2)  TO NUMNF-10.
011890     MOVE TB-PRAZO(IND2)   TO PRAZO-10.
011900     MOVE DIA           TO DD-10.
011910     MOVE MES           TO MM-10.
011920     MOVE ANO           TO AA-10.
011930     MOVE TB-VRNOTA(IND2)  TO TOTAL-RED-10
011940     IF TA-TIPONF = "A" OR "P" OR "C" GO TO R-4100.
011950     READ ACP10 INVALID KEY MOVE 1 TO ST.
011960     IF FS NOT > 04 GO TO R-4100.
011970     WRITE REG-CP10 INVALID KEY
011980        DISPLAY (22, 14)
011990        "ERRO NA GRAVACAO DA NOTA FISCAL STATUS:=> " FS
012000        ACCEPT (22, 78) CR WITH UPDATE
012010        DISPLAY (22, 14) EX-MENS
012020        GO TO R-9999.
012030     MOVE ALL ZEROS TO REG-CP10.
012040     MOVE SPACES TO STATUS-10 SERIE-10.
012050 R-4100.
012060     MOVE TB-CODR(IND2 IND4) TO COD-04 COD-01.
012070     READ ACE01 INVALID KEY MOVE 1 TO ST.
012080     IF FS = 29 GO TO R-4100.
012090     MOVE TB-NNOTAF(IND2)  TO NF-04.
012100     READ ACE04 INVALID KEY
012110        GO TO R-4200.
012120     IF DECIMAL-EMPCE = "S"
012130        MULTIPLY TB-VALORR(IND2 IND4) BY TB-QTR(IND2 IND4)
012140        GIVING SOMA-FINALR
012150     ELSE
012160        MULTIPLY TB-VALOR(IND2 IND4) BY TB-QT(IND2 IND4)
012170        GIVING SOMA-FINAL.
012180     IF TB-FATOR(IND2 IND4)  = 0
012190        MOVE 1 TO TB-FATOR(IND2 IND4) .
012200     DIVIDE SOMA-FINALR BY TB-FATOR(IND2 IND4) GIVING VALOR-AUXR.
012210     ADD VALOR-AUXR          TO SREAL-04R.
012220     MOVE TB-CODR(IND2 IND4) TO COD-04.
012230     MOVE TB-NNOTAF(IND2)    TO NF-04.
012240     MOVE TB-PRAZO(IND2)     TO PRZ-04.
012250     IF DECIMAL-EMPCE = "S"
012260        MULTIPLY CREAL-01R BY TB-QTR(IND2 IND4)
012270        GIVING VALOR-AUXR
012280     ELSE
012290        MULTIPLY CREAL-01 BY TB-QT(IND2 IND4)
012300        GIVING VALOR-AUX.
012310     ADD VALOR-AUXR TO CREAL-04R.
012320     IF TB-PRAZO(IND2) = 0 OR TA-TIPONF = "C"
012330        MOVE 0 TO COND-04.
012340     ADD SOMA-FINAL TO PRVEND-04.
012350     IF DECIMAL-EMPCE = "S"
012360        MULTIPLY CMEDIO-01R BY TB-QTR(IND2 IND4)
012370        GIVING VALOR-AUXR
012380     ELSE
012390        MULTIPLY CMEDIO-01 BY TB-QT(IND2 IND4)
012400        GIVING VALOR-AUX.
012410     ADD VALOR-AUX  TO CMEDIO-04.
012420     MOVE ZEROS  TO CICM-04.
012430     ADD TB-QT(IND2 IND4) TO QTSAIDA-04.
012440     IF DECIMAL-EMPCE = "S"
012450        MULTIPLY VRPU-01R BY TB-QTR(IND2 IND4)
012460        GIVING VALOR-AUXR
012470     ELSE
012480        MULTIPLY VRPU-01 BY TB-QT(IND2 IND4)
012490        GIVING VALOR-AUX.
012500     ADD VALOR-AUXR TO CPU-04.
012510     REWRITE REG-04 INVALID KEY
012520        DISPLAY (22, 14) "ERRO NA REGRAVACAO ACE04 < >"
012530        ACCEPT (22, 78) CR WITH UPDATE
012540        GO TO R-9999.
012550     GO TO R-4000.
012560 R-4200.
012570     MOVE TA-NLOTE          TO LOTE-04
012580     MOVE TB-CODVEND(IND2)  TO VENDEDOR-04.
012590     IF DECIMAL-EMPCE = "S"
012600        MULTIPLY TB-QTR(IND2 IND4) BY TB-VALORR(IND2 IND4)
012610        GIVING PRVEND-04R
012620     ELSE
012630        MULTIPLY TB-QT(IND2 IND4) BY TB-VALOR(IND2 IND4)
012640        GIVING PRVEND-04.
012650     IF DECIMAL-EMPCE = "S"
012660        MULTIPLY CREAL-01R BY TB-QTR(IND2 IND4) GIVING CREAL-04R
012670     ELSE
012680        MULTIPLY CREAL-01 BY TB-QT(IND2 IND4) GIVING CREAL-04.
012690     ACCEPT HORA-W FROM TIME.
012700     MOVE TB-CLIENTE(IND2) TO CLIENTE-04.
012710     MOVE DIA        TO DMOV-04.
012720     MOVE MES        TO MMOV-04.
012730     MOVE ANO        TO AMOV-04.
012740     MOVE ZEROS      TO DIF-04.
012750     MOVE SPACES     TO STATUS-04.
012760     MOVE TA-ENTREGA TO ENTREGA-04.
012770     IF TB-FATOR(IND2 IND4) = 0
012780        MOVE 1 TO TB-FATOR(IND2 IND4).
012790     DIVIDE PRVEND-04R BY TB-FATOR(IND2 IND4) GIVING SREAL-04R.
012800     IF DECIMAL-EMPCE = "S"
012810        MULTIPLY CMEDIO-01R BY TB-QTR(IND2 IND4) GIVING CMEDIO-04R
012820     ELSE
012830        MULTIPLY CMEDIO-01 BY TB-QT(IND2 IND4) GIVING CMEDIO-04.
012840     MOVE TB-PRAZO(IND2) TO PRZ-04.
012850     MOVE ZEROS          TO CICM-04.
012860     MOVE TB-QT(IND2 IND4) TO QTSAIDA-04.
012870     IF DECIMAL-EMPCE = "S"
012880        MULTIPLY VRPU-01R BY TB-QTR(IND2 IND4)
012890        GIVING VALOR-AUXR
012900     ELSE
012910        MULTIPLY VRPU-01 BY TB-QT(IND2 IND4)
012920        GIVING VALOR-AUX.
012930     MOVE VALOR-AUXR TO CPU-04.
012940     WRITE REG-04 INVALID KEY
012950        DISPLAY (22, 14) "ERRO NA GRAVACAO ACE04 < >"
012960        ACCEPT (22, 78) CR WITH UPDATE
012970        GO TO R-9999.
012980     GO TO R-4000.
012990 R-4300.
013000     IF IND1-W NOT = 1 GO TO R-9999.
013010     MOVE 70 TO CTL.
013020     MOVE 0 TO CTP.
013030     MOVE LOW-VALUE TO CHAVE-22.
013040     MOVE TA-NLOTE  TO LOTE-22.
013050     START ACE22 KEY IS NOT < CHAVE-22 INVALID KEY
013060        DISPLAY (22, 14) "ARQUIVO VAZIO C/PROBLEMAS"
013070        ACCEPT (22, 78) CR WITH UPDATE
013080        GO TO R-9999.
013090 R-4400.
013100     READ ACE22 NEXT RECORD AT END
013110        GO TO R-9999.
013120 R-4600.
013130     IF LOTE-22 NOT = TA-NLOTE
013140        GO TO R-4400.
013150     IF CTL > 60
013160        ADD 1 TO CTP
013170        MOVE CTP TO PAG-CAB1A
013180        WRITE REG-REL FROM CAB1A AFTER PAGE
013190        MOVE "RCE2101B" TO NOME-RELA
013200        WRITE REG-REL FROM CAB2A AFTER 1
013210        WRITE REG-REL FROM CAB132 AFTER 1
013220        WRITE REG-REL FROM CAB10  AFTER 1
013230        WRITE REG-REL FROM CAB132 AFTER 1
013240        WRITE REG-REL FROM CAB11  AFTER 2
013250        WRITE REG-REL FROM CAB132 AFTER 1
013260        MOVE 8 TO CTL.
013270     MOVE NOME-22   TO NOME-12.
013280     MOVE CODI-22   TO CODI-12.
013290     MOVE NOTA-22   TO NOTA-12.
013300     IF DECIMAL-EMPCE = "S"
013310        MOVE QUANT-22R TO ED-DEC
013320        MOVE ED-DEC    TO QUANT-12
013330     ELSE
013340        MOVE QUANT-22  TO ED-INT
013350        MOVE ED-INT    TO QUANT-12.
013360     MOVE LOJA-22      TO LOJA-12.
013370     MOVE DIA-22       TO DIA-12.
013380     MOVE MES-22       TO MES-12.
013390     MOVE ANO-22       TO ANO-12.
013400     MOVE DESC-22      TO DESC-12.
013410     MOVE VRUNF-22     TO VRUNF-12.
013420     MOVE VRUCAD-22    TO VRUCAD-12.
013430     MOVE VRITEM-22    TO VRITEM-12.
013440     MOVE DIFER-22     TO DIFER-12.
013450     MOVE LOTE-22      TO LOTE-12.
013460     MOVE TIP-22       TO TIP-12.
013470     WRITE REG-REL FROM CAB12 AFTER 1.
013480     ADD 1 TO CTL.
013490     GO TO R-4400.
013500 R-9999.
013510     CLOSE ACP01 ACE01 ACE02 ACE04 ACF04 ACE05 ACE13 ACE22
013520           ACE18 ACP10 ACC01 REL.
013530     EXIT PROGRAM.
013540*------------------F-I-M----------------------
