000010***************************
000020* REORGANIZACAO DO ACE18  *
000030***************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6218.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-18".
000080     SELECT  ACEAUX   ASSIGN TO DISK
000090                      ORGANIZATION IS INDEXED
000100                      ACCESS MODE IS DYNAMIC
000110                      LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000120                      RECORD KEY IS CHAVE-18X
000130                      ALTERNATE RECORD KEY IS COD-18X
000140                      WITH DUPLICATES
000150                      ALTERNATE RECORD KEY IS DATMOV-18X
000160                      WITH DUPLICATES
000170                      FILE STATUS IS FS.
000180 COPY "/dados1/book/FDCE".
000190 COPY "/dados1/book/FD-18".
000200 FD  ACEAUX
000210     VALUE OF FILE-ID IS "ACEAUX".
000220 01  REG-X.
000230     03 CHAVE-18X.
000240        05 LOJA-18X    PIC 99.
000250        05 COD-18X     PIC X(06).
000260        05 NF-18X      PIC 9(06).
000270     03 ALT-18X.
000280        05 LOTE-18X    PIC X(05).
000290     03 COND-18X       PIC X.
000300     03 SERIE-18X      PIC X.
000310     03 ENTREGA-18X    PIC X.
000320     03 QTSAIDA-18X    PIC 9(07).
000330     03 QTSAIDA-18XR REDEFINES QTSAIDA-18X PIC 9(05)V99.
000340     03 DATMOV-18X.
000350        05 AMOV-18X    PIC 99.
000360        05 MMOV-18X    PIC 99.
000370        05 DMOV-18X    PIC 99.
000380     03 VENDEDOR-18X   PIC 9(05).
000390     03 CC-18X         PIC 9(04).
000400     03 PRZ-18X        PIC 9(03).
000410     03 CMEDIO-18X     PIC 9(11).
000420     03 CMEDIO-18XR REDEFINES
000430        CMEDIO-18X     PIC 9(09)V99.
000440     03 CREAL-18X      PIC 9(11).
000450     03 CREAL-18XR REDEFINES
000460        CREAL-18X      PIC 9(09)V99.
000470     03 PRVEND-18X     PIC 9(12).
000480     03 PRVEND-18XR REDEFINES
000490        PRVEND-18X     PIC 9(10)V99.
000500     03 SREAL-18X      PIC 9(12).
000510     03 SREAL-18XR REDEFINES
000520        SREAL-18X      PIC 9(10)V99.
000530     03 CICM-18X       PIC 9(09).
000540     03 CICMR-18X REDEFINES
000550        CICM-18X       PIC 9(07)V99.
000560     03 DIF-18X        PIC 9(08).
000570     03 DIF-18XR REDEFINES
000580        DIF-18X        PIC 9(06)V99.
000590     03 STATUS-18X     PIC X.
000600     03 NAT-18X        PIC X(03).
000610     03 CLIENTE-18X    PIC 9(05).
000620     03 CODTRI-18X     PIC 9(01).
000630     03 CONSUMO-18X    PIC X(01).
000640     03 CPU-18X        PIC 9(04)V99.
000650     03 FILLERX        PIC X(01).
000660 COPY "/dados1/book/TAB-W".
000680 01  L1-W              PIC 9(02) VALUE ZEROS.
000690 01  IND-W             PIC 9(02) VALUE ZEROS.
000700 01 DATMOV-EXC.
000710    02 AMOV-EXC    PIC 99.
000720    02 MMOV-EXC    PIC 99.
000730    02 DMOV-EXC    PIC 99.
000740 01 REG-COD.
000750    02 CAMPOS OCCURS 10 TIMES.
000760       05 COD-F   PIC 9(05).
000770       05 COD-S   PIC 9(05).
000780 COPY "/dados1/book/CPYPDCE".
000790 COPY "/dados1/book/CPYPDFS".
000800 R-0000.
000810     DISPLAY (01, 01) ERASE.
000820 COPY "/dados1/book/MOLDURA".
000830     MOVE "TCE6218" TO TS.
000840     MOVE "PROCEDIMENTO ESPECIAL " TO INFT.
000850     DISPLAY (02, 25) "SISTEMA CONTROLE DE ESTOQUE".
000860     DISPLAY (02, 75) COD-EMPCE.
000870     DISPLAY (04, 01) LIMPA-1.
000880     DISPLAY (04, 04) TS.
000890     DISPLAY (04, 25) INFT.
000900     DISPLAY (22, 14) EX-MENS.
000910     DISPLAY (02, 14) HH-W ":" MS-W.
000920     DISPLAY (06, 25) "REORGANIZACAO DO ACE18".
000930     MOVE 7 TO L1-W.
000940 R-010.
000950     ADD 1 TO L1-W.
000960     DISPLAY (L1-W, 25) "DOADOR DE DADOS.:".
000970     DISPLAY (L1-W, 55) "RECEPTOR DE DADOS.:".
000980     ACCEPT (L1-W, 44) COD-F(01) WITH UPDATE.
000990     ACCEPT (L1-W, 76) COD-S(01) WITH UPDATE.
001000     ADD 1 TO L1-W.
001010     ACCEPT (L1-W, 44) COD-F(02) WITH UPDATE.
001020     ACCEPT (L1-W, 76) COD-S(02) WITH UPDATE.
001030     ADD 1 TO L1-W.
001040     ACCEPT (L1-W, 44) COD-F(03) WITH UPDATE.
001050     ACCEPT (L1-W, 76) COD-S(03) WITH UPDATE.
001060     ADD 1 TO L1-W.
001070     ACCEPT (L1-W, 44) COD-F(04) WITH UPDATE.
001080     ACCEPT (L1-W, 76) COD-S(04) WITH UPDATE.
001090     ADD 1 TO L1-W.
001100     ACCEPT (L1-W, 44) COD-F(05) WITH UPDATE.
001110     ACCEPT (L1-W, 76) COD-S(05) WITH UPDATE.
001120     ADD 1 TO L1-W.
001130     ACCEPT (L1-W, 44) COD-F(06) WITH UPDATE.
001140     ACCEPT (L1-W, 76) COD-S(06) WITH UPDATE.
001150     ADD 1 TO L1-W.
001160     ACCEPT (L1-W, 44) COD-F(07) WITH UPDATE.
001170     ACCEPT (L1-W, 76) COD-S(07) WITH UPDATE.
001180     ADD 1 TO L1-W.
001190     ACCEPT (L1-W, 44) COD-F(08) WITH UPDATE.
001200     ACCEPT (L1-W, 76) COD-S(08) WITH UPDATE.
001210     ADD 1 TO L1-W.
001220     ACCEPT (L1-W, 44) COD-F(09) WITH UPDATE.
001230     ACCEPT (L1-W, 76) COD-S(09) WITH UPDATE.
001240     ADD 1 TO L1-W.
001250     ACCEPT (L1-W, 44) COD-F(10) WITH UPDATE.
001260     ACCEPT (L1-W, 76) COD-S(10) WITH UPDATE.
001270 ROT-200.
001280     DISPLAY (15, 25) "CONFIRME (S<N>)".
001290     ACCEPT (15, 41) RESP WITH UPDATE.
001300     IF RESP NOT = "S"
001310        GO TO R-0000.
001320     OPEN INPUT ACE18.
001330     IF FS NOT = "00"
001340        MOVE "MCE6218A" TO CODMENFS
001350        MOVE "ACE18" TO ARQFS
001360        PERFORM TESTA-FS THRU SAI-TESTA-FS
001370        CLOSE ACE18 STOP RUN.
001380     OPEN OUTPUT ACEAUX.
001390     IF FS NOT = "00"
001400        MOVE "MCE6218B" TO CODMENFS
001410        MOVE "ACEAUX" TO ARQFS
001420        PERFORM TESTA-FS THRU SAI-TESTA-FS
001430        CLOSE ACE18 ACEAUX STOP RUN.
001440     CLOSE ACEAUX.
001450     OPEN I-O ACEAUX.
001460     IF FS NOT = "00"
001470        MOVE "MCE6218C" TO CODMENFS
001480        MOVE "ACEAUX" TO ARQFS
001490        PERFORM TESTA-FS THRU SAI-TESTA-FS
001500        CLOSE ACE18 ACEAUX STOP RUN.
001510     MOVE SPACES TO CHAVE-18.
001520     START ACE18 KEY IS NOT < CHAVE-18 INVALID KEY
001530        DISPLAY (22, 14) "CAD. RAZAO DE ESTOQUE, VAZIO < >"
001540        ACCEPT (22, 78) CR WITH UPDATE
001550        GO TO R-9999.
001560     DISPLAY (22, 14)
001570     "AGUARDE, PROCESSANDO ARQUIVO AUXILIAR ".
001580 R-100.
001590     READ ACE18 NEXT RECORD AT END
001600        CLOSE ACE18 ACEAUX
001610        GO TO R-200.
001620     MOVE REG-18 TO REG-X.
001630     WRITE REG-X INVALID KEY
001640        MOVE "MCE6218C" TO CODMENFS
001650        MOVE "ACEAUX" TO ARQFS
001660        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001670     GO TO R-100.
001680 R-200.
001690     OPEN INPUT ACEAUX.
001700     IF FS NOT = "00"
001710        MOVE "MCE6218D" TO CODMENFS
001720        MOVE "ACEAUX"    TO ARQFS
001730        PERFORM TESTA-FS THRU SAI-TESTA-FS
001740        CLOSE ACEAUX STOP RUN.
001750     OPEN OUTPUT ACE18.
001760     CLOSE ACE18.
001770     OPEN I-O ACE18.
001780     IF FS NOT = "00"
001790        MOVE "MCE6218E" TO CODMENFS
001800        MOVE "ACE18"    TO ARQFS
001810        PERFORM TESTA-FS THRU SAI-TESTA-FS
001820        CLOSE ACE18 ACEAUX STOP RUN.
001830     DISPLAY (22, 14)
001840     "AGUARDE, REORGANIZANDO                             ".
001850     MOVE SPACES TO CHAVE-18X.
001860     START ACEAUX KEY IS NOT < CHAVE-18X INVALID KEY
001870        DISPLAY (22, 14) "ACEAUX VAZIO OU C/PROBLEMAS"
001880        ACCEPT (22, 78) CR WITH UPDATE
001890        CLOSE ACEAUX STOP RUN.
001900 R-300.
001910     READ ACEAUX NEXT RECORD AT END
001920        GO TO R-400.
001930     MOVE ZEROS        TO REG-18.
001940     MOVE LOJA-18X     TO LOJA-18.
001950     MOVE COD-18X      TO COD-18.
001960     MOVE NF-18X       TO NF-18.
001970     MOVE LOTE-18X     TO LOTE-18.
001980     MOVE COND-18X     TO COND-18.
001990     MOVE SERIE-18X    TO SERIE-18.
002000     MOVE ENTREGA-18X  TO ENTREGA-18.
002010     IF QTSAIDA-18X    NOT NUMERIC MOVE ZEROS TO QTSAIDA-18X.
002020     MOVE QTSAIDA-18X  TO QTSAIDA-18.
002030     IF AMOV-18X       NOT NUMERIC MOVE ZEROS TO AMOV-18X.
002040     IF MMOV-18X       NOT NUMERIC MOVE ZEROS TO MMOV-18X.
002050     IF DMOV-18X       NOT NUMERIC MOVE ZEROS TO DMOV-18X.
002060     MOVE DATMOV-18X   TO DATMOV-18.
002070     MOVE VENDEDOR-18X TO VENDEDOR-18.
002080     IF CC-18X         NOT NUMERIC MOVE ZEROS TO CC-18X.
002090     MOVE CC-18X       TO CC-18.
002100     IF PRZ-18X        NOT NUMERIC MOVE ZEROS TO PRZ-18X.
002110     MOVE PRZ-18X      TO PRZ-18.
002120     IF CMEDIO-18X     NOT NUMERIC MOVE ZEROS TO CMEDIO-18X.
002130     MOVE CMEDIO-18X   TO CMEDIO-18.
002140     IF CREAL-18X      NOT NUMERIC MOVE ZEROS TO CREAL-18X.
002150     MOVE CREAL-18X    TO CREAL-18.
002160     IF PRVEND-18X     NOT NUMERIC MOVE ZEROS TO PRVEND-18X.
002170     MOVE PRVEND-18X   TO PRVEND-18.
002180     IF SREAL-18X      NOT NUMERIC MOVE ZEROS TO SREAL-18X.
002190     MOVE SREAL-18X    TO SREAL-18.
002200     IF CICM-18X       NOT NUMERIC MOVE ZEROS TO CICM-18X.
002210     MOVE CICM-18X     TO CICM-18.
002220     IF DIF-18X        NOT NUMERIC MOVE ZEROS TO DIF-18X.
002230     MOVE DIF-18X      TO DIF-18.
002240     MOVE STATUS-18X   TO STATUS-18.
002250     MOVE NAT-18X      TO NAT-18.
002260     IF CLIENTE-18X    NOT NUMERIC MOVE ZEROS TO CLIENTE-18X.
002270     MOVE CLIENTE-18X  TO CLIENTE-18.
002280     IF VENDEDOR-18X   NOT NUMERIC MOVE ZEROS TO VENDEDOR-18X.
002290     MOVE VENDEDOR-18X TO VENDEDOR-18.
002300     IF CODTRI-18X     NOT NUMERIC MOVE ZEROS TO CODTRI-18X.
002310     MOVE CODTRI-18X   TO CODTRI-18.
002320     MOVE CONSUMO-18X  TO CONSUMO-18.
002330     IF CPU-18X        NOT NUMERIC MOVE ZEROS TO CPU-18X.
002340     MOVE CPU-18X      TO CPU-18 GO TO R-301.
002350     IF COD-S(01) = CLIENTE-18X
002360        MOVE COD-F(01) TO CLIENTE-18 GO TO R-301.
002370     IF COD-S(02) = CLIENTE-18X
002380        MOVE COD-F(02) TO CLIENTE-18 GO TO R-301.
002390     IF COD-S(03) = CLIENTE-18X
002400        MOVE COD-F(03) TO CLIENTE-18 GO TO R-301.
002410     IF COD-S(04) = CLIENTE-18X
002420        MOVE COD-F(04) TO CLIENTE-18 GO TO R-301.
002430     IF COD-S(05) = CLIENTE-18X
002440        MOVE COD-F(05) TO CLIENTE-18 GO TO R-301.
002450     IF COD-S(06) = CLIENTE-18X
002460        MOVE COD-F(06) TO CLIENTE-18 GO TO R-301.
002470     IF COD-S(07) = CLIENTE-18X
002480        MOVE COD-F(07) TO CLIENTE-18 GO TO R-301.
002490     IF COD-S(08) = CLIENTE-18X
002500        MOVE COD-F(08) TO CLIENTE-18 GO TO R-301.
002510     IF COD-S(09) = CLIENTE-18X
002520        MOVE COD-F(09) TO CLIENTE-18 GO TO R-301.
002530     IF COD-S(10) = CLIENTE-18X
002540        MOVE COD-F(10) TO CLIENTE-18 GO TO R-301.
002550 R-301.
002560     WRITE REG-18 INVALID KEY
002570        MOVE "MCE6218F" TO CODMENFS
002580        MOVE "ACE18"    TO ARQFS
002590        PERFORM TESTA-FS THRU SAI-TESTA-FS.
002600     GO TO R-300.
002610 R-400.
002620     CLOSE ACE18 ACEAUX.
002630 R-9999.
002640      EXIT PROGRAM.
002650*---------------F-I-M-------------------
