000010*************************************
000020* SCE6101-INICIALIZACAO DE ARQUIVOS COMP 01/08/2005*
000030*************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6101.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-01".
000080 COPY "/dados1/book/SELC-02".
000090 COPY "/dados1/book/SELC-03".
000100 COPY "/dados1/book/SELC-04".
000110 COPY "/dados1/book/SELC-05".
000120 COPY "/dados1/book/SELC-06".
000130 COPY "/dados1/book/SELC-07".
000140 COPY "/dados1/book/SELC-08".
000150 COPY "/dados1/book/SELC-09".
000160 COPY "/dados1/book/SELC-10".
000170 COPY "/dados1/book/SELC-11".
000180 COPY "/dados1/book/SELC-12".
000190 COPY "/dados1/book/FDCE".
000200 COPY "/dados1/book/FD-01".
000210 COPY "/dados1/book/FD-02".
000220 COPY "/dados1/book/FD-03".
000230 COPY "/dados1/book/FD-04".
000240 COPY "/dados1/book/FD-05".
000250 COPY "/dados1/book/FD-06".
000260 COPY "/dados1/book/FD-07".
000270 COPY "/dados1/book/FD-08".
000280 COPY "/dados1/book/FD-09".
000290 COPY "/dados1/book/FD-10".
000300 COPY "/dados1/book/FD-11".
000310 COPY "/dados1/book/FD-12".
000320 COPY "/dados1/book/TAB-W".
000330 01  SENHA          PIC X(06) VALUE SPACES.
000340 01  MENS           PIC X(34) VALUE
000350     "SENHA NAO AUTORIZADA A ESTA FUNCAO".
000360 COPY "/dados1/book/CPYPDCE".
000370 COPY "/dados1/book/CPYPDFS".
000380 R-0100.
000390     DISPLAY (22, 14) EX-MENS.
000400     MOVE ZEROS TO OPCAO-2.
000410     DISPLAY (22, 14) "<  > - ARQUIVO DESEJADO  .......".
000420     DISPLAY (22, 47) "SENHA:......: CONFIRMA (<S/N>):".
000430     ACCEPT (22, 15) OPCAO-2 WITH UPDATE.
000440     IF OPCAO-2 < 01 OR OPCAO-2 > 12
000450        EXIT PROGRAM.
000460     IF OPCAO-2 = 01 GO TO R-0300.
000470     IF OPCAO-2 = 02 GO TO R-0400.
000480     IF OPCAO-2 = 03 GO TO R-0500.
000490     IF OPCAO-2 = 04 GO TO R-0600.
000500     IF OPCAO-2 = 05 GO TO R-0700.
000510     IF OPCAO-2 = 06 GO TO R-0800.
000520     IF OPCAO-2 = 07 GO TO R-0900.
000530     IF OPCAO-2 = 08 GO TO R-1000.
000540     IF OPCAO-2 = 09 GO TO R-1100.
000550     IF OPCAO-2 = 10 GO TO R-1200.
000560     IF OPCAO-2 = 11 GO TO R-1300.
000570     IF OPCAO-2 = 12 GO TO R-1400.
000580     GO TO R-0100.
000590 R-0300.
000600     DISPLAY (22, 39) "ACE01" COMP-W.
000610     PERFORM R-7777 THRU R-7778.
000620     IF CR NOT = "S" GO TO R-0100.
000630     OPEN OUTPUT ACE01 CLOSE ACE01.
000640     DISPLAY (22, 61) "** INICIALIZADO **"
000650     ACCEPT (22, 79) CR WITH UPDATE.
000660     GO TO R-0100.
000670 R-0400.
000680     DISPLAY (22, 39) "ACE02" COMP-W.
000690     PERFORM R-7777 THRU R-7778.
000700     IF CR NOT = "S" GO TO R-0100.
000710     OPEN OUTPUT ACE02 CLOSE ACE02.
000720     DISPLAY (22, 61) "** INICIALIZADO **"
000730     ACCEPT (22, 79) CR WITH UPDATE.
000740     GO TO R-0100.
000750 R-0500.
000760     DISPLAY (22, 39) "ACE03" COMP-W.
000770     PERFORM R-7777 THRU R-7778.
000780     IF CR NOT = "S"  GO TO R-0100.
000790     OPEN OUTPUT ACE03 CLOSE ACE03.
000800     DISPLAY (22, 61) "** INICIALIZADO **"
000810     ACCEPT (22, 79) CR WITH UPDATE.
000820     GO TO R-0100.
000830 R-0600.
000840     DISPLAY (22, 39) "ACE04" COMP-W.
000850     PERFORM R-7777 THRU R-7778.
000860     IF CR NOT = "S" GO TO R-0100.
000870     OPEN OUTPUT ACE04 CLOSE ACE04.
000880     DISPLAY (22, 61) "** INICIALIZADO **"
000890     ACCEPT (22, 79) CR WITH UPDATE.
000900     GO TO R-0100.
000910 R-0700.
000920     DISPLAY (22, 39) "ACE05" COMP-W.
000930     PERFORM R-7777 THRU R-7778.
000940     IF CR NOT = "S"
000950        GO TO R-0100.
000960     OPEN OUTPUT ACE05 CLOSE ACE05.
000970     DISPLAY (22, 61) "** INICIALIZADO **"
000980     ACCEPT (22, 79) CR WITH UPDATE.
000990     GO TO R-0100.
001000 R-0800.
001010     DISPLAY (22, 39) "ACE06" COMP-W.
001020     PERFORM R-7777 THRU R-7778.
001030     IF CR NOT = "S"
001040        GO TO R-0100.
001050     OPEN OUTPUT ACE06   CLOSE ACE06.
001060     DISPLAY (22, 61) "** INICIALIZADO **"
001070     ACCEPT (22, 79) CR WITH UPDATE.
001080     GO TO R-0100.
001090 R-0900.
001100     DISPLAY (22, 39) "ACE07" COMP-W.
001110     PERFORM R-7777 THRU R-7778.
001120     IF CR NOT = "S"
001130        GO TO R-0100.
001140     OPEN OUTPUT ACE07 CLOSE ACE07.
001150     DISPLAY (22, 61) "** INICIALIZADO **"
001160     ACCEPT (22, 79) CR WITH UPDATE.
001170     GO TO R-0100.
001180 R-1000.
001190     DISPLAY (22, 39) "ACE08" COMP-W.
001200     PERFORM R-7777 THRU R-7778.
001210     IF CR NOT = "S"
001220        GO TO R-0100.
001230     OPEN OUTPUT ACE08  CLOSE ACE08.
001240     DISPLAY (22, 61) "** INICIALIZADO **"
001250     ACCEPT (22, 79) CR WITH UPDATE.
001260     GO TO R-0100.
001270 R-1100.
001280     DISPLAY (22, 39) "ACE09" COMP-W.
001290     PERFORM R-7777 THRU R-7778.
001300     IF CR NOT = "S"
001310        GO TO R-0100.
001320     OPEN OUTPUT ACE09 CLOSE ACE09.
001330     DISPLAY (22, 61) "** INICIALIZADO **"
001340     ACCEPT (22, 79) CR WITH UPDATE.
001350     GO TO R-0100.
001360 R-1200.
001370     DISPLAY (22, 39) "ACE10" COMP-W.
001380     PERFORM R-7777 THRU R-7778.
001390     IF CR NOT = "S"
001400        GO TO R-0100.
001410     OPEN OUTPUT ACE10 CLOSE ACE10.
001420     DISPLAY (22, 61) "** INICIALIZADO **"
001430     ACCEPT (22, 79) CR WITH UPDATE.
001440     GO TO R-0100.
001450 R-1300.
001460     DISPLAY (22, 39) "ACE11" COMP-W.
001470     PERFORM R-7777 THRU R-7778.
001480     IF CR NOT = "S"
001490        GO TO R-0100.
001500     OPEN OUTPUT ACE11 CLOSE ACE11.
001510     DISPLAY (22, 61) "** INICIALIZADO **"
001520     ACCEPT (22, 79) CR WITH UPDATE.
001530     GO TO R-0100.
001540 R-1400.
001550     DISPLAY (22, 39) "ACE12" COMP-W.
001560     PERFORM R-7777 THRU R-7778.
001570     IF CR NOT = "S"
001580        GO TO R-0100.
001590     OPEN OUTPUT ACE12 CLOSE ACE12.
001600     DISPLAY (22, 61) "** INICIALIZADO **"
001610     ACCEPT (22, 79) CR WITH UPDATE.
001620     GO TO R-0100.
001630 R-7777.
001640     ACCEPT (22, 53) SENHA WITH NO-ECHO.
001650     IF SENHA NOT = "INICIO"
001660        MOVE "N" TO CR
001670        GO TO R-7778.
001680     ACCEPT (22, 78) CR WITH UPDATE.
001690 R-7778.
001700     EXIT.
001710 R-7779.
001720     WRITE REG-01 INVALID KEY MOVE 1 TO ST.
001730     WRITE REG-02 INVALID KEY MOVE 1 TO ST.
001740     WRITE REG-03 INVALID KEY MOVE 1 TO ST.
001750     WRITE REG-04 INVALID KEY MOVE 1 TO ST.
001760     WRITE REG-05 INVALID KEY MOVE 1 TO ST.
001770     WRITE REG-06 INVALID KEY MOVE 1 TO ST.
001780     WRITE REG-07 INVALID KEY MOVE 1 TO ST.
001790     WRITE REG-08 INVALID KEY MOVE 1 TO ST.
001800     WRITE REG-09 INVALID KEY MOVE 1 TO ST.
001810     WRITE REG-10 INVALID KEY MOVE 1 TO ST.
001820     WRITE REG-11 INVALID KEY MOVE 1 TO ST.
001830     WRITE REG-12 INVALID KEY MOVE 1 TO ST.
001840*============F=I=M=================
