000010****************************************
000020* SEQUENCIA ACE02 GERANDO ACE02S       *
000030****************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6905.
000060 COPY "/dados1/book/SELCE".
000070 COPY "/dados1/book/SELC-02".
000080     SELECT ACE02S    ASSIGN TO DISK
000090                      ORGANIZATION IS LINE SEQUENTIAL
000100                      ACCESS MODE  IS SEQUENTIAL
000110                      FILE STATUS  IS FS.
000120 COPY "/dados1/book/FDCE".
000130 COPY "/dados1/book/FD-02".
000140 FD  ACE02S
000150     VALUE OF FILE-ID IS "/DADOS2/ARQUIVOS/ACE/ACE02S".
000160 01  REG-X.
000170     03 CHAVE-02X.
000180        05 LOJA-02X    PIC XX.
000190        05 COD-02X     PIC X(06).
000200     03 FLAG-02X       PIC X.
000210     03 QTLOJ-02X      PIC 9(07).
000220     03 QTLOJ-02XR REDEFINES QTLOJ-02X PIC 9(05)V99.
000230     03 QTREP-02X      PIC 9(07).
000240     03 QTREP-02XR REDEFINES QTREP-02X PIC 9(05)V99.
000250     03 QTMIN-02X      PIC 9(07).
000260     03 QTMIN-02XR REDEFINES QTMIN-02X PIC 9(05)V99.
000270     03 QTSAI-02X      PIC 9(07).
000280     03 QTSAI-02XR REDEFINES QTSAI-02X PIC 9(05)V99.
000290     03 DATNOV-02X.
000300        05 MESNOV-02X  PIC 99.
000310        05 ANONOV-02X  PIC 99.
000320     03 VED-02X        PIC 9(12).
000330     03 VED-02XR REDEFINES VED-02X PIC 9(10)V99.
000340     03 FILLERX       PIC X(11).
000350 COPY "/dados1/book/TAB-W".
000360 COPY "/dados1/book/CPYPDCE".
000370 COPY "/dados1/book/CPYPDFS".
000380 ROT-OPCAO.
000390     MOVE "TCE6905" TO TS.
000400     MOVE "REINDEXA / SEQUENCIA - ACE02" TO INFT.
000410 COPY "/dados1/book/CPYTPCE".
000420     DISPLAY (08, 25) "<S>EQUENCIAR".
000430     DISPLAY (10, 25) "<R>EINDEXAR ".
000440     DISPLAY (12, 25) "< > OPCAO   ".
000450     ACCEPT (12, 26) OPCAO WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
000460     IF E = "01" GO TO R-9999.
000470     IF OPCAO = "S" GO TO ROT-S.
000480     IF OPCAO = "R" GO TO ROT-R.
000490     GO TO ROT-OPCAO.
000500 ROT-S.
000510     MOVE "TCE6905" TO TS.
000520     MOVE "SEQUENCIA ACE02 GERANDO ACE02S" TO INFT.
000530 COPY "/dados1/book/CPYTPCE".
000540     DISPLAY (08, 25) "SEQUENCIAR <S/<N>>:".
000550     ACCEPT (08, 45) RESP WITH UPDATE.
000560     IF RESP NOT = "S"
000570        GO TO R-9999.
000580     OPEN INPUT ACE02.
000590     IF FS NOT = "00"
000600        MOVE "MCE6905A" TO CODMENFS
000610        MOVE "ACE02" TO ARQFS
000620        PERFORM TESTA-FS THRU SAI-TESTA-FS
000630        CLOSE ACE02 STOP RUN.
000640     OPEN OUTPUT ACE02S.
000650     IF FS NOT = "00"
000660        MOVE "MCE6905B" TO CODMENFS
000670        MOVE "ACE02S" TO ARQFS
000680        PERFORM TESTA-FS THRU SAI-TESTA-FS
000690        CLOSE ACE02 ACE02S STOP RUN.
000700     MOVE SPACES TO CHAVE-02.
000710     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
000720        DISPLAY (22, 14) "CAD. ESTOQUE NA LOJA, VAZIO < >"
000730        ACCEPT (22, 78) CR WITH UPDATE
000740        GO TO R-9999.
000750     DISPLAY (08, 25) "S E Q U E N C I A N D O".
000760 R-100.
000770     READ ACE02 NEXT RECORD AT END
000780        CLOSE ACE02 ACE02S GO TO R-9999.
000790     MOVE SPACES TO REG-X.
000800     IF LOJA-02 NOT NUMERIC GO TO R-100.
000810     IF LOJA-02 NOT = 04 GO TO R-100.
000820
000830     IF QTLOJ-02 NOT NUMERIC MOVE 0 TO QTLOJ-02.
000840     IF QTREP-02 NOT NUMERIC MOVE 0 TO QTREP-02.
000850     IF QTMIN-02 NOT NUMERIC MOVE 0 TO QTMIN-02.
000860     IF QTSAI-02 NOT NUMERIC MOVE 0 TO QTSAI-02.
000870     IF MESNOV-02 NOT NUMERIC MOVE 0 TO MESNOV-02.
000880     IF ANONOV-02 NOT NUMERIC MOVE 0 TO ANONOV-02.
000890     IF VED-02 NOT NUMERIC MOVE 0 TO VED-02.
000900     MOVE LOJA-02   TO LOJA-02X
000910     MOVE COD-02    TO COD-02X
000920     MOVE FLAG-02   TO FLAG-02X
000930     MOVE QTLOJ-02  TO QTLOJ-02X
000940     MOVE QTREP-02  TO QTREP-02X
000950     MOVE QTMIN-02  TO QTMIN-02X
000960     MOVE QTSAI-02  TO QTSAI-02X
000970     MOVE MESNOV-02 TO MESNOV-02X
000980     MOVE ANONOV-02 TO ANONOV-02X
000990     MOVE VED-02    TO VED-02X.
001000     WRITE REG-X.
001010     IF FS NOT = "00"
001020        MOVE "MCE6905C" TO CODMENFS
001030        MOVE "ACE02S" TO ARQFS
001040        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001050     GO TO R-100.
001060 ROT-R.
001070     MOVE "TCE6905" TO TS.
001080     MOVE "REINDEXA ACE02 LENDO ACE02S" TO INFT.
001090 COPY "/dados1/book/CPYTPCE".
001100     DISPLAY (08, 25) "REINDEXAR (S<N>)".
001110     ACCEPT (08, 45) RESP WITH UPDATE.
001120     IF RESP NOT = "S"
001130        GO TO R-9999.
001140     OPEN OUTPUT ACE02.
001150     CLOSE ACE02 OPEN I-O ACE02.
001160     IF FS NOT = "00"
001170        MOVE "MCE6905D" TO CODMENFS
001180        MOVE "ACE02" TO ARQFS
001190        PERFORM TESTA-FS THRU SAI-TESTA-FS
001200        CLOSE ACE02 STOP RUN.
001210     OPEN INPUT ACE02S.
001220     IF FS NOT = "00"
001230        MOVE "MCE6905E" TO CODMENFS
001240        MOVE "ACE02S" TO ARQFS
001250        PERFORM TESTA-FS THRU SAI-TESTA-FS
001260        CLOSE ACE02 ACE02S STOP RUN.
001270     DISPLAY (08, 25) "R E I N D E X A N D O".
001280 R-0200.
001290     READ ACE02S NEXT RECORD AT END
001300        CLOSE ACE02 ACE02S GO TO R-9999.
001310     MOVE SPACES     TO REG-02.
001320     MOVE LOJA-02X   TO LOJA-02
001330     MOVE COD-02X    TO COD-02
001340     MOVE FLAG-02X   TO FLAG-02
001350     MOVE QTLOJ-02X  TO QTLOJ-02
001360     MOVE QTREP-02X  TO QTREP-02
001370     MOVE QTMIN-02X  TO QTMIN-02
001380     MOVE QTSAI-02X  TO QTSAI-02
001390     MOVE MESNOV-02X TO MESNOV-02
001400     MOVE ANONOV-02X TO ANONOV-02
001410     MOVE VED-02X    TO VED-02.
001420     WRITE REG-02 INVALID KEY
001430        MOVE "MCE6905D" TO CODMENFS
001440        MOVE "ACE02" TO ARQFS
001450        PERFORM TESTA-FS THRU SAI-TESTA-FS.
001460     GO TO R-0200.
001470 R-9999.
001480      EXIT PROGRAM.
001490*---------------F-I-M-------------------
