000010****************************************
000020* SEQUENCIA ACE01 GERANDO ACE01S       *
000030****************************************
000020$ set osvs ms(2) nowarning

000040 IDENTIFICATION DIVISION.
000050 PROGRAM-ID. OCE6904.

00006  COPY "/DADOS1/BOOK/SELCE".
000080 SELECT ACE01S    ASSIGN TO DISK
000090                      ORGANIZATION IS LINE SEQUENTIAL
000100                      ACCESS MODE  IS SEQUENTIAL
000110                      FILE STATUS  IS FS.
000120 COPY "/dados1/book/FDCE".
00013
000150
000160
000170*======================================
000180 FD  ACE01S
000190     VALUE OF FILE-ID IS "c:/download/LP02-08".
000200 01  REG-X.
000210     03 CHAVE-01X.
00020         04 COD-01X     PIC X(20).
000770     03 FILLER        PIC X(1).

000240     03 DESC-01X       PIC X(40).
000770     03 FILLER        PIC X(137).
000860*======================================
000870
000880
000890 COPY "/dados1/book/TAB-W".
001070 COPY "/dados1/book/CPYPDCE".
001080 COPY "/dados1/book/CPYPDFS".
001090 ROT-OPCAO.
001100     MOVE "TCE6904" TO TS.
001110     MOVE "REINDEXA / SEQUENCIA - ACE01" TO INFT.
001120 COPY "/dados1/book/CPYTPCE".
001130     DISPLAY (08, 25) "<S>LE JAHU".
001150     DISPLAY (12, 25) "< > OPCAO   ".
001160     ACCEPT (12, 26) OPCAO WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001170     IF E = "01" GO TO R-9999.
001180     IF OPCAO = "S" GO TO ROT-R.
001200     GO TO ROT-OPCAO.
002740 ROT-R.
002750     MOVE "TCE6904" TO TS.
002760     MOVE "REINDEXA ACE01 LENDO ACE01S" TO INFT.
002770 COPY "/dados1/book/CPYTPCE".
002880     OPEN INPUT ACE01S.
002890     IF FS NOT = "00"
002900         MOVE "MCE6904E" TO CODMENFS
002910         MOVE "ACE01S" TO ARQFS
002920         PERFORM TESTA-FS THRU SAI-TESTA-FS
002930         CLOSE ACE01S STOP RUN.
002940     DISPLAY (08, 25) "R E I N D E X A N D O".
           MOVE 0 TO CTP.
002950 R-100.
002960     READ ACE01S NEXT RECORD AT END
002970        CLOSE ACE01S
002980        GO TO R-9999.
001150     DISPLAY  "COD: " CHAVE-01X " - " DESC-01X .
001160*    ACCEPT OPCAO.
           ADD 1 TO CTP
003810     GO TO R-100.
003820 R-9999.
002930      CLOSE ACE01S STOP RUN.
003830
003840      EXIT PROGRAM.
003850
003940
003950
003960
003970*---------------F-I-M-------------------
