000010************************************************************
000020* SCE1301-PROGRAMA DE MANUTENCAO NO ARQUIVO DE ESTOQUE NAS *
000030*         LOJAS          COMPILADO 8/8/05                  *
000040************************************************************
000020$ set osvs ms(2) nowarning

000050 IDENTIFICATION DIVISION.
000060 PROGRAM-ID. OCE1301.
000070 COPY "/dados1/book/SELCE".
000080 COPY "/dados1/book/SELC-01".
000090 COPY "/dados1/book/SELC-02".
000100 COPY "/dados1/book/SELC-05".
000110      SELECT  ACEAUX  ASSIGN TO DISK
000120                      ORGANIZATION IS INDEXED
000130                      ACCESS MODE IS DYNAMIC
                            LOCK MODE IS AUTOMATIC WITH LOCK ON RECORD
000140                      RECORD KEY IS CHAVE-AUX
000150                      ALTERNATE RECORD KEY IS CH-AUX
000160                      WITH DUPLICATES
000170                      FILE STATUS IS FS.
000180     SELECT REL       ASSIGN TO PRINTER
000190                      FILE STATUS IS FS.
000200 COPY "/dados1/book/FDCE".
000210 COPY "/dados1/book/FD-01".
000220 COPY "/dados1/book/FD-05".
000230 COPY "/dados1/book/FD-02".
000240 COPY "/dados1/book/FDREL132".
000250 FD  ACEAUX
000260     VALUE OF FILE-ID IS "ACEAUX".
000270 01  REG-AUX.
000280     03 CHAVE-AUX.
000290        05 LOJA-AUX    PIC XX.
000300        05 COD-AUX     PIC X(06).
000310     03 CH-AUX.
000320        05 DESC-AUX    PIC X(40).
000330     03 QTLOJ-AUX      PIC 9(07).
000340     03 QTLOJ-AUXR REDEFINES QTLOJ-AUX PIC 9(05)V99.
000350     03 QTREP-AUX      PIC 9(07).
000360     03 QTREP-AUXR REDEFINES QTREP-AUX PIC 9(05)V99.
000370     03 QTMIN-AUX      PIC 9(07).
000380     03 QTMIN-AUXR REDEFINES QTMIN-AUX PIC 9(05)V99.
000390     03 QTSAI-AUX      PIC 9(07).
000400     03 QTSAI-AUXR REDEFINES QTSAI-AUX PIC 9(05)V99.
000410     03 DATNOV-AUX.
000420        05 MESNOV-AUX  PIC 99.
000430        05 ANONOV-AUX  PIC 99.
000440     03 VED-AUX        PIC 9(12).
000450     03 VED-AUXR REDEFINES VED-AUX PIC 9(10)V99.
000460 COPY "/dados1/book/TAB-W".
000470 01  CAB2.
000480     05 FILLER        PIC X(52) VALUE SPACES.
000490     05 FILLER        PIC X(38) VALUE
000500     "**  RELATORIO DE ESTOQUE NAS LOJAS  **".
000510 01  CAB3.
000520     05 FILLER        PIC X(53) VALUE
000530     "LOJA CODIGO DESCRICAO DO PRODUTO".
000540     05 FILLER        PIC X(27) VALUE
000550     "ESTOQUE LOJA QTDE MINIMA".
000560     05 FILLER        PIC X(44) VALUE
000570     "REPOSICAO QTDE SAIDAS VALOR DE VENDAS  MOVIM".
000580 01  CAB4.
000590     05 FILLER        PIC X(53) VALUE
000600     "---- ------ --------------------".
000610     05 FILLER        PIC X(27) VALUE
000620     "------------ -----------".
000630     05 FILLER        PIC X(44) VALUE
000640     "--------- ----------- ---------------  -----".
000650 01  CAB5.
000660     05 FILLER        PIC X(01) VALUE SPACES.
000670     05 LOJA-5        PIC 99 VALUE ZEROS.
000680     05 FILLER        PIC X(02) VALUE SPACES.
000690     05 COD-5         PIC X(07) VALUE SPACES.
000700     05 DESC-5        PIC X(40) VALUE SPACES.
000710     05 FILLER        PIC X(02) VALUE SPACES.
000720     05 QTLOJ-5       PIC X(11) VALUE SPACES.
000730     05 FILLER        PIC X(01) VALUE SPACES.
000740     05 QTMIN-5       PIC X(11) VALUE SPACES.
000750     05 FILLER        PIC X(01) VALUE SPACES.
000760     05 QTREP-5       PIC X(11) VALUE SPACES.
000770     05 FILLER        PIC X(01) VALUE SPACES.
000780     05 QTSAI-5       PIC X(11) VALUE SPACES.
000790     05 FILLER        PIC X(01) VALUE SPACES.
000800     05 VED-5         PIC ZZZZ.ZZZ.ZZ9,99 VALUE ZEROS.
000810     05 FILLER        PIC X(02) VALUE SPACES.
000820     05 MESNOV-5      PIC 99 VALUE ZEROS.
000830     05 FILLER        PIC X   VALUE "/".
000840     05 ANONOV-5      PIC 99 VALUE ZEROS.
000850 01  ED1              PIC Z.ZZZ.ZZZ.ZZ9,99 VALUE ZEROS.
000860 01  CAMPOS.
000870     05 COD-W         PIC 9(06) VALUE ZEROS.
000880     05 LOJAI         PIC 99 VALUE ZEROS.
000890     05 LOJAF         PIC 99 VALUE ZEROS.
000900     05 RESP-W        PIC X(01) VALUE "T".
           copy "ds-cntrl.mf".
       77  display-error-no            pic 9(4).
       COPY "PCED1301.CPB".
000910 COPY "/dados1/book/CPYPDCE".
000930 R-0000.


           MOVE 01 TO COD-EMPCE COMP-00 COMP-01 COMP-05.


       main-process section.

           perform program-initialize
           perform program-body until SAIR-FLG-VERDADE
           perform r-9999
           .
      *---------------------------------------------------------------*

       program-initialize section.

000950     OPEN I-O ACE02
000960     IF FS NOT EQUAL "00"
000970        MOVE "MCE1301A" TO CODMENFS
000980        MOVE "ACE02" TO ARQFS
000990        PERFORM TESTA-FS THRU SAI-TESTA-FS
001000        CLOSE ACE02 STOP RUN.
001010     OPEN INPUT ACE01
001020     IF FS NOT EQUAL "00"
001030        MOVE "MCE1301B" TO CODMENFS
001040         MOVE "ACE01" TO ARQFS
001050        PERFORM TESTA-FS THRU SAI-TESTA-FS
001060        CLOSE ACE02 ACE01 STOP RUN.
001070     OPEN INPUT ACE05
001080     IF FS NOT EQUAL "00"
001090        MOVE "MCE1301C" TO CODMENFS
001100        MOVE "ACE05" TO ARQFS
001110        PERFORM TESTA-FS THRU SAI-TESTA-FS
001120        CLOSE ACE02 ACE01 ACE05 STOP RUN.
           initialize reg-02
           initialize DATA-BLOCK
           initialize ds-input-fields
           move data-block-version-no
                                 to ds-data-block-version-no
           move version-no to ds-version-no
           OPEN INPUT EMPCE.
           READ EMPCE.
           MOVE  DESC-EMPCE TO DESC-EMPCEDCPB
           MOVE COD-EMPCE  TO COD-EMPCECPB
000280     ACCEPT DATA-W FROM DATE.
000290     ACCEPT HORA-W FROM TIME.
           MOVE A-W TO ANOCPB
           ADD 2000 TO ANOCPB
           MOVE M-W TO MESCPB
           MOVE D-W TO DIACPB.
           MOVE HORA-W TO HORACPB
           perform load-screenset.

       program-body section.

           evaluate true
               when INCLUSAO-FLG-VERDADE
                   perform INCLUSAO
               when LIMPAR-FLG-TRUE
                   perform LIMPAR
           end-evaluate
           perform clear-flags
           perform call-dialog-system.

      *---------------------------------------------------------------*

       load-screenset section.

           move ds-new-set to ds-control
           move "TCED1301"  to ds-set-name
           perform call-dialog-system.

      *---------------------------------------------------------------*

       call-dialog-system section.

           call "dsrun" using ds-control-block,
                              data-block.
           if not ds-no-error
               move ds-error-code to display-error-no
               display "DS ERROR NO:   " display-error-no
               perform r-9999
           end-if.

      *---------------------------------------------------------------*

       INCLUSAO section.

            if (SUG-02      <> spaces) and
               (LOJA-02     <> spaces) and
               (COD-02      <> spaces) and
               (FLAG-02     <> spaces) and
               (QTLOJ-02    <> zeros) and
               (QTREP-02    <> zeros) and
               (QTMIN-02    <> zeros) and
               (QTSAI-02    <> zeros) and
               (MESNOV-02   <> zeros) and
               (ANONOV-02   <> zeros) and
               (VED-02      <> zeros) and
               (VRCUS-02    <> zeros)
              move SUG-02cpb      TO  SUG-02
              move LOJA-02cpb     TO  LOJA-02
              move COD-02cpb      TO  COD-02
              move FLAG-02cpb     TO  FLAG-02
              move QTLOJ-02cpb    TO  QTLOJ-02
              move QTREP-02cpb    TO  QTREP-02
              move QTmIN-02cpb    TO  QTMIN-02
              move QTSAI-02cpb    TO  QTSAI-02
              move MESNOV-02cpb   TO  MESNOV-02
              move ANONOV-02cpb   TO  ANONOV-02
              move VED-02cpb      TO  VED-02
              move VRCUS-02cpb    TO  VRCUS-02
              write reg-02
           else
               move "show-save-error" to ds-procedure


           end-if.

      *---------------------------------------------------------------*
       LIMPAR section.

           initialize reg-02
           initialize campos
           perform set-up-for-refresh-screen.
      *---------------------------------------------------------------*

       set-up-for-refresh-screen section.

           move "refresh-data" to ds-procedure.

      *---------------------------------------------------------------*

       clear-flags section.

           initialize ENTRY-FLGS .

       sai-clear section .
      *---------------------------------------------------------------*

001130     MOVE "TCE1301" TO TS.
001140     MOVE "CADASTRAMENTO DE PRODUTO NA LOJA" TO INFT.
001150     MOVE SPACES TO CAMPOS.
001160 R-0100.
001170     MOVE SPACES TO RESP.
001180 COPY "/dados1/book/CPYTPCE".
001190     MOVE 70 TO CTL.
001200     MOVE 0 TO CTP.
001210     DISPLAY (08, 69) "<L>ISTAGEM".
001220 COPY "/dados1/book/CPYTMCE".
001230     IF OPCAO = "L" GO TO ROT-L.
001240     GO TO R-8888.
001250 R-0200.







001260     DISPLAY (07, 21) "CODIGO DA LOJA........: ..".
001270     DISPLAY (08, 21) "CODIGO DO PRODUTO.....: ......".
001280     DISPLAY (09, 21) "QUANT. P/REPOSICAO....: .......    ".
001290     DISPLAY (10, 21) "QUANT. MINIMA.........: .......    ".
001300     DISPLAY (11, 21) "QUANT. NA LOJA........: .......    ".
001310     DISPLAY (12, 21) "QUANT. SAIDA LOJA/MES.: .......    ".
001320     DISPLAY (13, 21)
001330     "VENDA NO MES..........: ............        ".
001340     DISPLAY (14, 21)
001350     "ULTIMA MOVIMENTACAO...: ../..  <MM/AA>".
001360     DISPLAY (15, 21) "EMITIR SUGESTAO COMPRA: .".
001370 ROT-I.
001380     MOVE SPACES TO RESP.
001390     MOVE ALL ZEROS TO REG-02.
001400     MOVE "S"       TO SUG-02.
001410     PERFORM R-0200.
001420 R-0300.
001430     ACCEPT (07, 45) LOJA-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001440     IF E = "01" GO TO R-0100.
001450     MOVE LOJA-02 TO LOJA-05.
001460     READ ACE05 INVALID KEY
001470        DISPLAY (22, 14) "LOJA NAO CADASTRADA < >"
001480        ACCEPT (22, 78) CR WITH UPDATE
001490        DISPLAY (22, 14) EX-MENS
001500        GO TO ROT-I.
001510 R-0400.
001520     ACCEPT (08, 45) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001530     IF E = "01" GO TO R-0300.
001540     MOVE COD-W TO COD-02 COD-01.
001550     READ ACE01 INVALID KEY
001560        DISPLAY (22, 14) "PRODUTO NAO CADASTRADO < >"
001570        ACCEPT (22, 78) CR WITH UPDATE
001580        DISPLAY (22, 14) EX-MENS
001590        GO TO ROT-I.
001600     READ ACE02 INVALID KEY
001610        GO TO R-0500.
001620     DISPLAY (22, 14) "MOVIMENTO JA CADASTRADO < >".
001630     ACCEPT (22, 78) CR WITH UPDATE.
001640     DISPLAY (22, 14) EX-MENS.
001650     GO TO ROT-I.
001660 R-0500.
001670     ACCEPT (09, 45) QTREP-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001680     IF E = "01" GO TO R-0400.
001690     IF DECIMAL-EMPCE = "S"
001700        MOVE QTREP-02R TO ED-DEC DISPLAY (09, 45) ED-DEC
001710     ELSE
001720        MOVE QTREP-02 TO ED-INT DISPLAY (09, 45) ED-INT.
001730 R-0600.
001740     ACCEPT (10, 45) QTMIN-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001750     IF E = "01" GO TO R-0500.
001760     IF DECIMAL-EMPCE = "S"
001770        MOVE QTMIN-02R TO ED-DEC DISPLAY (10, 45) ED-DEC
001780     ELSE
001790        MOVE QTMIN-02 TO ED-INT DISPLAY (10, 45) ED-INT.
001800 R-0700.
001810     ACCEPT (11, 45) QTLOJ-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001820     IF E = "01" GO TO R-0600.
001830     IF DECIMAL-EMPCE = "S"
001840        MOVE QTLOJ-02R TO ED-DEC DISPLAY (11, 45) ED-DEC
001850     ELSE
001860        MOVE QTLOJ-02 TO ED-INT DISPLAY (11, 45) ED-INT.
001870 R-0800.
001880     ACCEPT (12, 45) QTSAI-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001890     IF E = "01" GO TO R-0700.
001900     IF DECIMAL-EMPCE = "S"
001910        MOVE QTSAI-02R TO ED-DEC DISPLAY (12, 45) ED-DEC
001920     ELSE
001930        MOVE QTSAI-02 TO ED-INT DISPLAY (12, 45) ED-INT.
001940 R-0900.
001950     ACCEPT (13, 45) VED-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
001960     IF E = "01" GO TO R-0800.
001970     MOVE VED-02R TO ED1 DISPLAY (13, 45) ED1.
001980     IF OPCAO = "I" GO TO R-1200.
001990 R-1000.
002000     ACCEPT (14, 45) MESNOV-02 WITH UPDATE
002010        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002020     IF E = "01" GO TO R-0900.
002030     IF MESNOV-02 > 12 GO TO R-1000.
002040 R-1100.
002050     ACCEPT (14, 48) ANONOV-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002060     IF E = "01" GO TO R-1000.
002070 R-1150.
002080     ACCEPT (15, 45) SUG-02 WITH UPDATE.
002090     IF SUG-02 =  "!" GO TO R-1100.
002100     IF SUG-02 = "S" OR "N"
002110        NEXT SENTENCE
002120     ELSE
002130        GO TO R-1150.
002140 R-1200.
002150     DISPLAY (22, 14) "INCLUIR (S/<N>):".
002160     ACCEPT (22, 31) RESP WITH UPDATE.
002170     DISPLAY (22, 14) EX-MENS.
002180     IF RESP NOT = "S" GO TO ROT-I.
002190     WRITE REG-02 INVALID KEY
002200        DISPLAY (22, 14) "ERRO NA GRAVACAO ACE02 FS=>" FS
002210        ACCEPT (22, 78) CR WITH UPDATE
002220        DISPLAY (22, 14) EX-MENS
002230        GO TO ROT-I.
002240     DISPLAY (22, 14) "I N C L U I D O ".
002250     ACCEPT (22, 78) CR WITH UPDATE.
002260     DISPLAY (22, 14) EX-MENS.
002270     GO TO ROT-I.
002280 ROT-A.
002290     MOVE SPACES TO RESP.
002300     PERFORM R-0200.
002310 R-1300.
002320     ACCEPT (07, 45) LOJA-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002330     IF E = "01" GO TO R-0100.
002340 R-1400.
002350     ACCEPT (08, 45) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002360     IF E = "01" GO TO R-1300.
002370     MOVE COD-W TO COD-02.
002380     READ ACE02 INVALID KEY
002390         DISPLAY (22, 14) "MOVIMENTO NAO ENCONTRADO < > "
002400         ACCEPT (22, 78) CR WITH UPDATE
002410         DISPLAY (22, 14) EX-MENS
002420         GO TO ROT-A.
002430 R-1500.
002440     IF DECIMAL-EMPCE = "S"
002450        MOVE QTREP-02R TO ED-DEC DISPLAY (09, 45) ED-DEC
002460        MOVE QTMIN-02R TO ED-DEC DISPLAY (10, 45) ED-DEC
002470        MOVE QTLOJ-02R TO ED-DEC DISPLAY (11, 45) ED-DEC
002480        MOVE QTSAI-02R TO ED-DEC DISPLAY (12, 45) ED-DEC
002490     ELSE
002500        MOVE QTREP-02 TO ED-INT DISPLAY (09, 45) ED-INT
002510        MOVE QTMIN-02 TO ED-INT DISPLAY (10, 45) ED-INT
002520        MOVE QTLOJ-02 TO ED-INT DISPLAY (11, 45) ED-INT
002530        MOVE QTSAI-02 TO ED-INT DISPLAY (12, 45) ED-INT.
002540     MOVE VED-02R TO ED1  DISPLAY (13, 45) ED1.
002550     DISPLAY (14, 45) MESNOV-02.
002560     DISPLAY (14, 48) ANONOV-02.
002570     DISPLAY (15, 45) SUG-02.
002580 R-1600.
002590     ACCEPT (09, 45) QTREP-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002600     IF E = "01" GO TO R-0400.
002610     IF DECIMAL-EMPCE = "S"
002620        MOVE QTREP-02R TO ED-DEC DISPLAY (09, 45) ED-DEC
002630     ELSE
002640        MOVE QTREP-02 TO ED-INT DISPLAY (09, 45) ED-INT.
002650 R-1700.
002660     ACCEPT (10, 45) QTMIN-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002670     IF E = "01" GO TO R-1600.
002680     IF DECIMAL-EMPCE = "S"
002690        MOVE QTMIN-02R TO ED-DEC DISPLAY (10, 45) ED-DEC
002700     ELSE
002710        MOVE QTMIN-02 TO ED-INT DISPLAY (10, 45) ED-INT.
002720 R-1800.
002730     ACCEPT (12, 45) QTSAI-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002740     IF E = "01" GO TO R-1800.
002750     IF DECIMAL-EMPCE = "S"
002760        MOVE QTSAI-02R TO ED-DEC DISPLAY (12, 45) ED-DEC
002770     ELSE
002780        MOVE QTSAI-02 TO ED-INT DISPLAY (12, 45) ED-INT.
002790 R-1900.
002800     ACCEPT (13, 45) VED-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002810     IF E = "01" GO TO R-1800.
002820     MOVE VED-02R TO ED1 DISPLAY (13, 45) ED1.
002830 R-2000.
002840     ACCEPT (14, 45) MESNOV-02 WITH UPDATE
002850        AUTO-SKIP.
           ACCEPT E FROM ESCAPE KEY.
002860     IF E = "01" GO TO R-1900.
002870     IF MESNOV-02 < 1 OR > 12 GO TO R-2000.
002880 R-2100.
002890     ACCEPT (14, 48) ANONOV-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
002900     IF E = "01" GO TO R-2000.
002910     IF ANONOV-02 = ZEROS GO TO R-2100.
002920 R-2150.
002930     ACCEPT (15, 45) SUG-02 WITH UPDATE.
002940     IF SUG-02 =  "!" GO TO R-2100.
002950 R-2200.
002960     DISPLAY (22, 14) "ALTERAR (S/<N>):".
002970     ACCEPT (22, 31) RESP WITH UPDATE.
002980     DISPLAY (22, 14) EX-MENS.
002990     IF RESP NOT = "S" GO TO ROT-A.
003000     REWRITE REG-02 INVALID KEY
003010         DISPLAY (22, 14) "ERRO NA REGRAVACAO DO ACE02=>" FS
003020         ACCEPT (22, 78) CR WITH UPDATE
003030         DISPLAY (22, 14) EX-MENS
003040         GO TO ROT-A.
003050     DISPLAY (22, 14) "A L T E R A D O ".
003060     ACCEPT (22, 78) CR WITH UPDATE
003070     DISPLAY (22, 14) EX-MENS.
003080     GO TO ROT-A.
003090 ROT-E.
003100     MOVE SPACES TO RESP.
003110     PERFORM R-0200.
003120 R-2300.
003130     ACCEPT (07, 45) LOJA-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003140     IF E = "01" GO TO R-0100.
003150 R-2400.
003160     ACCEPT (08, 45) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003170     IF E = "01" GO TO R-2300.
003180     MOVE COD-W TO COD-02.
003190     READ ACE02 INVALID KEY
003200         DISPLAY (22, 14) "MOVIMENTO NAO ENCONTRADO < > "
003210         ACCEPT (22, 78) CR WITH UPDATE
003220         DISPLAY (22, 14) EX-MENS
003230         GO TO ROT-E.
003240     PERFORM R-1500.
003250 R-2500.
003260     DISPLAY (22, 14) "EXCLUIR (S<N>)".
003270     ACCEPT (22, 29) RESP WITH UPDATE.
003280     DISPLAY (22, 14) EX-MENS.
003290     IF RESP NOT = "S" GO TO ROT-E.
003300     DELETE ACE02 INVALID KEY
003310        DISPLAY (22, 14) "ERRO NA EXCLUSAO DO ACE02=>" FS
003320        ACCEPT (22, 78) CR WITH UPDATE
003330        DISPLAY (22, 14) EX-MENS
003340        GO TO ROT-E.
003350     DISPLAY (22, 14) "E X C L U I D O ".
003360     ACCEPT (22, 78) CR WITH UPDATE
003370     DISPLAY (22, 14) EX-MENS.
003380     GO TO ROT-E.
003390 ROT-P.
003400     MOVE SPACES TO RESP.
003410     PERFORM R-0200.
003420 R-2600.
003430     ACCEPT (07, 45) LOJA-02 WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003440     IF E = "01" GO TO R-0100.
003450 R-2700.
003460     ACCEPT (08, 45) COD-W WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003470     IF E = "01" GO TO R-2600.
003480     MOVE COD-W TO COD-02.
003490     READ ACE02 INVALID KEY
003500         DISPLAY (22, 14) "MOVIMENTO NAO ENCONTRADO < > "
003510         ACCEPT (22, 14) CR WITH UPDATE
003520         DISPLAY (22, 14) EX-MENS
003530         GO TO ROT-P.
003540     PERFORM R-1500.
003550 R-2800.
003560     DISPLAY (22, 14) "CONTINUA PESQUISANDO (S/<N>).:".
003570     ACCEPT (22, 45) RESP WITH UPDATE.
003580     DISPLAY (22, 14) EX-MENS.
003590     IF RESP NOT = "S" GO TO R-0100.
003600     GO TO ROT-P.
003610 ROT-L.
003620     MOVE SPACES TO RESP.
003630     OPEN OUTPUT REL.
003640     IF FS NOT = "00"
003650        MOVE "MCE1301A" TO CODMENFS
003660        MOVE "RELATO"   TO ARQFS
003670        PERFORM TESTA-FS THRU SAI-TESTA-FS
003680        CLOSE REL GO TO R-9999.
003690 R-2900.
003700     DISPLAY (04, 23) "RELATORIO DE ESTOQUE NAS LOJAS ".
003710     DISPLAY (09, 23) "INFORME LOJA INICIAL: ..".
003720     DISPLAY (11, 23) "INFORME LOJA FINAL..: ..".
003730     DISPLAY (13, 23) "ESTOQUE ZERO <S/N/T>: .".
003740     DISPLAY (15, 23) "ORDEM ALFABETICA S/N: .".
003750     DISPLAY (17, 23) "IMPRIMIR <S/<N>>....: .".
003760 R-3000.
003770     ACCEPT (09, 45) LOJAI WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003780     IF E = "01"
003790        CLOSE REL
003800        GO TO R-0100.
003810 R-3100.
003820     ACCEPT (11, 45) LOJAF WITH UPDATE.
           ACCEPT E FROM ESCAPE KEY.
003830     IF E = "01" GO TO R-3000.
003840     IF LOJAF < LOJAI GO TO R-3100.
003850 R-3150.
003860     ACCEPT (13, 45) RESP-W WITH UPDATE.
003870     IF RESP-W = "S" OR "T" OR "N"
003880        NEXT SENTENCE
003890     ELSE
003900        GO TO R-3150.
003910 R-3170.
003920     ACCEPT (15, 45) OPCAO WITH UPDATE.
003930 R-3200.
003940     ACCEPT (17, 45) RESP WITH UPDATE.
003950     IF RESP NOT = "S"
003960        CLOSE REL GO TO R-0100.
003970     IF OPCAO = "S"
003980        GO TO ROT-LN
003990     ELSE
004000        GO TO ROT-LA.
004010*=========================================*
004020* EMISSAO DO RELATORIO POR ORDEM NUMERICA *
004030*=========================================*
004040 ROT-LN.
004050     DISPLAY (17, 23) "<< I M P R I M I N D O >>".
004060     MOVE LOW-VALUES TO CHAVE-02.
004070     MOVE LOJAI      TO LOJA-02.
004080     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
004090         DISPLAY (22, 14) "LOJA INICIAL INVALIDA"
004100         ACCEPT (22, 78) CR WITH UPDATE
004110         DISPLAY (22, 14) EX-MENS
004120         GO TO ROT-L.
004130 R-3400.
004140     READ ACE02 NEXT RECORD AT END
004150        CLOSE REL GO TO R-0100.
004160     IF SUG-02 NOT = "S" GO TO R-3400.
004170     IF RESP-W = "T"
004180        GO TO R-3450.
004190     IF RESP-W = "S"
004200        IF QTLOJ-02 = ZEROS
004210           GO TO R-3450
004220        ELSE
004230           GO TO R-3400.
004240     IF RESP-W = "N"
004250        IF QTLOJ-02 > ZEROS
004260           GO TO R-3450
004270        ELSE
004280           GO TO R-3400.
004290 R-3450.
004300     IF LOJA-02 > LOJAF
004310        CLOSE REL GO TO R-0100.
004320     IF CTL > 58
004330        ADD 1 TO CTP
004340        MOVE CTP TO PAG-CAB1A
004350        MOVE 5 TO CTL
004360        WRITE REG-REL FROM CAB1A AFTER PAGE
004370        MOVE "RCE1301" TO NOME-RELA
004380        WRITE REG-REL FROM CAB2A AFTER 1
004390        WRITE REG-REL FROM CAB132 AFTER 1
004400        WRITE REG-REL FROM CAB2  AFTER 1
004410        WRITE REG-REL FROM CAB132 AFTER 1
004420        WRITE REG-REL FROM CAB3  AFTER 2
004430        WRITE REG-REL FROM CAB4  AFTER 1.
004440     MOVE COD-02    TO COD-01.
004450     READ ACE01 INVALID KEY
004460        MOVE "PRODUTO NAO CADASTRADO NO ACE01" TO DESC-01.
004470     MOVE DESC-01   TO DESC-5.
004480     MOVE LOJA-02   TO LOJA-5.
004490     MOVE COD-02    TO COD-5.
004500     IF DECIMAL-EMPCE = "S"
004510        MOVE QTREP-02R TO ED-DEC MOVE ED-DEC TO QTREP-5
004520        MOVE QTMIN-02R TO ED-DEC MOVE ED-DEC TO QTMIN-5
004530        MOVE QTLOJ-02R TO ED-DEC MOVE ED-DEC TO QTLOJ-5
004540        MOVE QTSAI-02R TO ED-DEC MOVE ED-DEC TO QTSAI-5
004550     ELSE
004560        MOVE QTREP-02  TO ED-INT MOVE ED-INT TO QTREP-5
004570        MOVE QTMIN-02  TO ED-INT MOVE ED-INT TO QTMIN-5
004580        MOVE QTLOJ-02  TO ED-INT MOVE ED-INT TO QTLOJ-5
004590        MOVE QTSAI-02  TO ED-INT MOVE ED-INT TO QTSAI-5.
004600     MOVE MESNOV-02    TO MESNOV-5.
004610     MOVE ANONOV-02    TO ANONOV-5.
004620     MOVE VED-02R      TO VED-5.
004630     IF QTREP-02R = ZEROS MOVE SPACES TO QTREP-5.
004640     IF QTMIN-02R = ZEROS MOVE SPACES TO QTMIN-5.
004650     IF QTLOJ-02R = ZEROS MOVE SPACES TO QTLOJ-5.
004660     IF QTSAI-02R = ZEROS MOVE SPACES TO QTSAI-5.
004670     WRITE REG-REL FROM CAB5 AFTER 1.
004680     ADD 1 TO CTL.
004690     GO TO R-3400.
004700*===========================================*
004710* EMISSAO DO RELATORIO POR ORDEM ALFABETICA *
004720*===========================================*
004730 ROT-LA.
004740     MOVE ZEROS TO CTP.
004750     MOVE 70    TO CTL.
004760     OPEN OUTPUT ACEAUX.
004770     CLOSE ACEAUX OPEN I-O ACEAUX.
004780     IF FS NOT = "00"
004790        MOVE "MCE1301" TO CODMENFS
004800        MOVE "ACEAUX"  TO ARQFS
004810        PERFORM TESTA-FS THRU SAI-TESTA-FS
004820        CLOSE ACEAUX GO TO R-9999.
004830     MOVE LOW-VALUES TO CHAVE-02.
004840     MOVE LOJAI      TO LOJA-02.
004850     START ACE02 KEY IS NOT < CHAVE-02 INVALID KEY
004860         DISPLAY (22, 14) "LOJA INICIAL INVALIDA"
004870         ACCEPT (22, 78) CR WITH UPDATE
004880         DISPLAY (22, 14) EX-MENS
004890         GO TO ROT-L.
004900 R-3600.
004910     READ ACE02 NEXT RECORD AT END
004920        GO TO R-3700.
004930     IF SUG-02 NOT = "S" GO TO R-3600.
004940     IF RESP-W = "T"
004950        GO TO R-3650.
004960     IF RESP-W = "S"
004970        IF QTLOJ-02 = ZEROS
004980           GO TO R-3650
004990        ELSE
005000           GO TO R-3600.
005010     IF RESP-W = "N"
005020        IF QTLOJ-02 > ZEROS
005030           GO TO R-3650
005040        ELSE
005050           GO TO R-3600.
005060 R-3650.
005070     IF LOJA-02 > LOJAF
005080        GO TO R-3700.
005090     MOVE COD-02    TO COD-01 COD-AUX.
005100     READ ACE01 INVALID KEY
005110       MOVE "PRODUTO NAO ENCONTRADO DO ACE01" TO DESC-01.
005120     MOVE DESC-01   TO DESC-AUX.
005130     MOVE LOJA-02   TO LOJA-AUX.
005140     MOVE COD-02    TO COD-AUX.
005150     MOVE QTREP-02  TO QTREP-AUX
005160     MOVE QTMIN-02  TO QTMIN-AUX
005170     MOVE QTLOJ-02  TO QTLOJ-AUX
005180     MOVE QTSAI-02  TO QTSAI-AUX
005190     MOVE MESNOV-02 TO MESNOV-AUX.
005200     MOVE ANONOV-02 TO ANONOV-AUX.
005210     MOVE VED-02    TO VED-AUX.
005220     WRITE REG-AUX INVALID KEY
005230        DISPLAY (22, 14) "ERRO NA GRAVACAO DO PRODUTO " COD-01
005240        call "system" using TEMPO2
005250        DISPLAY (22, 14) EX-MENS.
005260     GO TO R-3600.
005270 R-3700.
005280     MOVE SPACES TO CH-AUX.
005290     START ACEAUX KEY IS NOT < CH-AUX INVALID KEY
005300         DISPLAY (22, 14) "ARQUIVO AUXILIAR VAZIO < >"
005310         ACCEPT (22, 78) CR WITH UPDATE
005320         DISPLAY (22, 14) EX-MENS
005330         GO TO ROT-L.
005340 R-3800.
005350     READ ACEAUX NEXT RECORD AT END
005360        CLOSE REL GO TO R-0100.
005370 R-3850.
005380     IF CTL > 58
005390        ADD 1 TO CTP
005400        MOVE CTP TO PAG-CAB1A
005410        MOVE 5 TO CTL
005420        WRITE REG-REL FROM CAB1A AFTER PAGE
005430        MOVE "RCE1301" TO NOME-RELA
005440        WRITE REG-REL FROM CAB2A AFTER 1
005450        WRITE REG-REL FROM CAB132 AFTER 1
005460        WRITE REG-REL FROM CAB2  AFTER 1
005470        WRITE REG-REL FROM CAB132 AFTER 1
005480        WRITE REG-REL FROM CAB3  AFTER 2
005490        WRITE REG-REL FROM CAB4  AFTER 1.
005500     MOVE DESC-AUX   TO DESC-5.
005510     MOVE LOJA-AUX   TO LOJA-5.
005520     MOVE COD-AUX    TO COD-5.
005530     IF DECIMAL-EMPCE = "S"
005540        MOVE QTREP-AUXR TO ED-DEC MOVE ED-DEC TO QTREP-5
005550        MOVE QTMIN-AUXR TO ED-DEC MOVE ED-DEC TO QTMIN-5
005560        MOVE QTLOJ-AUXR TO ED-DEC MOVE ED-DEC TO QTLOJ-5
005570        MOVE QTSAI-AUXR TO ED-DEC MOVE ED-DEC TO QTSAI-5
005580     ELSE
005590        MOVE QTREP-AUX  TO ED-INT MOVE ED-INT TO QTREP-5
005600        MOVE QTMIN-AUX  TO ED-INT MOVE ED-INT TO QTMIN-5
005610        MOVE QTLOJ-AUX  TO ED-INT MOVE ED-INT TO QTLOJ-5
005620        MOVE QTSAI-AUX  TO ED-INT MOVE ED-INT TO QTSAI-5.
005630     MOVE MESNOV-AUX    TO MESNOV-5.
005640     MOVE ANONOV-AUX    TO ANONOV-5.
005650     MOVE VED-AUXR      TO VED-5.
005660     IF QTREP-AUXR = ZEROS MOVE SPACES TO QTREP-5.
005670     IF QTMIN-AUXR = ZEROS MOVE SPACES TO QTMIN-5.
005680     IF QTLOJ-AUXR = ZEROS MOVE SPACES TO QTLOJ-5.
005690     IF QTSAI-AUXR = ZEROS MOVE SPACES TO QTSAI-5.
005700     WRITE REG-REL FROM CAB5 AFTER 1.
005710     ADD 1 TO CTL.
005720     GO TO R-3800.
005730 R-9999.
005740     CLOSE ACE01 ACE02 ACE05.
           stop run.
005750     EXIT PROGRAM.
       sai-R-9999.
           exit.
000920 COPY "/dados1/book/CPYPDFS".

005760*-----------------------F-I-M-----------------
